[{"Tags": [], "URL": "http://blogs.1e.com/2011/02/22/federal-news-radio-how-to-save-energy-at-your-agency/", "Area": ["1E News", "Events", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Federal News Radio: HOW TO SAVE ENERGY AT YOUR AGENCY - 1E Blog", "Author": "Federal News Radio: HOW TO SAVE ENERGY AT YOUR AGENCY - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Federal News Radio: HOW TO SAVE ENERGY AT YOUR AGENCY | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Federal News Radio: HOW TO SAVE ENERGY AT YOUR AGENCY | 1E Blogs -- Topsy.com"}], "Content": ["1E has more than 14 million licensed users across 1,100 organizations such as the U.S. Air Force, U.S. Army and the Department of Veterans Affairs. This interview will give you insight on saving energy and reducing your carbon foot print as well.", "Listen in here", "http://www.federalnewsradio.com/?sid=2280891&nid=83"], "Author": ["Rod Trent"], "Date": "2011-02-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/21/1e-pioneers-in-green-it-power-management-ecopreneurist/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1E: Pioneers in Green IT & Power Management ", "Author": "1E: Pioneers in Green IT & Power Management "}, {"Comment": "Pingback: 1E: Pioneers in Green IT & Power Management  Ecopreneurist - 1E Blog", "Author": "1E: Pioneers in Green IT & Power Management  Ecopreneurist - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E: Pioneers in Green IT & Power Management ", "Author": "Tweets that mention 1E: Pioneers in Green IT & Power Management "}, {"Comment": "Pingback: Tweets that mention 1E: Pioneers in Green IT & Power Management  Ecopreneurist | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E: Pioneers in Green IT & Power Management  Ecopreneurist | 1E Blogs -- Topsy.com"}], "Content": ["1E: Pioneers in Green IT & Power Management  Ecopreneurist"], "Author": ["Rod Trent"], "Date": "2011-02-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/21/announcing-the-1e-community/", "Area": ["1E Community", "1E News"], "Comments": [{"Comment": "Pingback: Announcing the 1E Community! - 1E Blog", "Author": "Announcing the 1E Community! - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Announcing the 1E Community! | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Announcing the 1E Community! | 1E Blogs -- Topsy.com"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-02-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/21/1e-study-87-of-federal-agencies-may-not-be-ready-to-lower-energy-use/", "Area": ["1E News", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: 1E Study: 87% of Federal Agencies May Not Be Ready to Lower Energy Use - 1E Blog", "Author": "1E Study: 87% of Federal Agencies May Not Be Ready to Lower Energy Use - 1E Blog"}], "Content": ["The study found that more than a quarter of respondents think their federal agency is not required to comply with mandatory energy reduction programs. Basic awareness of programs varied:", "Read the full article"], "Author": ["Rod Trent"], "Date": "2011-02-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/21/ealing-tweetup-could-it-be-the-end-of-an-era/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Ealing Tweetup ", "Author": "Ealing Tweetup "}, {"Comment": "Pingback: Ealing Tweetup  could it be the end of an era? - 1E Blog", "Author": "Ealing Tweetup  could it be the end of an era? - 1E Blog"}], "Content": ["1E is the sponsor of the steadily growing and popular Ealing Tweetups. Theres some info posted on ComputerWeekly.com about them if youre willing to attend in the future.", "Since early in 2009 I have been hosting the semi-regular Ealing tweetups. I started this because I lived in Ealing (west London for the non-Londoners) and I noticed quite a few Twitter messages mentioning the local area, so one day I tried arranging a pub meeting for locals who use Twitter.", "Read the rest", "Ealing Tweetup  could it be the end of an era?  The SocialITe"], "Author": ["Rod Trent"], "Date": "2011-02-21 00:00:00"}, {"Tags": ["green it", "sustainability", "ul environment"], "URL": "http://blogs.1e.com/2011/02/21/sustainability-from-carpets-to-computers/", "Area": ["Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Sustainability from Carpets to Computers - 1E Blog", "Author": "Sustainability from Carpets to Computers - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Sustainability from Carpets to Computers | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Sustainability from Carpets to Computers | 1E Blogs -- Topsy.com"}], "Content": ["", "", "", "Some of the things that are examined during the review process include product documentation, Energy Star 5.0 compliance, and manufacturing. By going beyond the well trodden Energy Star path and venturing into manufacture and component sourcing for instance, the UL certification takes IT product selection to the next phase."], "Author": ["Phil Wilcock"], "Date": "2011-02-21 00:00:00"}, {"Tags": ["datacenter efficiency", "global foundation services", "microsoft", "nightwatchman server edition"], "URL": "http://blogs.1e.com/2011/02/21/take-a-peek-at-microsoft-global-foundation-services/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: Take a Peek at Microsoft Global Foundation Services - 1E Blog", "Author": "Take a Peek at Microsoft Global Foundation Services - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Take a Peek at Microsoft Global Foundation Services | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Take a Peek at Microsoft Global Foundation Services | 1E Blogs -- Topsy.com"}], "Content": ["While fumbling around the web this weekend, I came upon one of those sites that draws you in like a moth to a flame.."], "Author": ["Phil Wilcock"], "Date": "2011-02-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/19/1e-are-such-wonderful-people/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1E are such wonderful people! - 1E Blog", "Author": "1E are such wonderful people! - 1E Blog"}], "Content": ["We recently sponsored the Ealing Tweetup and the participants posted some great videos  one of which (the one posted to this page) gives an awesome shout out to 1E!", "", "Theres more, too. Take a look here:", "http://www.youtube.com/user/markhillary"], "Author": ["Rod Trent"], "Date": "2011-02-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/18/few-agencies-ready-for-energy-reduction-mandates/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Few Agencies Ready for Energy Reduction Mandates - 1E Blog", "Author": "Few Agencies Ready for Energy Reduction Mandates - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Few Agencies Ready for Energy Reduction Mandates | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Few Agencies Ready for Energy Reduction Mandates | 1E Blogs -- Topsy.com"}], "Content": ["Only 13 percent of federal agencies are ready to comply with energy reduction requirements, according to a survey by an IT efficiency software company.", "More than a quarter of respondents thought that their agency was not required to comply with such mandates. Meanwhile, 23 percent were unaware of these requirements."], "Author": ["Rod Trent"], "Date": "2011-02-18 00:00:00"}, {"Tags": ["green it", "pc power management"], "URL": "http://blogs.1e.com/2011/02/18/theres-not-enough-love-in-the-it-world/", "Area": ["Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: There", "Author": "There"}, {"Comment": "Pingback: Theres Not Enough Love in the (IT) World - 1E Blog", "Author": "Theres Not Enough Love in the (IT) World - 1E Blog"}], "Content": ["IT pros do battle every day  with cyber attackers, stubborn hardware, buggy software, clueless users, and the endless demands of other departments within their organization. But few can compare to the conflicts raging within IT itself.", "How true. But what Dans point is a very serious one. I can clearly remember working on several projects where the planning and implementation of a large Systems Management infrastructure paled into insignificance against the unholy wars that raged within IT. These arguments varied between budgets, boundaries, support, management buy-in and security to name a few. Some of these disputes were so vociferous and went on for so long that I started to wonder if some of the individuals involved actually worked for the competition!", "Heres a possible example.", "Then the Security Team gets wind of things. So theres this software out there that going to log off users, trash all of their work and power off their computer. What!? More problems.", "Oh, and by the way, this software need a new database. The Database Team wont mind another one will they? Are you starting to get the picture?", "What we may have in play here are large egos, poor management and lack of leadership, combined with overzealous team loyalties. Yet these issues can be avoided by some simple communications.", "For a start the project team should outline the benefits of the software to the Operations Team. Explain the cost savings, improved computer health and CO2 savings. Discuss the same with user groups (its their workplace machines that will be affected!), and try not to be too patronizing! Apply the same principals to all teams. Yes, even the security dudes, you will have to tell them sooner or later!", "Remember, Green IT projects not only save money and help improve the bottom line, (and lets not forget that IT is there to support the bottom line) they help to reduce our impact on the planet.", "We need to love our planet a bit more, love the Ops team, love the Database Dudes, and yes, even Security guys need a hug sometimes too"], "Author": ["Phil Wilcock"], "Date": "2011-02-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/17/mms-2011-vip-sweepstakes-mms2011/", "Area": ["1E News", "Events", "MMS"], "Comments": [{"Comment": "Pingback: MMS 2011 VIP Sweepstakes! #mms2011 - 1E Blog", "Author": "MMS 2011 VIP Sweepstakes! #mms2011 - 1E Blog"}, {"Comment": "Pingback: Tweets that mention MMS 2011 VIP Sweepstakes! #mms2011 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention MMS 2011 VIP Sweepstakes! #mms2011 | 1E Blogs -- Topsy.com"}], "Content": ["Prizes include:", "To read more and enter the sweepstakes:", "https://microsoft.promo.eprize.com/mms/"], "Author": ["Rod Trent"], "Date": "2011-02-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/17/1e-study-finds-that-87-percent-of-federal-agencies-may-not-be-ready-to-comply-with-mandatory-energy-reduction-rules/", "Area": ["1E News", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: 1E Study Finds That 87 Percent of Federal Agencies May Not Be Ready to Comply with Mandatory Energy Reduction Rules - 1E Blog", "Author": "1E Study Finds That 87 Percent of Federal Agencies May Not Be Ready to Comply with Mandatory Energy Reduction Rules - 1E Blog"}], "Content": ["Energy and Server Efficiency Solutions Could Save Fed $6 Billion Over the Next Five Years; Research Suggests Federal Agencies Top Energy Management Priorities are Consolidating Hardware and Generating Internal Awareness", "New York, NY (Vocus/PRWEB) February 16, 2011", "The federal government faces major budgetary challenges, said Nick Milne-Home, president of 1E. We are concerned that many federal agencies may not be aware of mandatory energy reduction programs, which should generate substantial savings for all. We estimate that federal agencies could save nearly $6 billion over the next five years in energy and server costs alone.", "The study found that more than a quarter of respondents think their federal agency is not required to comply with mandatory energy reduction programs. Basic awareness of programs varied  50 percent were aware of the Federal Data Center Consolidation Initiative, 38 percent were aware of the Office of Management and Budget (OMB) Scorecards and 31 percent were aware of the Executive Order 13423 and Executive Order 13514. Meanwhile, twenty-three percent of respondents were unaware of any such programs.", "Virtual server sprawl may be set to become a larger problem within federal agency data centers, as 58 percent of respondents were aware of the issue, yet 29 percent do not monitor their virtual servers performance to determine if those assets are doing useful work, or the tasks for which they were bought and provisioned. As many respondents indicated that their energy management strategy is to consolidate hardware, the survey suggests that underused virtual servers will become a greater cost drain on agencies if gone unchecked.", "1E executed this research project in Q4 2010. Twenty-six respondents participated in the study, all of which worked within an IT role at a federal agency."], "Author": ["Rod Trent"], "Date": "2011-02-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/17/significant-cost-savings-for-nhs-trust-through-power-management-software/", "Area": ["1E News", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Significant cost savings for NHS Trust through power management software - 1E Blog", "Author": "Significant cost savings for NHS Trust through power management software - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-02-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/16/1e-nomad-versus-the-texas-winter/", "Area": ["1E News", "1E Products", "Nomad"], "Comments": [{"Comment": "Pingback: 1E Nomad versus the Texas Winter - 1E Blog", "Author": "1E Nomad versus the Texas Winter - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E Nomad versus the Texas Winter | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E Nomad versus the Texas Winter | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: What is 1E Nomad? | 1E Blogs", "Author": "What is 1E Nomad? | 1E Blogs"}], "Content": ["According to news coverage, this may actually be the new norm. I wouldnt go as far as to categorize these feats of nature as disasters (yeah  Im not a scientist), but if this is the new norm, has anyone considered the effect weather of this type has on business? To some businesses, it really could be considered a disaster unless they are prepared for the new norm.", "Rough weather of any sort can force office workers to be stranded at home. Thankfully, technology has progressed to the point where employees can work at home if its needed, but even that is limited somewhat. What happens when a large, critical software package or security update needs to be delivered to all computers in an organization, no matter their location or connection type? During severe weather, many employees will be dialed in over VPNs which have limited pipes, as do their home Internet connections. To expand on this a bit, say an employee was in the office the day before, a large software package distribution was initiated, but the user logged-off and went home before it was able to complete. What then?", "Be prepared for the new norm, or whatever else may happen. Check out our Nomad product when you get a chance.", "http://staging.1e.com/softwareproducts/nomadenterprise/index.aspx"], "Author": ["Rod Trent"], "Date": "2011-02-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/15/1e-at-mms-2011the-official-word-mms2011/", "Area": ["1E News", "MMS"], "Comments": [{"Comment": "Pingback: 1E at MMS 2011", "Author": "1E at MMS 2011"}, {"Comment": "Pingback: 1E at MMS 2011the official word #mms2011 - 1E Blog", "Author": "1E at MMS 2011the official word #mms2011 - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E at MMS 2011", "Author": "Tweets that mention 1E at MMS 2011"}, {"Comment": "Pingback: Tweets that mention 1E at MMS 2011the official word #mms2011 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E at MMS 2011the official word #mms2011 | 1E Blogs -- Topsy.com"}], "Content": ["See how 1E is Empowering Efficient IT in booth presentations and demos on"], "Author": ["Rod Trent"], "Date": "2011-02-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/15/key-it-efficiency-trends-for-2011/", "Area": ["1E News", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Key IT Efficiency Trends for 2011 - 1E Blog", "Author": "Key IT Efficiency Trends for 2011 - 1E Blog"}], "Content": ["Here you go. Do you agree? Do all of these apply to you? Are there more? Feel free to comment.", "", "Based on feedback from its large customer community, 1E expects the below topics to impact 2011."], "Author": ["Rod Trent"], "Date": "2011-02-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/15/newham-hospital-saves-18500-with-power-management-from-1e-and-microsoft/", "Area": ["1E News", "ConfigMgr", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Newham Hospital saves 18,500 with power management from 1E and Microsoft - 1E Blog", "Author": "Newham Hospital saves 18,500 with power management from 1E and Microsoft - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Newham Hospital saves ", "Author": "Tweets that mention Newham Hospital saves "}, {"Comment": "Pingback: Tweets that mention Newham Hospital saves 18,500 with power management from 1E and Microsoft #1E -- Topsy.com", "Author": "Tweets that mention Newham Hospital saves 18,500 with power management from 1E and Microsoft #1E -- Topsy.com"}], "Content": ["The trust said it expects to save around 18,500 a year with the new tools.", "Shaun Jeffery, ICT operations manager at Newham University Hospital NHS Trust, said: One month in and we were already saving approximately 1,250 per month across just the PCs which have had the agreed power policy applied. In just one year, we stand to reduce our carbon emissions by approximately 143 metric tonnes a year.", "", "Ford Expects to Save More Than $1 Million with PC Power Management", "Better Together: 1E NightWatchman  Extending System Center Configuration Manager 2007 R3 for Advanced Power Management", "Microsoft Whitepaper: Effective Energy Management"], "Author": ["Rod Trent"], "Date": "2011-02-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/15/its-biggest-money-wasters-from-cio-com/", "Area": ["1E News", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Tweets that mention ", "Author": "Tweets that mention "}, {"Comment": "Pingback: Tweets that mention ITs Biggest Money Wasters from CIO.com #1E -- Topsy.com", "Author": "Tweets that mention ITs Biggest Money Wasters from CIO.com #1E -- Topsy.com"}], "Content": ["ITs biggest money waster No. 1: Dusty software licenses. Collectively, U.S. companies are paying billions for shelfware  whether its software that was never adopted or for employees they no longer have, and often at prices that are higher than what is actually needed. A 2010 IDC survey of midsize and large businesses found that well over half of enterprise applications are underutilized, with anywhere from 25 percent to more than 75 percent of licenses paid for but unused, notes IDC analyst Amy Konar.", "Click to read the rest of the article", ""], "Author": ["Rod Trent"], "Date": "2011-02-15 00:00:00"}, {"Tags": ["software licensing"], "URL": "http://blogs.1e.com/2011/02/15/reminder-1e-amp-webinar-today-taking-control-of-your-software-spend/", "Area": ["Software License Optimization"], "Comments": [{"Comment": "Pingback: Reminder: 1E AMP Webinar Today ", "Author": "Reminder: 1E AMP Webinar Today "}, {"Comment": "Pingback: Reminder: 1E AMP Webinar Today  Taking Control of Your Software Spend - 1E Blog", "Author": "Reminder: 1E AMP Webinar Today  Taking Control of Your Software Spend - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Reminder: 1E AMP Webinar Today ", "Author": "Tweets that mention Reminder: 1E AMP Webinar Today "}, {"Comment": "Pingback: Tweets that mention Reminder: 1E AMP Webinar Today  Taking Control of Your Software Spend | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Reminder: 1E AMP Webinar Today  Taking Control of Your Software Spend | 1E Blogs -- Topsy.com"}], "Content": ["The challenges faced today controlling software spend", "How using AMP can give you three simple steps to reduce your software spend", "How software audits can be conducted in hours rather than days", "The results and savings you can make with AMP", "Q&A", ""], "Author": ["Phil Wilcock"], "Date": "2011-02-15 00:00:00"}, {"Tags": ["AMP", "software licensing"], "URL": "http://blogs.1e.com/2011/02/15/dont-get-caught-out-with-illegal-software/", "Area": ["Software License Optimization"], "Comments": [{"Comment": "Pingback: Tweets that mention Don", "Author": "Tweets that mention Don"}, {"Comment": "Pingback: Tweets that mention Dont Get Caught Out With Illegal Software | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Dont Get Caught Out With Illegal Software | 1E Blogs -- Topsy.com"}], "Content": [], "Author": ["Phil Wilcock"], "Date": "2011-02-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/14/pc-power-management-is-just-the-first-step-to-realizing-the-big-picture-of-overall-it-efficiency-and-savingspart-1/", "Area": ["1E News", "1E Products", "ConfigMgr", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "Nomad", "PC Power Management", "SCCM", "Server Power Management", "Shopping", "WakeUp", "Windows 7"], "Comments": [{"Comment": "Pingback: PC Power Management is just the ", "Author": "PC Power Management is just the "}, {"Comment": "Pingback: PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 1 - 1E Blog", "Author": "PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 1 - 1E Blog"}, {"Comment": "Pingback: ITs Biggest Money Wasters from CIO.com | 1E Blogs", "Author": "ITs Biggest Money Wasters from CIO.com | 1E Blogs"}, {"Comment": "Pingback: PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 2: The Data Center | 1E Blogs", "Author": "PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 2: The Data Center | 1E Blogs"}], "Content": ["But, PC Power Management is only a first-step to achieving an overall savings within the company. Putting investments and effort behind PC Power Management is extremely valuable in itself, but only scratches the surface of the big picture. There are other areas of the IT organization where improvements can be easily identified. If you stopped at PC Power Management, your investment in saving the company money would not be complete and you would miss out on thousands, even millions, of dollars of additional savings.", "Achieving full IT Efficiency within an organization is 1Es mantra.", "This is just the first post of many that will help outline areas within the IT organization where excess exists  areas that 1E is actively striving to provide technology and leadership to make these other areas just as easy to understand and implement as PC Power Management. As we continue this blogging series, well talk about different areas of excess, how to identify them, and ultimately how to continue saving money, time, and the environment through eliminating the excess.", "See you here next time."], "Author": ["Rod Trent"], "Date": "2011-02-14 00:00:00"}, {"Tags": ["data center efficiency", "green it", "IT for sustainability", "server power management"], "URL": "http://blogs.1e.com/2011/02/14/whitepaper-how-to-green-your-data-center/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: Whitepaper: How to Green Your Data Center - 1E Blog", "Author": "Whitepaper: How to Green Your Data Center - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Whitepaper: How to Green Your Data Center | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Whitepaper: How to Green Your Data Center | 1E Blogs -- Topsy.com"}], "Content": ["", "There are some useful cheat sheet tables which detail each task, the cost level and benefits so that you can easily prioritize your actions.", "Several useful case studies are included so you can see how others have done things, and right at the end there is even a letter of communication which can be used to put your case across to the execs who need convincing. Cool!", "All in all a useful resource to have if you are thinking of embarking on an IT For Sustainability (ITFS) project in your data centers, although you need to remember that servers can be power managed and monitored to achieve maximum savings rather that simple consolidating and decommissioning.", "Take a look at the paper here."], "Author": ["Phil Wilcock"], "Date": "2011-02-14 00:00:00"}, {"Tags": ["it efficiency", "IT for sustainability", "peak oil"], "URL": "http://blogs.1e.com/2011/02/14/peak-oil-has-it-arrived-early/", "Area": ["IT Efficiency"], "Comments": [{"Comment": "Pingback: Peak Oil: Has it arrived Early? - 1E Blog", "Author": "Peak Oil: Has it arrived Early? - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Peak Oil: Has it arrived Early? | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Peak Oil: Has it arrived Early? | 1E Blogs -- Topsy.com"}, {"Comment": "Nice information. Very informative Ive learned a lot in this article. Thanks for posting it.. This article will help many people like me to understand about peak oil.", "Date": "2011-04-13 08:30:00", "Author": "Stephan"}], "Content": ["With Egypt firmly at the top of the World News agenda last week (and rightly so), another story which could in fact have huge consequences for the Middle East and indeed the whole global economy, was somewhat overshadowed.", "The story originated from Wikileaks, and whatever your thoughts and opinions on such releases, the facts laid bare in this one are cause for concern.", "Oops! Now this basic story is nothing new. Peak Oil as it is known has been hotly debated for some years now, with wildly fluctuating estimates as to when the fateful day will be (or has already been) reached when global oil production starts to decline. Its almost impossible to predict. Early efforts at prediction didnt take into account new advances in oil recovery techniques, but then to counter that, who could have predicted the rise of China, India and other Asian economies and their new demand for oil? But what does Peak Oil mean for us?", "Of course in the IT world we are pretty well exposed to this threat. We rely on plentiful energy at a reasonable price, and many of our basic tools of the trade rely on oil for manufacture (think motherboards and cables for a start!). So what can we do?", "Surely its best to use what we have left to transition to an oil free future rather than argue until its all gone? And it can be done, as I will explain in my next piece later this week. Until then, think about your next car journey  is it really necessary?"], "Author": ["Phil Wilcock"], "Date": "2011-02-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/11/new-paper-remote-management-of-bios-configuration/", "Area": ["1E News", "NightWatchman", "WakeUp"], "Comments": [{"Comment": "Pingback: New paper: Remote Management of BIOS Configuration - 1E Blog", "Author": "New paper: Remote Management of BIOS Configuration - 1E Blog"}, {"Comment": "Pingback: Tweets that mention New paper: Remote Management of BIOS Configuration #1E -- Topsy.com", "Author": "Tweets that mention New paper: Remote Management of BIOS Configuration #1E -- Topsy.com"}], "Content": [""], "Author": ["Rod Trent"], "Date": "2011-02-11 00:00:00"}, {"Tags": ["1e", "nomad"], "URL": "http://blogs.1e.com/2011/02/11/what-is-1e-nomad/", "Area": ["1E News", "Nomad"], "Comments": [{"Comment": "Pingback: Tweets that mention What is 1E Nomad? #1E -- Topsy.com", "Author": "Tweets that mention What is 1E Nomad? #1E -- Topsy.com"}, {"Comment": "Pingback: 1E Nomad versus the Texas Winter | 1E Blogs", "Author": "1E Nomad versus the Texas Winter | 1E Blogs"}], "Content": ["In simplest terms, Nomad is network protection technology, but it is so much more. The patented technology intelligently uses spare network bandwidth to reliably and securely deliver things like operating system upgrades, software deployments and patches to thousands of PCs, servers and sites without disruption. Intelligently means that it utilizes the percentage of network bandwidth that you prescribe and it automatically throttles back and forth depending on the total traffic. So, your network is always stable, always protected, and always available for the business requirements. If a connection goes offline, Nomad even provides auto recovery.", "Nomad also reduces hardware and management costs by completely eliminating the need for dedicated branch distribution servers for System Center Configuration Manager. For that alone, think about the cost savings!", "", "Nomad is amazing technology that saves our customers millions of dollars.", "1E Nomad versus the Texas Winter 1E Blogs"], "Author": ["Rod Trent"], "Date": "2011-02-11 00:00:00"}, {"Tags": ["cloud computing", "data center efficiency", "renewable energy"], "URL": "http://blogs.1e.com/2011/02/11/new-cloud-data-centers-more-energy-please/", "Area": ["Data Center", "IT Efficiency"], "Comments": [{"Comment": "Pingback: New Cloud Data Centers ", "Author": "New Cloud Data Centers "}, {"Comment": "Pingback: New Cloud Data Centers  More Energy Please! - 1E Blog", "Author": "New Cloud Data Centers  More Energy Please! - 1E Blog"}, {"Comment": "Pingback: Tweets that mention New Cloud Data Centers ", "Author": "Tweets that mention New Cloud Data Centers "}, {"Comment": "Pingback: Tweets that mention New Cloud Data Centers  More Energy Please! | 1E Blogs -- Topsy.com", "Author": "Tweets that mention New Cloud Data Centers  More Energy Please! | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: New Cloud Data Centers ", "Author": "New Cloud Data Centers "}, {"Comment": "Pingback: New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Operator News", "Author": "New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Operator News"}, {"Comment": "Pingback: New Cloud Data Centers ", "Author": "New Cloud Data Centers "}, {"Comment": "Pingback: New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Operator News", "Author": "New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Operator News"}, {"Comment": "Pingback: New Cloud Data Centers ", "Author": "New Cloud Data Centers "}, {"Comment": "Pingback: New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Carriers", "Author": "New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Carriers"}, {"Comment": "Pingback: New Cloud Data Centers ", "Author": "New Cloud Data Centers "}, {"Comment": "Pingback: New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Carriers", "Author": "New Cloud Data Centers  More Energy Please! | 1E Blogs | Telecom Carriers"}, {"Comment": "Pingback: Gartners Top 10 IT Challenges and how 1E fits | 1E Blogs", "Author": "Gartners Top 10 IT Challenges and how 1E fits | 1E Blogs"}], "Content": ["Couple of examples this week that data center computing is moving closer to the Cloud (if thats the right term) as we saw some very large projects emerging to service the growing demand for Cloud type services.", "China is building a city-sized cloud computing and office complex that will include a mega data center, one of the projects fueling that countrys double-digit growth in IT spending.", "The entire complex will cover some 6.2 million square feet, with the initial data center space accounting for approximately 646,000 square feet,", "As each new datacenter seems to be bigger and better than the last, are we seeing a move towards super-hub type facilities? The worlds insatiable desire for more access to anything from anywhere, more storage and more computing power on every device sometimes seems never ending. But who picks up the power bill? At the moment we are still heavily reliant on fossil fuels, and these huge facilities need a lot of juice..", "In the case of the Portugal project, data center will be powered using an adjacent wind farm, according to reports, but this is not the norm. If we reach a point where energy is in short supply (and that scenario is closer than you might think), who takes priority? Do these new giants have an Achilles heel? The term single point of failure spring to mind here, and although Im sure that energy usage has been factored into these designs, its a rapidly changing world these days and we cant just keep adding capacity without thinking about where the power comes from.", "Of course we have good examples out there and some far thinking companies are build their centers near to sources of renewable energy such as hydro etc."], "Author": ["Phil Wilcock"], "Date": "2011-02-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/10/1es-mobile-welcome-page/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1E", "Author": "1E"}, {"Comment": "Pingback: 1Es Mobile Welcome Page - 1E Blog", "Author": "1Es Mobile Welcome Page - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E", "Author": "Tweets that mention 1E"}, {"Comment": "Pingback: Tweets that mention 1Es Mobile Welcome Page | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1Es Mobile Welcome Page | 1E Blogs -- Topsy.com"}], "Content": ["Heres something neat. We now have a really slick mobile formatted welcome page for our primary web site. Stick the following URL into your mobile web browser (works great on the iPad and Android tablets) and let us know what you think.", "http://staging.1e.com/welcome/", ""], "Author": ["Rod Trent"], "Date": "2011-02-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/10/1e-reaches-1-billion-in-customer-savings-by-continuing-to-lead-charge-against-excess-in-corporate-it-identifies-key-it-efficiency-trends-for-2011/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 1 | 1E Blogs", "Author": "PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 1 | 1E Blogs"}, {"Comment": "Pingback: Key IT Efficiency Trends for 2011 | 1E Blogs", "Author": "Key IT Efficiency Trends for 2011 | 1E Blogs"}, {"Comment": "Pingback: Announcing the 1E Community! | 1E Blogs", "Author": "Announcing the 1E Community! | 1E Blogs"}], "Content": ["In helping our customers make milestone savings, we are solidifying our strong leadership position in the enterprise IT efficiency market, says Sumir Karayi, CEO of 1E. As we enter a new year, many organisations worldwide are placing a renewed focus on greening their enterprises, but some may feel daunted by the challenge and become paralyzed by inaction. At 1E, we not only work with our customers to develop long-term efficiency strategies, but also help them think in terms of today so that they can take actionable steps to implement power management policies, automate processes and reduce excess in IT across their organisations.", "Based on feedback from its large customer community, 1E expects the below topics to impact 2011."], "Author": ["Rod Trent"], "Date": "2011-02-10 00:00:00"}, {"Tags": ["pc power management", "sustainability"], "URL": "http://blogs.1e.com/2011/02/10/sustainability-yes-please-but-we-need-payback/", "Area": ["Green IT", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Sustainability? Yes Please But We Need Payback - 1E Blog", "Author": "Sustainability? Yes Please But We Need Payback - 1E Blog"}], "Content": ["", "The Survey found that Eighty-eight percent of Fortune 1000 senior executives feel business has a moral responsibility, beyond regulatory requirements, to make their companies more energy efficient. At the same time, the vast majority (61 percent) of respondents say that potential cost savings are their biggest motivator to save energy at the enterprise-level, outranking environmental concerns (13 percent) or government regulations (2 percent).", "Sixty-one percent of respondents cite potential savings as the key driver in making their organizations more sustainable, stating that their companies would be motivated to use less if there was an energy management solution that could save them money. Cost savings was by far the most widely cited factor among the executives, with the remaining respondents reporting the following:", "None of the above is that surprising is it? As is often the case with these reports however, there is some interesting insight if you read on..", "So our great captains of industry Dont know where to start? Huh?", "Maybe we had too many years of lazy economic growth, but to me it seems like this is both a huge challenge and opportunity rolled into one. To be honest Im getting a bit tired of reading about how businesses are tippy toeing around sustainability when they should have jumped in the pool years ago.", "So, once again folks, repeat after me. Sustainability is good business. Energy saving is good business. And pretty soon if your business is not run sustainably then you wont have a business.", "What is evident from this report is that CEOs everywhere need to drive sustainability initiatives across their enterprises. Forget moral obligations and making this planet a more viable place for those who come next, look at the cost benefits. As for where to start? Surely thats a case of finding out where the biggest savings can be made, prioritizing these areas and using the savings from these low hanging fruit projects to finance others?"], "Author": ["Phil Wilcock"], "Date": "2011-02-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/09/icelandic-volcano-to-set-the-tone-for-mms-2011-mms2011-rod-trent-at-myitforum-com/", "Area": ["1E News", "Events", "MMS"], "Comments": [{"Comment": "Pingback: Icelandic volcano to set the tone for MMS 2011? #mms2011 ", "Author": "Icelandic volcano to set the tone for MMS 2011? #mms2011 "}, {"Comment": "Pingback: Icelandic volcano to set the tone for MMS 2011? #mms2011  Rod Trent at myITforum.com - 1E Blog", "Author": "Icelandic volcano to set the tone for MMS 2011? #mms2011  Rod Trent at myITforum.com - 1E Blog"}], "Content": ["", "Read the full post", "Icelandic volcano to set the tone for MMS 2011? #mms2011  Rod Trent at myITforum.com"], "Author": ["Rod Trent"], "Date": "2011-02-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/08/rising-energy-costs-spur-it-leaders-into-action/", "Area": ["1E News", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Rising energy costs spur IT leaders into action - 1E Blog", "Author": "Rising energy costs spur IT leaders into action - 1E Blog"}], "Content": ["Rising energy costs spur IT leaders into action  08 Feb 2011  Computing Feature"], "Author": ["Rod Trent"], "Date": "2011-02-08 00:00:00"}, {"Tags": ["COP16", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2011/02/08/good-cop-bad-cop-or-cop-out-the-lights-are-green-if-you-want-them-to-be/", "Area": ["Green IT", "NightWatchman"], "Comments": [{"Comment": "Pingback: Good COP, Bad Cop or cop out", "Author": "Good COP, Bad Cop or cop out"}, {"Comment": "Pingback: Good COP, Bad Cop or cop out? The lights are GREEN if you want them to be - 1E Blog", "Author": "Good COP, Bad Cop or cop out? The lights are GREEN if you want them to be - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Good COP, Bad Cop or cop out", "Author": "Tweets that mention Good COP, Bad Cop or cop out"}, {"Comment": "Pingback: Tweets that mention Good COP, Bad Cop or cop out? The lights are GREEN if you want them to be | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Good COP, Bad Cop or cop out? The lights are GREEN if you want them to be | 1E Blogs -- Topsy.com"}], "Content": ["", "So, there is progress to be made  and it can be made fast with tangible benefits attached, but there are some roadblocks we need to overcome up ahead.", "- 201,885,139 hours of computing power", "- 7,267,865 kWh of energy", "- 3,125,182 kg of CO2 emissions from entering the atmosphere.", "- $1,090,180 in energy costs"], "Author": ["Phil Wilcock"], "Date": "2011-02-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/07/mms-2010-part-2-or-how-the-volcanic-cloud-just-delayed-us-a-bit-mms2011/", "Area": ["1E News", "Events", "MMS"], "Comments": [{"Comment": "Pingback: MMS 2010 ", "Author": "MMS 2010 "}, {"Comment": "Pingback: MMS 2010  Part 2. Or, how the volcanic cloud just delayed us a bit #mms2011 - 1E Blog", "Author": "MMS 2010  Part 2. Or, how the volcanic cloud just delayed us a bit #mms2011 - 1E Blog"}], "Content": ["Ironically, MMS 2010 was a bit the beginnings of Microsofts push about the cloud.", "", ""], "Author": ["Rod Trent"], "Date": "2011-02-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/07/1e-celebrates-the-heroes-of-systems-management-at-mms2011/", "Area": ["1E News", "Events", "Green IT", "IT Efficiency", "MMS", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: 1E Celebrates the Heroes of Systems Management at #mms2011 - 1E Blog", "Author": "1E Celebrates the Heroes of Systems Management at #mms2011 - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E Celebrates the Heroes of Systems Management at #mms2011 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E Celebrates the Heroes of Systems Management at #mms2011 | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Microsoft Partner of the Year heads to MMS 2011 #mms2011 | 1E Blogs", "Author": "Microsoft Partner of the Year heads to MMS 2011 #mms2011 | 1E Blogs"}], "Content": ["In this interactive session, join 1E as we recognize select individuals involved in the evolution of SMS and ConfigMgr over the past decade. This presentation promises to be both educational and entertaining! The heroes will share hard earned advice and interesting facts about themselves to advance your knowledge and insight. In addition, be the first to witness the launch of the latest addition to the 1E product family.", "http://www.mms-2011.com/topic/details/BK08"], "Author": ["Rod Trent"], "Date": "2011-02-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/07/another-1e-mms-2011-update-booth-gold-sponsorship-lanyards-meet-and-greet-mms2011/", "Area": ["1E News", "Events", "MMS", "NightWatchman", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Tweets that mention Another 1E MMS 2011 Update: Booth, Gold Sponsorship, Lanyards, Meet-and-greet #mms2011 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Another 1E MMS 2011 Update: Booth, Gold Sponsorship, Lanyards, Meet-and-greet #mms2011 | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: A 1E at MMS 2011 Roundup #mms2011 | 1E Blogs", "Author": "A 1E at MMS 2011 Roundup #mms2011 | 1E Blogs"}], "Content": ["Microsoft is once again expecting a HUGE turnout for their top community conference. Since 1E has been a top sponsor of the event for years, we like to keep you updated on some of the key aspects of whats coming from 1E.", "Dont forget to catch our last update, if you havent already:", "Feeding the MMS Train", "Well be providing periodic presentations at the booth, but Ill have to circle back here with the presentation schedule. Stay tuned for that.", "As part of our continuing GOLD sponsorship of the event, we have an interesting Gold speaker session, hosted by our very own Ed Aldrich & Geoff Collins. This will be hugely popular with MMS old timers, but also very informative to newcomers. Just read the description", "BK08 1E Celebrates the Heroes of Systems Management", "In this interactive session, join 1E as we recognize select individuals involved in the evolution of SMS and ConfigMgr over the past decade. This presentation promises to be both educational and entertaining! The heroes will share hard earned advice and interesting facts about themselves to advance your knowledge and insight. In addition, be the first to witness the launch of the latest addition to the 1E product family.", "", "And, lastly, for this update, 1E is once again the sponsor of the event Lanyards. Now, we just have to figure out which one to provide! Heres some examples of Lanyards weve provided in the past. Do you have any of these already?"], "Author": ["Rod Trent"], "Date": "2011-02-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/07/verizon-us-case-study-nightwatchman-wakeup/", "Area": ["1E News", "NightWatchman"], "Comments": [{"Comment": "Pingback: Verizon US: Case Study ", "Author": "Verizon US: Case Study "}, {"Comment": "Pingback: Verizon US: Case Study  NightWatchman & WakeUp - 1E Blog", "Author": "Verizon US: Case Study  NightWatchman & WakeUp - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Verizon US: Case Study ", "Author": "Tweets that mention Verizon US: Case Study "}, {"Comment": "Pingback: Tweets that mention Verizon US: Case Study  NightWatchman & WakeUp | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Verizon US: Case Study  NightWatchman & WakeUp | 1E Blogs -- Topsy.com"}], "Content": ["Verizon Wireless Commits to a Greener Future and Saves $1.3 million per Year. With a commitment to driving down its energy costs, Verizon Wireless deployed a range of technologies, including Power & Patch Management from 1E, across 63,000 managed machines within an infrastructure of 88,000 PCs for its USA call centers. The result is better power management, savings of $1.3 million per year and no compromise on performance. The Project: Verizon Wireless deployed the Power & Patch Management across 63,000 managed machines within its 88,000 PC infrastructure. The result is better power management, savings of US$1.3 million per year and no", "Read more"], "Author": ["Rod Trent"], "Date": "2011-02-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/07/boost-your-energy-budget-with-no-capital-outlay/", "Area": ["1E News", "NightWatchman"], "Comments": [{"Comment": "Pingback: Tweets that mention Boost your energy budget with no capital outlay | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Boost your energy budget with no capital outlay | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Boost your energy budget with no capital outlay - 1E Blog", "Author": "Boost your energy budget with no capital outlay - 1E Blog"}, {"Comment": "get cheap online-louisvuittonbags to your friends", "Date": "2011-07-03 09:49:00", "Author": "Fearakristina"}], "Content": ["As you may be aware, back in June 2009 Joan Ruddock MP, the then Minister for Energy and Climate Change, launched Salixs Energy Efficiency Loans Scheme which made 51.5m available in interest free loans to fund energy saving projects across the English public sector.", "If your organization is looking to maximize its operational savings and increase IT efficiency contact us now  well be happy to discuss how we could help you achieve your goals."], "Author": ["Rod Trent"], "Date": "2011-02-07 00:00:00"}, {"Tags": ["e-waste"], "URL": "http://blogs.1e.com/2011/02/07/we-need-to-stop-wasting-our-waste/", "Area": ["Green IT"], "Comments": [{"Comment": "Pingback: We Need to Stop Wasting our Waste.. - 1E Blog", "Author": "We Need to Stop Wasting our Waste.. - 1E Blog"}, {"Comment": "Pingback: Tweets that mention We Need to Stop Wasting our Waste.. | 1E Blogs -- Topsy.com", "Author": "Tweets that mention We Need to Stop Wasting our Waste.. | 1E Blogs -- Topsy.com"}], "Content": ["I always love the simple ideas, you know the one where you think why hasnt this been done already?. Well how about a laptop that can be dismantled easily by the user and the various components recycled as appropriate.", "A team of students from Stanford and Aalto University in Finland have designed a prototype for a laptop that can be disassembled easily so the electronic components can go into an envelope for mailing to an e-cycling program and the rest can go into the household recycling bin. As if that wasnt cool enough, all of this can be done without any tools in a couple of minutes. I think Id be so tempted to be fiddling with the thing all day Id never get any work done! You could do it blindfold too  just like the tough guys do with their machine guns in the movies", "Although Im taking a light hearted view on this, the potential here is amazing. E-waste is one of the areas of IT that seems to be constantly overlooked as we strive for more on the productivity side of things. No one seems to care about what happens to all our IT junk once it is no longer of use. The End of life process as it is cheerily named, simply fails because of a huge gap between us as consumers and IT using businesses, and the recycling companies. Sure there are now schemes for taking back old PCs and servers, but it just isnt easy enough. Consequently this e-waste either piles up in the garage (come on, own up now) or gets shipped to landfill.", "I hope that this means that we are moving in the right direction on this important issue. As Karl-Heinz Florenz (EPP, DE), who steered the draft legislation through the EU Parliament, commented  we can no longer afford to waste our waste."], "Author": ["Phil Wilcock"], "Date": "2011-02-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/04/pc-power-management-software-revenue-to-reach-783m-by-2015/", "Area": ["1E News", "PC Power Management"], "Comments": [{"Comment": "Pingback: PC power management software revenue to reach 3m by 2015 - 1E Blog", "Author": "PC power management software revenue to reach 3m by 2015 - 1E Blog"}, {"Comment": "Pingback: Tweets that mention PC power management software revenue to reach 3m by 2015 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention PC power management software revenue to reach 3m by 2015 | 1E Blogs -- Topsy.com"}, {"Comment": "thats 783m, not 3m. The 78 is significant  ", "Date": "2011-02-04 08:44:00", "Author": "February 4, 2011 at 8:44 pm"}, {"Comment": "Pingback: PC power management software revenue to reach 783m by 2015 - 1E Blog", "Author": "PC power management software revenue to reach 783m by 2015 - 1E Blog"}], "Content": ["The PC and server power management software market is set to expand nearly fivefold from $168m in 2010 to $783m annually by 2015, according to a new report from Pike Research.", "The cleantech market intelligence firm forecasts that PC power management software alone could be saving almost 47 MTCO2e of emissions by 2015, equivalent to taking nearly eight million cars off the road.", "Read the rest:", "PC power management software revenue to reach 3m by 2015 | Energy"], "Author": ["Rod Trent"], "Date": "2011-02-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/04/congratulations-to-1e-partner-microsoft-for-strong-leadership-in-gartners-2010-magic-quadrant-for-pcclm-report/", "Area": ["1E News", "ConfigMgr", "PC Power Management"], "Comments": [{"Comment": "Pingback: Hypnosis, NLP And Communication: The Key To Strong Leadership  New NLP Technology", "Author": "Hypnosis, NLP And Communication: The Key To Strong Leadership  New NLP Technology"}], "Content": ["In the blog post, Microsoft says", "Congratulations, Microsoft and the ConfigMgr team!", "", "1E and Microsoft together offer one of the most comprehensive power management solutions.", "Brad Anderson, CVP, Microsoft Corp.", ""], "Author": ["Rod Trent"], "Date": "2011-02-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/04/the-microsoft-management-summitthe-superbowl-of-conferences/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: The Microsoft Management Summit", "Author": "The Microsoft Management Summit"}, {"Comment": "Pingback: The Microsoft Management Summitthe Super Bowl of Conferences - 1E Blog", "Author": "The Microsoft Management Summitthe Super Bowl of Conferences - 1E Blog"}, {"Comment": "Pingback: Tweets that mention The Microsoft Management Summit", "Author": "Tweets that mention The Microsoft Management Summit"}, {"Comment": "Pingback: Tweets that mention The Microsoft Management Summitthe Superbowl of Conferences | 1E Blogs -- Topsy.com", "Author": "Tweets that mention The Microsoft Management Summitthe Superbowl of Conferences | 1E Blogs -- Topsy.com"}], "Content": ["Heres a couple of todays tidbits that may interest you."], "Author": ["Rod Trent"], "Date": "2011-02-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/04/pc-and-server-power-management-software-revenue-to-reach-783-million-by-2015-pike-research/", "Area": ["1E News", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: PC and Server Power Management Software Revenue to Reach $783 Million by 2015  Pike Research - 1E Blog", "Author": "PC and Server Power Management Software Revenue to Reach $783 Million by 2015  Pike Research - 1E Blog"}], "Content": ["Power management tools offer a fast return on investment for companies looking to save costs and reduce emissions, says senior analyst Eric Woods. Often, this software may even come free of charge, thanks to utility company rebates. This is a particular boon for corporate IT departments, since servers use 60% of their maximum power while doing nothing at all.", "PC and Server Power Management Software Revenue to Reach $783 Million by 2015  Pike Research"], "Author": ["Rod Trent"], "Date": "2011-02-04 00:00:00"}, {"Tags": ["cap and trade"], "URL": "http://blogs.1e.com/2011/02/04/some-us-states-act-locally-on-carbon-emissions/", "Area": ["The Green Room"], "Comments": [{"Comment": "Pingback: Some US States act Locally on Carbon Emissions - 1E Blog", "Author": "Some US States act Locally on Carbon Emissions - 1E Blog"}, {"Comment": "New York City has already developed a climate adaptation plan and it has begun to implement it. NY state is within the process of developing a plan. With predictions that extreme weather events this type of droughts, floods and heat waves will become a lot more common and severe, and that sea level rise will accelerate inside the coming decades, planning now can help prevent expense and suffering in the future. If no effective action is taken globally to cut back skin tightening and emissions the amount of carbon dioxide in the atmosphere continues to climb at an increasing rate throughout this century and climate adaptation may eventually become impossible.", "Date": "2011-02-08 06:51:00", "Author": "Lower carbon for Movers"}], "Content": ["With the UK Carbon Reduction Commitment (CRC) currently in a state of flux, and US congress fighting over whether or not to block the US Environmental Protection Agency from regulating carbon emissions, whats happening at a more local level. Is the real answer to tackle our emissions at the state level or do we have to wait for government to lead us by the hand?", "Ten north-eastern and mid-Atlantic states capped and began reducing carbon dioxide emissions in January 2009. That Regional Greenhouse Gas Initiative is working to reduce CO2 emissions from the power sector 10 per cent by 2018. In California they claim to have on of the most comprehensive schemes which kicks off in 2012.", "Another group of six states and one Canadian province have been working since 2007 in the Midwestern Greenhouse Gas Reduction Accord to form their own system. And then there is the Western Climate Initiative of seven states, including California, and four Canadian provinces.", "So as you can see there is much resistance to thee types of schemes even at the local level. In fact the states that not yet moving to cap-and-trade are those most dependent upon fossil fuels and major carbon emitters  the southeast and the lower Midwest. That includes states like Texas, which not only are not moving on cap-and-trade but are among those actively fighting to prevent the EPA from regulating greenhouse gas emissions within their borders.", "As governments across the world prevaricate over which scheme to implement (if at all), and the economic downturn provides fuel to those who argue that carbon reduction legislation may damage fragile recovery, we seem to be at a point where nothing much is happening. Hopefully though we will see more action at the state level and in some cases even city or town. Just because the world is waiting doesnt mean that you have to. We really dont have too much time to waste.."], "Author": ["Phil Wilcock"], "Date": "2011-02-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/03/the-state-of-innovation-and-how-we-can-wrestle-the-crown-back-from-china/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: The state of global innovation and how we can wrestle the crown back from China - 1E Blog", "Author": "The state of global innovation and how we can wrestle the crown back from China - 1E Blog"}, {"Comment": "Pingback: Tweets that mention The state of global innovation and how we can wrestle the crown back from China | 1E Blogs -- Topsy.com", "Author": "Tweets that mention The state of global innovation and how we can wrestle the crown back from China | 1E Blogs -- Topsy.com"}], "Content": ["Have you ever heard of a fake iPhone? During a recent trip of mine to China a friend purchased a fake Chinese iPhone at the Pearl Market in Beijing. It worked for about 2 weeks. Despite that, there was very little (except for the poorly worded English instructions) about the phone different from the US version.", "How is this happening? How is China innovating so quickly?", "So, how do we change that? How do we put ourselves back into the global race to compete against a powerhouse like China?", "Some folks believe that the cloud is the answer, and that may be part of the solution, but the cloud is just a small part of the big picture. What the cloud is attempting to do is to provide ways to save the business money. If businesses can squeeze out every bit of savings possible in the organization, that savings can be redirected toward running the business. However  again  the cloud is just a small part of the overall savings that can be achieved. Dont forget that. Dont get caught up in marketing hype that leads you to believe its the ultimate cost saver.", "OK, so clearly, businesses need to innovate and compete, and the cloud is only a possible part of the solution. What else is there?", "There are so many pieces to running an efficient business, with excess happening everywhere. One of the key aspects of the business where the most excess is found, unfortunately, is within the IT (technology) group. This is why the cloud seems so palatable to so many organizations right now and why its making serious inroads into boardroom discussions and decision making sessions.", "China is not the only smart and industrious society. That has been clearly evident over 100s of years. However, trends suggest that the global society is caught in another swing of the pendulum. Unless we do things now, it may be another 100 years before innovation and competition can be balanced.", "As your company is, indeed, planning solutions around cost savings, make sure you add 1E in the mix. An investment in 1E is an investment in global innovation, competitiveness, and leadership. Its an investment in the future for all of us."], "Author": ["Rod Trent"], "Date": "2011-02-03 00:00:00"}, {"Tags": ["DCcE", "it efficiency", "ScE", "the green grid"], "URL": "http://blogs.1e.com/2011/02/03/1e-at-the-green-grid-technical-forum-2011/", "Area": ["Data Center", "IT Efficiency"], "Comments": [{"Comment": "Pingback: 1E at The Green Grid Technical Forum 2011 - 1E Blog", "Author": "1E at The Green Grid Technical Forum 2011 - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E at The Green Grid Technical Forum 2011 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E at The Green Grid Technical Forum 2011 | 1E Blogs -- Topsy.com"}], "Content": ["If you are in the process of choosing which events to attend this year, and are at all interested in Data Center or IT efficiency then this ones for you."], "Author": ["Phil Wilcock"], "Date": "2011-02-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/02/google-rolls-out-its-web-based-android-app-store/", "Area": ["1E News", "Shopping"], "Comments": [{"Comment": "Pingback: Google rolls out its web-based Android App store - 1E Blog", "Author": "Google rolls out its web-based Android App store - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Google rolls out its web-based Android App store | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Google rolls out its web-based Android App store | 1E Blogs -- Topsy.com"}, {"Comment": "This is leading information. Thanks fitting for sharing.", "Date": "2011-02-05 01:01:00", "Author": "qwetrader"}], "Content": ["You can find it here:", "http://market.android.com/", "So, heres where this gets kind of interesting. Why a post about the Android App store on the 1E blog?", "If youve monitored tech industry news over the last year or so, youll have seen how applications have become critical to mobile devices. Youll have seen a public movement toward app store acceptance. Device makers today know that its all about the apps. As long as you provide a solid mobile operating system, its the applications that actually make or break the mobile experience and the bring loyalty to a product. To some people that may seem like a new concept, but it really isnt. In the business world its been just the same. Its the apps that make or break the experience and business relies on apps. Stalwart applications like Microsoft Office are depended upon constantly. Without apps, business doesnt run.", "But", "from a business perspective, application delivery has always been a tedious, time consuming, costly endeavor. A high percentage of end-point management involves software distribution. Entire processes have been developed to ensure uniform, mostly trouble-free delivery of applications. Application packaging and distribution has even become an IT industry and professional expertise designation all its own. And, yet, after all of this, its still inefficient, costly, and the end-user has to wait a considerable amount of time for software request fulfillment.", "The mobile app stores have it right. Users search for a solution, find the most appropriate app, and one-click later, the app is delivered and installed. Why cant it be this easy for business?", "It can.", "OKnow realize that this saves a whole stack of money for the business and frees up time for IT staff to focus on improving the company infrastructure and completing those projects that have been lingering unfinished for months or years. Heres a few papers that you should think about looking through to understand how much time and money your company will save:", ""], "Author": ["Rod Trent"], "Date": "2011-02-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/02/02/1e-amp-revolutionary-technology-to-control-software-and-software-licensing-join-the-february-15th-webinar-to-hear-more-about-it/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1E AMP: Revolutionary technology to control software and software licensing. Join the February 15th Webinar to hear more about it - 1E Blog", "Author": "1E AMP: Revolutionary technology to control software and software licensing. Join the February 15th Webinar to hear more about it - 1E Blog"}], "Content": ["Getting ready to revolutionize IT once again.", "Do you have an effective system in place to help manage your software assets?", "", "Application Management Platform allows you to:", ""], "Author": ["Rod Trent"], "Date": "2011-02-02 00:00:00"}, {"Tags": ["energy efficient it", "nomad", "shopping", "software deployment", "wakeup"], "URL": "http://blogs.1e.com/2011/02/02/efficient-software-deployment-reduces-energy-waste-too/", "Area": ["Green IT", "IT Efficiency", "Nomad", "OS Deployment", "PC Power Management", "Shopping"], "Comments": [{"Comment": "Pingback: Efficient Software Deployment Reduces Energy Waste too - 1E Blog", "Author": "Efficient Software Deployment Reduces Energy Waste too - 1E Blog"}], "Content": [], "Author": ["Phil Wilcock"], "Date": "2011-02-02 00:00:00"}, {"Tags": ["carbon reporting", "crc", "crc energy efficiency scheme"], "URL": "http://blogs.1e.com/2011/02/01/what-now-for-the-uk-carbon-reduction-commitment-scheme/", "Area": ["The Green Room"], "Comments": [{"Comment": "Pingback: What now for the UK Carbon Reduction Commitment Scheme? - 1E Blog", "Author": "What now for the UK Carbon Reduction Commitment Scheme? - 1E Blog"}, {"Comment": "Pingback: Tweets that mention What now for the UK Carbon Reduction Commitment Scheme? | 1E Blogs -- Topsy.com", "Author": "Tweets that mention What now for the UK Carbon Reduction Commitment Scheme? | 1E Blogs -- Topsy.com"}], "Content": ["", "One of my tasks for this week has been to attempt to unravel just what is happening regarding the UK Carbon Reduction Commitment (CRC) scheme. Now this scheme was tricky enough to get to grips with from the offset, but now the picture seems to be getting darker and darker", "After much reading and analysis however, I can report that actually no-one really knows what on earth is going on with this. Is it a stealth tax? Efficient Carbon management? or will it just fade away like a nasty scar?", "Well heres where we are right now. The first signs of change came back in October 2010 when the government decided to change the fundamentals. Under the original terms of CRC , It was stated that funds raised from the purchase of CO2 allowances would be plowed back into the scheme. This idea was meant to reward those companies that cut their energy usage the most. This was known as revenue recycling.", "Now that the government has decided that it need the cash however, it expects to raise 1 billion a year from the scheme by 2014-15  money which will be used to support the public finances rather than recycled to participants. Hence the stealth tax jibes.", "Next up, the Energy Minister Chris Huhne announced that the government will delay the implementation of the scheme, so that the first sale of permits to cover energy use will not take place next year, but in 2012. Eligible companies will not have to register for the second phase of the scheme, due to start in April 2011, until 2013. Perhaps he thinks that well have forgotten about it by then?"], "Author": ["Phil Wilcock"], "Date": "2011-02-01 00:00:00"}, {"Tags": ["green it", "it efficiency", "IT for sustainability"], "URL": "http://blogs.1e.com/2011/01/31/report-highlights-it-for-sustainability/", "Area": ["Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Report Highlights IT For Sustainability - 1E Blog", "Author": "Report Highlights IT For Sustainability - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Report Highlights IT For Sustainability | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Report Highlights IT For Sustainability | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: World Spinner", "Author": "World Spinner"}], "Content": ["As Green IT in particular and Business Sustainability in general moves firmly into the mainstream, so reporting is becoming a must-have at all levels of participation. As companies implement Green IT projects and other business wide energy and carbon reduction strategies its becoming clear that reporting and planning will play a huge role in pulling it all together.", "Heres what they have to say about Green IT for instance.", "Its a thought provoking report, and at only six pages, well worth a read on your next coffee break."], "Author": ["Phil Wilcock"], "Date": "2011-01-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/31/how-important-is-pc-power-management-to-ford-check-out-their-wikipedia-page/", "Area": ["1E News", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: How important is PC Power Management to Ford? Check out their Wikipedia page - 1E Blog", "Author": "How important is PC Power Management to Ford? Check out their Wikipedia page - 1E Blog"}, {"Comment": "Pingback: Tweets that mention How important is PC Power Management to Ford? Check out their Wikipedia page | 1E Blogs -- Topsy.com", "Author": "Tweets that mention How important is PC Power Management to Ford? Check out their Wikipedia page | 1E Blogs -- Topsy.com"}], "Content": ["An anecdote from a meeting last week really stuck with me: Using 1E products is like printing money for your business. When you think about it, that really does make a lot of sense. The quick ROI of investing in 1Es solutions means that your company starts saving money in a hurry.", "If you want to start printing money for your organization, check out the full breadth of 1E solutions, because PC Power Management is only just the beginning for a total cost savings for your business. Everything 1E produces is developed with costs savings in mind.", "http://staging.1e.com/softwareproducts/index.aspx"], "Author": ["Rod Trent"], "Date": "2011-01-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/28/organization-wide-energy-consumptionthe-bigger-picture/", "Area": ["1E News", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Organization-wide Energy Consumption", "Author": "Organization-wide Energy Consumption"}, {"Comment": "Pingback: Organization-wide Energy ConsumptionThe Bigger Picture - 1E Blog", "Author": "Organization-wide Energy ConsumptionThe Bigger Picture - 1E Blog"}], "Content": ["Sustainability IT trends | Effective IT Survey 2010"], "Author": ["Rod Trent"], "Date": "2011-01-28 00:00:00"}, {"Tags": ["data center efficiency", "sustainable it", "the green grid"], "URL": "http://blogs.1e.com/2011/01/28/the-green-grid-has-a-new-boss-and-a-new-focus/", "Area": ["Data Center", "Green IT", "IT Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: The Green Grid has a New Boss and a New Focus - 1E Blog", "Author": "The Green Grid has a New Boss and a New Focus - 1E Blog"}], "Content": ["", "The Green Grid is a global consortium of IT companies and professionals seeking to improve energy efficiency in data centers and business computing ecosystems around the globe. The organization seeks to unite global industry efforts to standardize on a common set of metrics, processes, methods and new technologies to further its common goals.", "You may know them for their ground breaking work on the Power Usage Effectiveness (PUE) metric for data centers, and in the last year or so there have been new metrics emerging for Carbon Usage and even a proposed Water Usage metric.", "So along with news of a new head honcho came a press release which hinted at the shape of things to come for the not for profit organization."], "Author": ["Phil Wilcock"], "Date": "2011-01-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/26/ford-expects-to-save-more-than-1-million-with-pc-power-management/", "Area": ["1E News", "ConfigMgr", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Ford Expects to Save More Than $1 Million with PC Power Management - 1E Blog", "Author": "Ford Expects to Save More Than $1 Million with PC Power Management - 1E Blog"}], "Content": ["", "We love to hear about how well our products work. More importantly, we love to hear that our products are doing their intended job of saving our customers time, money and resources. And yet, theres even an additional component that is key to our products successes: the ability to define key partnerships that allow us to give our customers a complete solution", "", "Ford Expects to Save More Than $1 Million with PC Power Management  Nexus SC: The System Center Team Blog  Site Home  TechNet Blogs"], "Author": ["Rod Trent"], "Date": "2011-01-26 00:00:00"}, {"Tags": ["clean energy", "smart grid"], "URL": "http://blogs.1e.com/2011/01/25/china-leads-the-way-on-clean-energy/", "Area": ["The Green Room"], "Comments": [{"Comment": "Pingback: China Leads the Way on Clean Energy - 1E Blog", "Author": "China Leads the Way on Clean Energy - 1E Blog"}, {"Comment": "Pingback: Tweets that mention China Leads the Way on Clean Energy | 1E Blogs -- Topsy.com", "Author": "Tweets that mention China Leads the Way on Clean Energy | 1E Blogs -- Topsy.com"}], "Content": ["I have to hold my hands up and say that I I wouldnt have believed it possible to write that title a year ago. Back then most of the publicity around Chinas energy story was based around the seemingly insatiable demand for more and more power and the number of new coal fired power stations that were springing up like daisies.", "Most of Chinas clean energy comes from Hydro power stations, providing 213.4 GW (up from 196 GW in 2009). Wind power also increased significantly, almost doubling and reaching 31.07 GW. Nuclear power increased slightly from 9 GW to 10.82 GW.", "Interestingly, due to its clean energy increases and its interest in reducing its carbon emissions, China shut down a number of fossil-fuel power plants. In total, output from such plants was cut about 11 GW. This trend is mirrored in Europe where France will shut down about half its coal-fired power stations by 2015, Germanys RWE AG, the single largest carbon emitter in Europe, said it wont build new coal-fired power plants, and here in the UK it has been agreed that we will build no new coal plants without carbon-capture technology.", "Current archaic systems here in the UK lose a phenomenal amount of generated energy in the system. In the UK for instance, 65 per cent of the input energy used to generate electricity in the UK is lost somewhere along the way, whether as waste heat, transmission losses or other inefficiencies. In 2009, for example, 921 terawatt-hours of energy flowed into Britains electricity grid, but only 322 terawatt-hours flowed out in the form of productive power for industry, transport, consumer uses and other purposes.", "Thats a scary amount of waste, and one that surely must be tackled head on in the coming years, but for now we could learn a lot from China, who seems to be setting the pace in energy efficiency and clean energy generation."], "Author": ["Phil Wilcock"], "Date": "2011-01-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/24/1e-joins-microsoft-partner-solutions-center-to-strengthen-virtualisation-and-cloud-offerings/", "Area": ["1E News", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: 1E Joins Microsoft Partner Solutions Center to Strengthen Virtualisation and Cloud Offerings - 1E Blog", "Author": "1E Joins Microsoft Partner Solutions Center to Strengthen Virtualisation and Cloud Offerings - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E Joins Microsoft Partner Solutions Center to Strengthen Virtualisation and Cloud Offerings #1E -- Topsy.com", "Author": "Tweets that mention 1E Joins Microsoft Partner Solutions Center to Strengthen Virtualisation and Cloud Offerings #1E -- Topsy.com"}, {"Comment": "Pingback: World Spinner", "Author": "World Spinner"}], "Content": ["We help organizations reduce inefficiencies within the IT function, said Sumir Karayi, CEO of 1E. While virtualisation and cloud computing have the potential to help reduce costs for organisations while improving services levels, they are not silver bullets. We already offer solutions to help manage virtualised resources and plan to continue delivering the most advanced efficiency tools in the market as demand increases. We also plan to provide a new set of tools for smaller companies worldwide through a software-as-a-service model."], "Author": ["Rod Trent"], "Date": "2011-01-24 00:00:00"}, {"Tags": ["Windows XP Danger Zone", "Windows XP Migration"], "URL": "http://blogs.1e.com/2011/01/24/windows-7-deployment-the-1e-way-part-5-image-is-everything-or-is-it/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration"], "Comments": [{"Comment": "Pingback: Windows 7 Deployment the 1E way  Part 2: Tools for the job | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way  Part 2: Tools for the job | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Windows 7 Deployment the 1E way  Part 3: The Perfect Match | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way  Part 3: The Perfect Match | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Windows 7 Deployment the 1E way - Part 1: Introduction | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way - Part 1: Introduction | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Post-Windows 7 deployment, what your users see when they first sit down in front of their new operating system is going to depend on two things: Firstly, whats in your operating system image file and secondly how the task sequence used to deploy that image is configured. Deciding what needs to go into the image and what can be taken care of in the task sequence is somewhat of a personal choice but there are certain factors that can help determine the most appropriate way forward.", "In this article, part 5 of the Windows 7 deployment series, we will take a look at the choices facing us around image composition as well as the number of images you may require. We will also examine when and how to go about maintaining your image and look at the tools and methods available.", "Whats in the Image?", "Prior to capturing your reference image, you have to decide what if any core applications, drivers or security updates must be installed.", "Applications", "Most organizations undertaking ZTI deployments will include some core applications in the image as well as relying on the task sequence to install additional applications as dictated by the role of the target system. Including core applications in the image makes sense in terms of reducing the time taken to complete the deployment as well as not having to maintain installation package files at all deployment locations.", "Device Drivers", "Device drivers are injected during image deployment and are not normally retained within the image. Driver packages must therefore also be made available at deployment locations.", "Security Updates", "In deciding when and how security updates are applied during the build process you have a number of choices. You may decide (quite rightly) that all critical security updates must be included in the reference image such that the system is protected from vulnerabilities as early as possible. There are 2 ways of accomplishing this. Firstly you can integrate updates into the installation media before carrying out the reference build. Alternatively, you can install the updates during the reference build process. The former method is the most secure but the most time consuming to accomplish. The latter is easier to accomplish but less secure.", "The alternative to the above is to leave the updates out of the reference image entirely and install them during deployment using Windows Server Update Services (WSUS) or ConfigMgr. This is easy to achieve but does extend the time taken to complete the deployment together with leaving the system vulnerable until the updates are installed and the system restarted.", "Going Thin", "Image files are generally large, being upwards of 2-3 GB in size. At remote locations where available bandwidth considerations may be paramount, the deployment of PXE Lite and Nomad clients would facilitate the use of a thin image with no core applications installed. With applications already cached at the branch, only your image file would need to be pre-cached onto the local PXE Lite server ahead of the deployment.", "Customization", "So what about configuring the image in terms of things such as Firewall, internet explorer or regional settings etc  does the reference image need to be touched? Not at all. The deployment (rather than the image) can be customized in many ways using native task sequence steps provided in MDT and ConfigMgr or by directly configuring the installation answer file used by Windows 7. This is easily achieved since the file is located within a separate deployment package and injected when the image is installed on the target system.", "Boot Images", "In most cases the only thing to think about with individual boot images is ensuring that they contain the correct (storage and network) device drivers. Additional drivers can be loaded through the ConfigMgr console if required.", "How Many Images do I need?", "In the past many large organizations maintained several images due to different hardware platforms and languages used. Differences in the HAL driver required (Hardware Abstraction Layer  basically the interface between your CPU and operating system) or requirements that the system be built to support a particular language, meant separate images were required. That has all changed. Unlike Windows XP, Windows 7 (and Vista) images can detect (all modern) HAL types when applied to a target system and load the appropriate driver required. Windows 7 is also language neutral. This means that languages are features of the operating system that can be simply added or removed as required. This can be accomplished either through native task sequence steps or by editing the installation answer file.", "So, is their still a need for more than one image? Well yes and no! Having covered all hardware and language requirements, a customer of ours still required 2 images. The reason for this was that they used the same operating system in their office and factory environments where the roles of the PCs were completely different. The majority of PCs were office based and required MS Office and several other applications to be installed. It was therefore decided to incorporate these into the image. Factory systems had no such requirement and it was therefore decided to create 2 images. However, to keep things simple and efficient, both images were contained within a single WIM. As mentioned earlier, one benefit of the WIM file format is single instance storage. Incorporating the 2 images into a single WIM meant the image file size was no bigger than the larger of the 2 images. During deployment, the task sequence sorted out which image to install from the WIM.", "Boot Images", "If deploying systems throughout your ConfigMgr hierarchy, then you will normally need to create a boot image at every site and keep these up to date. For a large customer of ours this was an issue as it often led to the deployment and boot image versions getting out of sync. So, with the assistance of the ConfigMgr product team, we went ahead and developed a method of using only a single boot image throughout the entire hierarchy and we now include this within our PXE Lite offering.", "Maintaining the image", "As for new drivers, language packs or non critical updates, then updated deployment packages and deployment task sequence can takes care of these.", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Simon Burbidge"], "Date": "2011-01-24 00:00:00"}, {"Tags": ["energy efficient it", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2011/01/24/new-memory-device-could-increase-server-energy-efficiency/", "Area": ["Green IT", "IT Efficiency", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: Tweets that mention New Memory Device Could Increase Server Energy Efficiency | 1E Blogs -- Topsy.com", "Author": "Tweets that mention New Memory Device Could Increase Server Energy Efficiency | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: New Memory Device Could Increase Server Energy Efficiency - 1E Blog", "Author": "New Memory Device Could Increase Server Energy Efficiency - 1E Blog"}], "Content": ["", "Every now and then you read about something new that genuinely excites you  whether it actually makes it to production or not is another matter!", "As we know, there are two types of computer memory. Slow memory is used in persistent data storage technologies such as flash drives. They allow you to save data for extended periods of time, the nonvolatile devices. Faster memory allows computers to operate quickly, but arent able to save data when the computers are turned off. This is your volatile memory, and this is how things have been for decades..", "All of that could be set to change however, as a research team from NC State has developed a single unified device that can perform both volatile and nonvolatile memory operation and may be used in the main memory.", "Real world applications for this technology are quite major.", "Firstly, it could allow computers to start immediately, because the computer wouldnt have to retrieve start-up data from its hard drive  pretty much the Holy Grail of computing for hardware vendors!", "So in theory, we could see servers being used far more dynamically and efficiently, and the associated energy savings could be enormous. Watch out for a future version of NightWatchman Server Edition that support FET, but not for a while perhaps!"], "Author": ["Phil Wilcock"], "Date": "2011-01-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/21/feeding-the-mms-2011-train/", "Area": ["1E News", "Events", "MMS"], "Comments": [{"Comment": "Pingback: Feeding the MMS 2011 Train - 1E Blog", "Author": "Feeding the MMS 2011 Train - 1E Blog"}, {"Comment": "Pingback: Another 1E MMS 2011 Update: Booth, Gold Sponsorship, Lanyards, Meet-and-greet #mms2011 | 1E Blogs", "Author": "Another 1E MMS 2011 Update: Booth, Gold Sponsorship, Lanyards, Meet-and-greet #mms2011 | 1E Blogs"}], "Content": ["Heythats what 1E does anyway, isnt it? Even our products and solutions promote this concept, as they are geared toward bringing complete efficiency to your IT organization. So, it makes a lot of sense that we can take the same concept and apply it to MMS 2011.", "Ill leave you with a few burning questions for MMS 2011. Jot these down somewhere as Im sure youll want to reflect later once you have the answers."], "Author": ["Rod Trent"], "Date": "2011-01-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/21/energy-security-a-journey-of-1000-miles-smart-grid/", "Area": ["1E News", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Energy security a journey of 1000 miles | Smart Grid - 1E Blog", "Author": "Energy security a journey of 1000 miles | Smart Grid - 1E Blog"}], "Content": ["The deeper you delve into the proposed vision of a smart, clean-energy grid  much less a supergrid  the more daunting the task appears. Looking into the future is like working your way through a set of matryoshka dolls, never quite sure where it will all end.", "Still, as the Chinese proverb says, a journey of a thousand miles begins with a single step. And there are some good steps forward being taken in the smart-grid space these days.", "Energy security a journey of 1000 miles | Smart Grid"], "Author": ["Rod Trent"], "Date": "2011-01-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/21/business-ants-will-win-in-long-run-smart-grid/", "Area": ["1E News", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["", "The satisfaction comes from their knowing that money spent the right ways today can yield far greater savings over the long run. Its true in dealing with the global costs of climate change, as Lord Stern pointed out to the world, and its also true for implementing smarter energy strategies and technologies to reduce consumption and costs.", "Business ants will win in long run | Smart Grid"], "Author": ["Rod Trent"], "Date": "2011-01-21 00:00:00"}, {"Tags": ["1e", "clean energy", "climate change", "tidal energy"], "URL": "http://blogs.1e.com/2011/01/21/1e-friday-roundup/", "Area": ["Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: 1E Friday Roundup - 1E Blog", "Author": "1E Friday Roundup - 1E Blog"}], "Content": ["", "", "Clean Energy", "Lots of tales around clean energy, with a fair amount of money changing hands and new projects in the pipeline. This must be a good thing as it adds momentum to the whole clean energy story and encourages more and more companies to get involved. Hopefully it will help to bring prices to a more acceptable level too which in turn will boost uptake.", "", "Climate Change", "Strangely quiet this week (and month so far). Is Climate Change last years news? I hope not as sadly this one isnt going to go away..", "The Telegraph reports that the UK is to go into a war footing in the fight against climate change with err.. some posters. Great stuff.", "http://www.telegraph.co.uk/earth/earthnews/8271739/Wartime-posters-to-fight-climate-change.html", "As the evidence stacks up and gathers momentum, will we change our ways in 2011? Hope so.", "", "Data Center Efficiency", ""], "Author": ["Phil Wilcock"], "Date": "2011-01-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/20/wasting-energy-is-a-bad-habit-companies-falling-behind/", "Area": ["1E News", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Wasting Energy is a ", "Author": "Wasting Energy is a "}, {"Comment": "Pingback: Wasting Energy is a bad habit, companies falling behind - 1E Blog", "Author": "Wasting Energy is a bad habit, companies falling behind - 1E Blog"}], "Content": ["According to todays Greenbang article, it appears that another company has produced a similar survey, and their results indicate that things have not changed much since the original 1E survey.", "From the article", "a large number of employees are frustrated by their companies lack of initiative on reducing costs, waste and consumption. In that study, 48 per cent of those polled said they hadnt participated in any company effort to boost sustainability in the previous year. And a full 44 per cent said they would consider leaving their jobs if they believed their employers werent operating sustainably  a pretty astounding figure, considering the current hiring landscape.", "Read the full article:"], "Author": ["Rod Trent"], "Date": "2011-01-20 00:00:00"}, {"Tags": ["common criteria evaluation", "nightwatchman", "pc power management", "security"], "URL": "http://blogs.1e.com/2011/01/20/how-secure-is-your-power-management-solution/", "Area": ["NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: How Secure Is Your Power Management Solution? - 1E Blog", "Author": "How Secure Is Your Power Management Solution? - 1E Blog"}, {"Comment": "Pingback: Tweets that mention How Secure Is Your Power Management Solution? | 1E Blogs -- Topsy.com", "Author": "Tweets that mention How Secure Is Your Power Management Solution? | 1E Blogs -- Topsy.com"}], "Content": ["", "Security is a topic thats rarely covered in Power Management discussions, but in reality it should be top of the list as more and more services become cloud based and users have access to data from so many diverse sources..", "While the proliferation of desktop power management software is a good thing for the planet and IT efficiency in general, companies who deploy the technology often forget the fact that they have just unleashed some pretty powerful software on their user population. Heres a tool that often runs in the background, can shutdown, reboot and otherwise interfere with thousands of computers.", "This certification assures our customers that our software has gone through a rigorous analysis and testing process and conforms to standards sanctioned by the International Standards Organization. Common Criteria is an important worldwide security evaluation standard, which is recognized in 26 countries around the world. It provides a clear and reliable evaluation of the security capabilities of IT products."], "Author": ["Phil Wilcock"], "Date": "2011-01-20 00:00:00"}, {"Tags": ["green it", "pc power management", "sustainability"], "URL": "http://blogs.1e.com/2011/01/19/the-death-of-green-it-may-not-be-a-bad-thing/", "Area": ["Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Tweets that mention The Death of Green IT? May Not be a Bad Thing | 1E Blogs -- Topsy.com", "Author": "Tweets that mention The Death of Green IT? May Not be a Bad Thing | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: The Death of Green IT? May Not be a Bad Thing - 1E Blog", "Author": "The Death of Green IT? May Not be a Bad Thing - 1E Blog"}], "Content": ["", "Green IT was pronounced dead this week, and Im glad. To be honest I think the death was long overdue, as I really do dislike labels like that. In fact I would go so far as to say that I object to the word Green being applied to anything anymore! Green housing, cars, transport, buildings, food, clothes etc etc, stop it now! For us, Green IT was what we used to call best practice..", "In the report, Verdantix analyzed IT service delivery capabilities for building energy efficiency, renewable energy, intelligent transport, electric vehicles, carbon and energy management software, climate change risk modeling and utility smart grid. It seems that Green IT has been eclipsed by the larger concept of Sustainable Technology Services. You see, they just couldnt resist another label, so in the coming months be prepared to execute a find and replace in all your documented Green IT references!", "Seriously though, I do welcome this change as it signifies a shift by companies towards a more joined up approach to sustainability across the board. People are finally realizing that sustainability simply must be built into the business across all sectors in order to remain competitive."], "Author": ["Phil Wilcock"], "Date": "2011-01-19 00:00:00"}, {"Tags": ["lbl", "pc power management"], "URL": "http://blogs.1e.com/2011/01/18/celebrating-the-work-of-lawrence-berkley-national-laboratory/", "Area": ["Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Celebrating the work of Lawrence Berkley National Laboratory - 1E Blog", "Author": "Celebrating the work of Lawrence Berkley National Laboratory - 1E Blog"}, {"Comment": "Pingback: Das Gesetz der Anziehung und das Geheimnis | ClickBank Product Reviews Online", "Author": "Das Gesetz der Anziehung und das Geheimnis | ClickBank Product Reviews Online"}], "Content": ["", "Nowadays there are online energy savings calculators, whitepapers galore, and vendors are keen to publish their energy consumption data to the world. Back in 1999 it was different. For a start, the internet was still like a wobbly toddler taking its first steps compared to today. I seem to remember that the main search engine back then was Alta Vista (and very fine it was too until the Google boys turned up), and even that was turning up blank if you happened to search for pc power management.", "The hardware then was clunky too. Do you remember the spec of your desktop 10 years ago? If you had more than 256mb RAM in there you were Master of the Universe. In fact I remember one of the most common cautions that people had about turning of their computers at night was the fear that they may not come on again  hard disk failure being a particular worry.", "It all started during the 1973 energy crisis, when scientists from Lawrence Berkeley National Laboratory, a U.S. Department of Energy laboratory managed by the University of California, began to explore ways to improve energy efficiency in buildings and industry.", "Forward thinking? Just a little..", ""], "Author": ["Phil Wilcock"], "Date": "2011-01-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/18/the-1e-content-hub/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: The 1E Content Hub - 1E Blog", "Author": "The 1E Content Hub - 1E Blog"}, {"Comment": "Pingback: Tweets that mention The 1E Content Hub | 1E Blogs -- Topsy.com", "Author": "Tweets that mention The 1E Content Hub | 1E Blogs -- Topsy.com"}], "Content": ["The 1E Content Hub is a slick repository of all of our case studies, whitepapers, research, products sheets, videos and podcasts, and product demos. This gives you a single location for locating something you saw once and wanted to share with a colleague, quickly identifying specific information about one of our products or solutions, or even just to sit and browse to learn more about 1E and the products.", "Check it out!"], "Author": ["Rod Trent"], "Date": "2011-01-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/17/photo-recap-1e-visit-to-nashville-tn-and-austin-tx/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Photo Recap: 1E Visit to Nashville, TN and Austin, TX - 1E Blog", "Author": "Photo Recap: 1E Visit to Nashville, TN and Austin, TX - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Photo Recap: 1E Visit to Nashville, TN and Austin, TX | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Photo Recap: 1E Visit to Nashville, TN and Austin, TX | 1E Blogs -- Topsy.com"}], "Content": ["", "It really was a whirlwind tour, visiting the TnSMUG Thursday evening and then the CTSMUG on Friday morning. I had very little time to kick-back after my arrival in Nashville on Thursday, due to having to find a package of SWAG sent to me at the hotel from Ed Aldrich the day before. The hotel could NOT find it, and after a couple hours, they finally realized they had entered the package into the system under the name Ed Albright instead of Aldrich. One simple mistake like thatugghhh. But, at least the view my from room was good (shown in the photo).", "The unfortunate thing is that a political rally was setting up in the square, just right of the tower shown in the photo. Stay tuned, this will become important shortly.", "Due to my already failing lack of sleep, I completely blanked on taking photos of the Nashville meeting! Arrggghhh! So, Ill have to post some from the next trip.", "After the meeting, we drove back to the hotel. Mike headed out to meet up with a friend in the area, and I headed off to the room to grab some much needed sleep. I had to get up around 3:45am the next morning to get ready and head out for a 6am flight to Austin. My thoughts were good, but the execution was terrible, primarily due to the political rally overflow (mentioned earlier) into the hotel bar after the event  and the fact that the hotels architecture and extremely thin walls made the room probably one of the noisiest Ive ever stayed in (even worse than the San Diego MMSs and the trains!).", "So, despite a comfortable bed (shown above), and nice room, sleep totally evaded me. The hotel was really noisy and, between the issue with locating the SWAG box and the noise, Im not sure Ill stay here again.", "Somewhere along the way, after the alarm went off at 3:45am, I got my second-wind so things were rolling and I made the airport and my flights in plenty of time.", "Once on the plane, I was able to look out the window at the exact moment my luggage was being loaded. I considered that a good omen.", "When we arrived, Greg Ramsey was finishing up a presentation on ConfigMgr 2012 features (shown above) and we were just in time for LUNCH!", "Texas BBQ was on tap for lunch! Sponsored by 1E, the meat, BBQ sauce, and picnic salads really hit the spot (shown in the picture above).", "After lunch, Ed stepped on stage to give away all of the SWAG we brought with us (shown as Swagapalooza in the photo above).", "I believe we have another User Group meeting scheduled for February sometime (more on that soon) in Calgary, Canada, but were always open and willing to help fill some time at your next meeting and talk about 1Es products and solutions. 1E can also help with your SWAG and meeting refreshment needs. Drop us a note if youre interested in hooking your car to the 1E user group train.", "Ill leave you with the following photo. This was my first real chance to play with a Microsoft Surface computer. Pretty neat!"], "Author": ["Rod Trent"], "Date": "2011-01-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/17/ealing-tweetup-february-15th-2011-sponsored-by-1e/", "Area": ["1E Community", "1E News", "Events"], "Comments": [{"Comment": "Pingback: Ealing Tweetup, February 15th 2011 ", "Author": "Ealing Tweetup, February 15th 2011 "}, {"Comment": "Pingback: Ealing Tweetup, February 15th 2011  Sponsored by 1E - 1E Blog", "Author": "Ealing Tweetup, February 15th 2011  Sponsored by 1E - 1E Blog"}], "Content": ["Mark your diary! The next Ealing tweetup is on Feb 15th If you live in or around west London and you have not been to an Ealing tweetup then you have certainly missed out. Just take a look at what blogger Neville Hobson said about the last one here.", "", "Read the full post and grab directions."], "Author": ["Rod Trent"], "Date": "2011-01-17 00:00:00"}, {"Tags": ["data center efficiency calculator", "pue"], "URL": "http://blogs.1e.com/2011/01/14/calculate-your-pue-goals-and-savings/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: Calculate your PUE Goals and Savings - 1E Blog", "Author": "Calculate your PUE Goals and Savings - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Calculate your PUE Goals and Savings | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Calculate your PUE Goals and Savings | 1E Blogs -- Topsy.com"}], "Content": ["", "", "", "The resulting calculations tell you just how much money and CO2 you will save in the short and long term if you achieve your selected PUE goal (below).", "If you are new to the world of Data Center Efficiency and energy saving, this is a great introduction. It doesnt go into too much detail and there are some handy notes on the same page which will assist in the learning curve too. Theres even a video if you cant be bothered to read  perfect for a Friday afternoon!"], "Author": ["Phil Wilcock"], "Date": "2011-01-14 00:00:00"}, {"Tags": ["BCS", "CEEDA", "datacenter efficiency"], "URL": "http://blogs.1e.com/2011/01/13/new-accreditation-for-datacenters-launches/", "Area": ["Data Center", "Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: New Accreditation for Datacenters Launches - 1E Blog", "Author": "New Accreditation for Datacenters Launches - 1E Blog"}, {"Comment": "Pingback: Harmonizing the PUE Metric | 1E Blogs", "Author": "Harmonizing the PUE Metric | 1E Blogs"}], "Content": ["", "The main selling point for this scheme seems to be that its designed to provide verifiable evidence that an organisation is not only claiming it follows (or plans to implement) best practice but that it has actually implemented them. The evidence provided is checked by an independent CEEDA certified assessor.", "Successful organisations can display their Award and use the Award logo within their corporate marketing material. They are also eligible to be listed in the online Register of Energy Efficient Data Centres, so good for hosting providers.", "Areas of audit to achieve the award are data center utilization, IT equipment and services, cooling, data center power equipment, data center building and monitoring.", "Each certification ranking requires an increasing level of criteria, with a Gold rating requiring a PUE of less than 1.5 for the 12 months leading up to certification.", "At first glance, I groaned at the thought of yet another scheme of this type. We currently have KcKinseys Corporate Average Datacenter Efficiency (CADE), Gartners Power to Performance Effectiveness (PPE) and of course PUE from the Green Grid, but at least this scheme is based on the audits of a third party provider."], "Author": ["Phil Wilcock"], "Date": "2011-01-13 00:00:00"}, {"Tags": ["greenpeace", "towards green electronics"], "URL": "http://blogs.1e.com/2011/01/11/is-it-getting-easier-to-be-green/", "Area": ["Green IT", "IT Efficiency", "NightWatchman"], "Comments": [{"Comment": "Pingback: Is it Getting Easier to be Green? - 1E Blog", "Author": "Is it Getting Easier to be Green? - 1E Blog"}], "Content": ["", ""], "Author": ["Phil Wilcock"], "Date": "2011-01-11 00:00:00"}, {"Tags": ["carbon reporting", "nightwatchman server edition"], "URL": "http://blogs.1e.com/2011/01/11/how-green-is-your-website/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: How Green is your Website? - 1E Blog", "Author": "How Green is your Website? - 1E Blog"}, {"Comment": "Pingback: Tweets that mention How Green is your Website? | 1E Blogs -- Topsy.com", "Author": "Tweets that mention How Green is your Website? | 1E Blogs -- Topsy.com"}], "Content": ["", "Its called Greenalytics (not sure on the name guys..) and matches web stats with environmental data to show the emissions generated by the infrastructure behind a website. Its effectively compiling information from various sources to calculate a result in real time. It uses statistics from Google Analytics to measure how many visitors a site has and environmental data on electricity consumption from servers, routers and from users, from research carried out by KTH."], "Author": ["Phil Wilcock"], "Date": "2011-01-11 00:00:00"}, {"Tags": ["1e events"], "URL": "http://blogs.1e.com/2011/01/11/out-and-about-with-1e-events/", "Area": ["1E News"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2011-01-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/10/one-more-way-to-connect-with-1ethe-android-market/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: One more way to connect with 1E", "Author": "One more way to connect with 1E"}, {"Comment": "Pingback: One more way to connect with 1Ethe Android Market - 1E Blog", "Author": "One more way to connect with 1Ethe Android Market - 1E Blog"}], "Content": ["Today, we just released a new beta app to the Android Market called 1E Connect. 1E Connect is an application that can be configured to automatically update you on 1E news, new initiatives, products, and general activity. Stay connected with the leader in IT Efficiency!", "To get it, on your Android phone, search the Android Market for 1E Connect. Download, install and enjoy!", "Well be making updates periodically, but the Android market will notify you when updates are available. If you have any suggestions for new features, feel free to send us a note."], "Author": ["Rod Trent"], "Date": "2011-01-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/10/businessgreen-corporations-turn-on-to-pc-turn-off/", "Area": ["1E News", "Green IT"], "Comments": [{"Comment": "Pingback: Tweets that mention businessGreen: Corporations turn on to PC turn off | 1E Blogs -- Topsy.com", "Author": "Tweets that mention businessGreen: Corporations turn on to PC turn off | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: businessGreen: Corporations turn on to PC turn off - 1E Blog", "Author": "businessGreen: Corporations turn on to PC turn off - 1E Blog"}], "Content": ["Read the full article"], "Author": ["Rod Trent"], "Date": "2011-01-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/07/wow-is-it-2011-already/", "Area": ["IT Efficiency"], "Comments": [{"Comment": "Pingback: Wow, is it 2011 already? - 1E Blog", "Author": "Wow, is it 2011 already? - 1E Blog"}], "Content": ["", "My last post on here was around six weeks ago, and it feels like that time has passed in the blink of an eye. We had the coldest December on record here in the UK (for a change) so my attentions were drawn away from the world of energy saving, software deployment and data centres. Instead it was a case of trying to look after a lot of chilly pigs, freezing water pipes and snow covered cows, while curing bacon and making (what seemed like) never ending festive sausages for the hungry locals..", "Anyway, as I finally fixed my last burst water trough yesterday, and my first sow of the year provided me with eight healthy piglets, it feels like Spring is just around the corner. Or perhaps not. But whatever the weather, its a New Year, so lets hope its an extra special one.", "As we enter a new decade, it would be easy enough to take somewhat of a downbeat view of things with oil and energy prices on the rise, food prices their highest ever and some economies looking as wobbly as a new-born Bambi. Here at 1E however, I think that we view such times as nothing but a huge opportunity. Every business in the world can do more in 2011 to save energy, carbon, time and costs, and were here to help you along the way. Expect exciting product developments, great parties, fun and much much sunshine wherever you are in the world. Just another average 1E year really!", "Personally Im looking forward to blogging about some exciting technologies within systems management, energy efficiency and a host of other topics as yet undiscovered. So heres to a successful 2011, and hopefully a lovely long, warm Summer..", "Oh, and if I throw in a picture of cute pigs I always seem to get some nice comments so here are the new arrivals.."], "Author": ["Phil Wilcock"], "Date": "2011-01-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/04/why-it-does-not-have-to-wait-on-the-smart-grid-to-start-saving-energy-costs-today-nick-milne-home-1e-inc/", "Area": ["1E News", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today  Nick Milne-Home, 1E Inc. - 1E Blog", "Author": "Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today  Nick Milne-Home, 1E Inc. - 1E Blog"}, {"Comment": "Pingback: Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today ", "Author": "Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today "}, {"Comment": "Pingback: Tweets that mention Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today  Nick Milne-Home, 1E Inc. | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today  Nick Milne-Home, 1E Inc. | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Tweets that mention Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today ", "Author": "Tweets that mention Why IT Does Not Have to Wait on the Smart Grid to Start Saving Energy Costs Today "}], "Content": ["President Obama recently explained the importance of our countrys transformation to a Smart Grid by saying, It will make our grid more secure and more reliable, saving us some of the $150 billion we lose each year during power outages. It will allow us to more effectively transport renewable energy generated in remote places to large population centers, so that a wind farm in rural South Dakota can power homes in Chicago. And by facilitating the creation of a clean energy economy, building this 21st-century energy infrastructure will help us lay a foundation for lasting growth and prosperity.", "Information technology is not just an enabler of the Smart Grid vision  it is at its very core, helping to revolutionize production, transmission and consumption of electricity in homes and businesses across the nation.", "One of the key challenges of the Smart Grid is that it is not 100 percent defined and operational today. A considerable amount of time and significant financial investment are still required to create and reap the benefits of a truly functional Smart Grid. Many people are also paralyzed with inaction, dreaming about the panacea promised by the Smart Grid in the future and so doing nothing about efficiency today. This inaction creates a real risk that the promise of the Smart Grid may never be fully realized.", "The good news is that we dont need to wait. We have the power to take pragmatic steps toward the larger grid concept today.", "", "Read the rest at the Daily Energy Report"], "Author": ["Rod Trent"], "Date": "2011-01-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/04/2011-means-1e-is-revving-up-the-user-group-visitsupcoming-events/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Tweets that mention 2011 Means 1E is Revving Up the User Group VisitsUpcoming Events | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 2011 Means 1E is Revving Up the User Group VisitsUpcoming Events | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Tweets that mention 2011 Means 1E is Revving Up the User Group Visits", "Author": "Tweets that mention 2011 Means 1E is Revving Up the User Group Visits"}, {"Comment": "Pingback: 2011 Means 1E is Revving Up the User Group VisitsUpcoming Events - 1E Blog", "Author": "2011 Means 1E is Revving Up the User Group VisitsUpcoming Events - 1E Blog"}, {"Comment": "Pingback: 2011 Means 1E is Revving Up the User Group Visits", "Author": "2011 Means 1E is Revving Up the User Group Visits"}, {"Comment": "Lose Weight", "Date": "2011-08-01 01:34:00", "Author": "hanskwn7"}], "Content": ["Though a huge aspect of community, online communities only represent a portion of what makes community important and special. Offline communities, or User Groups, are the other side and in a lot of cases even more important. For that reason, 1E is gearing up to spend a bunch of time this year making visits to User Groups.", "Heres a couple upcoming events (next week!):", "", "Click the image to view the invitation.", "", "", "If youd like 1E to visit your User Group for a presentation, feel free to drop us a note."], "Author": ["Rod Trent"], "Date": "2011-01-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/01/04/staying-in-touch-with-1e-in-2011/", "Area": ["1E Community", "1E News", "ConfigMgr", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "SCCM", "Server Power Management", "WakeUp", "Windows 7"], "Comments": [{"Comment": "Pingback: Tweets that mention Staying in Touch with 1E in 2011 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Staying in Touch with 1E in 2011 | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Staying in Touch with 1E in 2011 - 1E Blog", "Author": "Staying in Touch with 1E in 2011 - 1E Blog"}], "Content": ["First off, welcome to 2011! We hope you all had as great holiday season as we did. The holidays are a great time to spend connecting with friends and family, and we hope you had every chance possible to do that.", "2011 has begun and its time to start digging back into things. 2011 promises to be a busy year for 1E. We have a number of things planned for the year but as time progresses, were sure other, unplanned things will crop up, too. As a customer or potential customer its important for you to keep apprised of our progress, our events, product releases, updates, etc., etc. We understand that. To help, we have set up a number of media streams so that you can keep up-to-date with 1E happenings. Grab your favorite from the list below and get ready for a whirlwind year."], "Author": ["Rod Trent"], "Date": "2011-01-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/22/vote-for-1e-in-the-techcrunch-crunchies/", "Area": ["1E News", "1E Products", "Events", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management", "Shopping"], "Comments": [{"Comment": "Pingback: Vote for 1E in the TechCrunch Crunchies - 1E Blog", "Author": "Vote for 1E in the TechCrunch Crunchies - 1E Blog"}, {"Comment": "Pingback: Vote for 1E in the TechCrunch ", "Author": "Vote for 1E in the TechCrunch "}, {"Comment": "Pingback: Tweets that mention Vote for 1E in the TechCrunch Crunchies | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Vote for 1E in the TechCrunch Crunchies | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Tweets that mention Vote for 1E in the TechCrunch ", "Author": "Tweets that mention Vote for 1E in the TechCrunch "}, {"Comment": "I would like to thank You for this article and please allow me to have the chance to show my satisfaction with HostGator web hosting. They offer professional and fast support and they also offering many HostGator discount coupons.", "Date": "2011-02-11 06:39:00", "Author": "Caren Woodka"}, {"Comment": "I am generally not the guy to write comments on people", "Date": "2011-04-12 05:57:00", "Author": "Dwight Girardin"}], "Content": ["It only takes a second to vote just type in the name of the company/person and press Nominate. The top categories for 1E and the recommended nomination text are as follows:", "Everyone is invited to submit one nomination per category per day and top nominees (companies/individuals who receive the most votes) in each category will be notified and become 2010 Crunchies Finalists.", "http://crunchies2010.techcrunch.com/nominate/", "Thank you in advance for helping us get 1E on the finalist list."], "Author": ["Rod Trent"], "Date": "2010-12-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/21/seasons-greetings-from-1e/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Seasons Greetings from 1E - 1E Blog", "Author": "Seasons Greetings from 1E - 1E Blog"}, {"Comment": "Pingback: Season", "Author": "Season"}, {"Comment": "Pingback: Tweets that mention Seasons Greetings from 1E | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Seasons Greetings from 1E | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Tweets that mention Season", "Author": "Tweets that mention Season"}], "Content": ["", "As the holiday season approaches, I would like to take this opportunity to thank you for your continued support over the past year and to wish you all the best in 2011 and beyond. 1E is very proud of the significant energy and carbon savings our customers and partners have realized and I look forward to continuing this work with you next year.", "Finally, for many years, 1E has been an active supporter of charities around the globe. Feel free to visit our community site below for further information.", "Thank you, once again, for your continued support.", "Best wishes.", "1E Blogger and Social Media Puppeteer", "Follow Us", "1Es work in the Community", "Click here to see more", "Copyright  1E 2010 All Rights Reserved."], "Author": ["Rod Trent"], "Date": "2010-12-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/19/nyt-profile-on-1e-ceo-sumir-karayi/", "Area": ["1E News", "Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: NYT: Profile on 1E CEO, Sumir Karayi - 1E Blog", "Author": "NYT: Profile on 1E CEO, Sumir Karayi - 1E Blog"}, {"Comment": "Hi quality cheap prices and discounted uk replica watches,A variety of replica watches now are on sale and we offer free shipping. uk replica watches!replica watches for watches are must haves and buy it now from our web site:www.coolwatchmall.com!.", "Date": "2011-05-07 07:08:00", "Author": "merry"}], "Content": ["If youve ever wondered about our CEO: what drives him toward providing efficiency in IT and what shaped his desire for technology, the New York Times has a great piece today"], "Author": ["Rod Trent"], "Date": "2010-12-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/14/zdnet-power-play-for-the-city-of-melbourne/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "PC Power Management"], "Comments": [{"Comment": "Pingback: ZDNet: Power play for the City of Melbourne - 1E Blog", "Author": "ZDNet: Power play for the City of Melbourne - 1E Blog"}, {"Comment": "Pingback: Tweets that mention ZDNet: Power play for the City of Melbourne | 1E Blogs -- Topsy.com", "Author": "Tweets that mention ZDNet: Power play for the City of Melbourne | 1E Blogs -- Topsy.com"}], "Content": ["The City of Melbourne in Victoria, Australia, has saved roughly 1.46 million kilowatt hours of electricity in the first year of project to deploy the 1E power management software across 1,000 of the citys personal computers.", "Read the full article"], "Author": ["Rod Trent"], "Date": "2010-12-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/14/happy-holidays-from-1e/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Happy Holidays from 1E! - 1E Blog", "Author": "Happy Holidays from 1E! - 1E Blog"}], "Content": ["What a wonderful time of the year! With our recent office refurbishment completed, this photo is a great example of what youll see when you visit.  Festive!  Have a great holiday season everyone!"], "Author": ["Rod Trent"], "Date": "2010-12-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/14/city-of-melbourne-deploys-nightwatchman-from-1e-on-1000-desktops-cumulatively-saving-175000-aud-reducing-energy-use-by-1459000-kwh-and-preventing-1648670-00-kg-of-c02-from-entering-the-a/", "Area": ["1E News", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": "", "Content": ["Ashe Potter, Technical Architect at the City of Melbourne and the green IT champion responsible for the management of all client-side IT hardware (desktops, laptops, mobile devices), architectural design for IT projects at the City Council, lead the implementation of NightWatchman from 1E. He says:", "We tested a number of solutions before selecting 1E [] No other vendor had a mature enough solution, with proven ability to give us the savings we were looking for. 1E was the established player in this space and integrated seamlessly with the core products in our IT environment.", "The City of Melbourne itself made history earlier this year by electing the Green party  a win over the Labour party  for the first time in 106 years.", ""], "Author": ["Rod Trent"], "Date": "2010-12-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/13/1e-to-host-webinar-on-it-efficiency-featuring-independent-research-firm-and-dell/", "Area": ["1E News", "Data Center", "Events", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: 1E to Host Webinar on IT Efficiency featuring Independent Research Firm and Dell - 1E Blog", "Author": "1E to Host Webinar on IT Efficiency featuring Independent Research Firm and Dell - 1E Blog"}], "Content": ["For a preview on the benefits of PC power management topic, watch this video conversation between Doug Washburn, analyst at Forrester and Sumir Karayi, CEO of 1E.", "Presenters will explore Forresters most recent efficiency research, discuss the current state of PC power management and provide a step-by-step look at how forward-thinking companies are overcoming existing barriers to make PC power management part of their IT efficiency efforts, delivering a significant impact on their bottom line. In addition, Dell, which is currently saving $2.4M per year by reducing PC energy consumption, will share the primary challenges, lessons learned and best practices it uncovered when deploying an enterprise-wide PC power management solution. Together, they will provide a best-practice roadmap of next steps that any organization can take to put PC power management into action  from how to implement smarter energy management policies to how to avoid negatively impacting user productivity.", "Who: Jim Malone, senior editorial director of CIO Magazines custom publishing group, will guide the conversation of industry leaders in the IT efficiency and PC power management space, including:", "A software and services company that improves IT efficiency by identifying and reducing costs and waste in hardware, software, energy and time, 1E has helped its customers save more than $530M in energy costs alone, cutting CO2 emissions by 4.3 million U.S. tons.", ""], "Author": ["Rod Trent"], "Date": "2010-12-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/13/1es-2010-blog-year-in-review/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1Es 2010 Blog Year in Review - 1E Blog", "Author": "1Es 2010 Blog Year in Review - 1E Blog"}, {"Comment": "Pingback: 1E", "Author": "1E"}, {"Comment": "Pingback: Tweets that mention 1Es 2010 Blog Year in Review | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1Es 2010 Blog Year in Review | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Tweets that mention 1E", "Author": "Tweets that mention 1E"}], "Content": ["As we get closer to the end of 2010, its been great to sift through the past year in blog posts. Its actually pretty amazing how closely our blog posts mirror 1E news and success for 2010. From major product releases, to awards, to improved partnerships, to awesome events, 2010 has been a milestone year for 1E.", "Heres an abbreviated list of some highlights from the past year that we want to share with you to help ring out 2010 and ring in 2011.", ""], "Author": ["Rod Trent"], "Date": "2010-12-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/09/verizon-wireless-commits-to-a-greener-future-and-saves-1-3-million-per-year-utilizing-1e-products/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Verizon Wireless Commits to a Greener Future and Saves $1.3 million per Year Utilizing 1E Products - 1E Blog", "Author": "Verizon Wireless Commits to a Greener Future and Saves $1.3 million per Year Utilizing 1E Products - 1E Blog"}], "Content": [""], "Author": ["Rod Trent"], "Date": "2010-12-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/09/come-see-1e-at-the-carbon-divestment-event-in-piccadilly-on-december-14-2010/", "Area": ["1E News", "Events", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Tweets that mention Come See 1E at the Carbon Divestment event in Piccadilly on December 14, 2010! | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Come See 1E at the Carbon Divestment event in Piccadilly on December 14, 2010! | 1E Blogs -- Topsy.com"}], "Content": ["", "The Carbon Divestment web site", "", "This IT sustainability event addresses virtualisation, the Cloud and saving companies operational revenues (and thus avoiding incumbent Carbon tax). Its all about getting rid of green-washing and building sustainable IT infrastructure for retail, finance and organisations. The event also includes an interactive focus group and Q&A session at the end.", "09:30  Registration and refreshments", "10:00  Keynote  Major Retailer on sustainability", "10:30  1E  Practical advice for low-carbon infrastructure", "11:00  IO Consulting  How IT is carbon history", "11:30  MAN Group  Trade, trade, trade", "12:00  Focus group and Q&A", "12:30  Lunch and close", ""], "Author": ["Rod Trent"], "Date": "2010-12-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/08/1e-wins-award-for-best-it-technology/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: 1E Wins Award for Best IT Technology - 1E Blog", "Author": "1E Wins Award for Best IT Technology - 1E Blog"}, {"Comment": "Pingback: 1E Wins Award for ", "Author": "1E Wins Award for "}, {"Comment": "Pingback: Tweets that mention 1E Wins Award for Best IT Technology | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E Wins Award for Best IT Technology | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Tweets that mention 1E Wins Award for ", "Author": "Tweets that mention 1E Wins Award for "}], "Content": ["We are extremely excited about this award and humbled to be listed among the number of other winners in the various categories. Successes like this really help emphasize our mission, which is to provide for total efficiency in IT."], "Author": ["Rod Trent"], "Date": "2010-12-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/08/whitepaper-a-roadmap-for-the-adoption-of-power-related-features-in-servers/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman Server", "Server Power Management"], "Comments": "", "Content": ["Download"], "Author": ["Rod Trent"], "Date": "2010-12-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/07/ietsolutions-software-license-management-could-cut-8-6-billion-in-annual-it-costs/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "Shopping"], "Comments": [{"Comment": "Pingback: iETSolutions: Software license management could cut $8.6 billion in annual IT costs - 1E Blog", "Author": "iETSolutions: Software license management could cut $8.6 billion in annual IT costs - 1E Blog"}], "Content": ["A recent study found software license management is a major contributor to unnecessary costs within enterprise IT departments.", "The Help Desk Efficiency report, conducted by software services firm 1E, found nearly 75 percent of 1,000 responding businesses in the UK and United States said they have unused software on their PCs. The report compared this data to separate research, which found 22 percent of all IT spending on software. This amounts to a total of $726 billion in global IT costs devoted strictly to software licenses.", "", "Read the report:"], "Author": ["Rod Trent"], "Date": "2010-12-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/07/1e-named-as-winner-of-best-it-technology-at-the-2010-greenbang-awards/", "Area": ["1E News", "1E Products", "NightWatchman", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: 1E named as winner of Best IT technology at the 2010 Greenbang Awards - 1E Blog", "Author": "1E named as winner of Best IT technology at the 2010 Greenbang Awards - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E named as winner of Best IT technology at the 2010 Greenbang Awards | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E named as winner of Best IT technology at the 2010 Greenbang Awards | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: 1E Wins Award for Best IT Technology | 1E Blogs", "Author": "1E Wins Award for Best IT Technology | 1E Blogs"}, {"Comment": "Wonderful beat ! I wish to apprentice while you amend your web site, how could i subscribe for a blog site? The account helped me a acceptable deal. I were tiny bit acquainted of this your broadcast offered vivid clear idea", "Date": "2011-10-22 03:23:00", "Author": "Technology Blog"}, {"Comment": "Everyone loves what you guys tend to be up too. This kind of clever work and coverage! Keep up the amazing works guys Ive added you guys to my own blogroll.", "Date": "2012-01-31 06:22:00", "Author": "seo"}], "Content": ["Launched to recognise the most forward-thinking, innovative businesses that are working to create a sustainable business future, the 2010 Greenbang Awards celebrate the top innovations and sustainability projects from businesses working to create a low-carbon future, and cover everything from smart-grid technology to low-energy building design.", "At a time when low-carbon, sustainable initiatives find themselves increasingly under pressure, its important to encourage and showcase some of the most forward-thinking businesses currently operating in the space today, said Dan Ilett, Research Director of Greenbang Research.", "It was precisely because of this, that this year we decided to reward the very best initiatives that combine smart thinking, hard work, beautiful design and clever technology, in what has been a tough economic environment. As an advisory research business that works with some of the biggest brands in the world  key influencers in technology, sustainability, energy and climate change  we believe that by identifying and showcasing some of the very best initiatives, we can encourage innovation and set an important benchmark for the future.", ""], "Author": ["Rod Trent"], "Date": "2010-12-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/06/1e-wakeup-tracks-and-improves-computer-health-across-the-entire-company/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1E WakeUp Tracks and Improves Computer Health Across the Entire Company - 1E Blog", "Author": "1E WakeUp Tracks and Improves Computer Health Across the Entire Company - 1E Blog"}, {"Comment": "Pingback: Tweets that mention 1E WakeUp Tracks and Improves Computer Health Across the Entire Company | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E WakeUp Tracks and Improves Computer Health Across the Entire Company | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Tweets that mention 1E WakeUp Tracks and Improves Computer Health Across the Entire Company | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E WakeUp Tracks and Improves Computer Health Across the Entire Company | 1E Blogs -- Topsy.com"}], "Content": ["Ask yourself these questions."], "Author": ["Rod Trent"], "Date": "2010-12-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/03/media-advisory-1e-to-present-with-alliance-to-save-energy-at-cop-16-on-21st-century-electric-grids/", "Area": ["1E News", "Events", "Green IT", "IT Efficiency", "PC Power Management", "WakeUp"], "Comments": [{"Comment": "Pingback: Media Advisory: 1E to Present with Alliance to Save Energy at COP 16 on 21st Century Electric Grids - 1E Blog", "Author": "Media Advisory: 1E to Present with Alliance to Save Energy at COP 16 on 21st Century Electric Grids - 1E Blog"}, {"Comment": "Pingback: Tweets that mention Media Advisory: 1E to Present with Alliance to Save Energy at COP 16 on 21st Century Electric Grids | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Media Advisory: 1E to Present with Alliance to Save Energy at COP 16 on 21st Century Electric Grids | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: World Spinner", "Author": "World Spinner"}], "Content": ["New York, NY  December 3, 2010", "A seasoned expert in green technology, Milne-Home will provide insight on information and communications technologies that are enabling the creation of modern smart grids. A software and services company that improves IT efficiency by identifying and reducing costs and waste in hardware, software, energy and time, 1E has helped its customers save more than $530M in energy costs alone, cutting CO2 emissions by 4.3 million U.S. tons.", "What: Attendees will learn about advancements, trends and challenges in the ongoing global effort to build more efficient electric grids. Panelists will discuss how information technology plays an integral role in reaching this goal by impacting power consumption and reducing carbon emissions. Participants will be challenged to think in terms of today  not tomorrow, not next year, not in a decade  and begin to identify ways to implement power management policies and reduce IT waste, both at home and at work.", ""], "Author": ["Rod Trent"], "Date": "2010-12-03 00:00:00"}, {"Tags": ["cue", "data center efficiency", "green grid", "pue", "wue"], "URL": "http://blogs.1e.com/2010/12/03/another-data-center-metric-already-cue-cue/", "Area": ["Data Center", "Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Tweets that mention Another Data Center Metric Already? Cue CUE! | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Another Data Center Metric Already? Cue CUE! | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: Another Data Center Metric Already? Cue CUE! - 1E Blog", "Author": "Another Data Center Metric Already? Cue CUE! - 1E Blog"}], "Content": ["", "IT Equipment Energy", "", "The carbon emissions divided by IT load. This provides a ratio of kg/CO2/kWHr where the best possible result is 0. Fair enough? You should be at or near zero for example if you are using 100% renewable energy.", "But is CUE a PUE too far? Mr Ohara seems to think so and I tend to agree, but for different reasons. As Dave states in his piece:", "I actually think that the objections will be much more simple than that. Given that the Green Grid are also unleashing WUE (Water Usage Effectiveness) isnt it just the case that most Data Center managers will be too busy to cope with all of these new metrics? And surely it just creates more margin for some companies to fudge the figures if they so choose.", "I think that it would be much easier to have a single Data Center metric that calculated the overall performance on all fronts. These days we seem to be faced with ever increasing amounts of red tape and reporting requirements, and although I think that the Green Grid is doing a fantastic job in enabling the industry to create some sort of understandable reporting, I feel that these new metrics may be facing a cool reception."], "Author": ["Phil Wilcock"], "Date": "2010-12-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/02/spend-an-hour-with-forrester-dell-and-1e-to-unlock-the-potential-of-an-efficient-it/", "Area": ["1E News", "Events", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: December 14th: Spend an Hour with Forrester, Dell, and 1E to Unlock the Potential of an Efficient IT - 1E Blog", "Author": "December 14th: Spend an Hour with Forrester, Dell, and 1E to Unlock the Potential of an Efficient IT - 1E Blog"}], "Content": ["Sign up to attend"], "Author": ["Rod Trent"], "Date": "2010-12-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/12/02/1e-highlighted-on-the-blog-of-microsofts-environmental-sustainability-team/", "Area": ["1E News", "1E Products", "ConfigMgr", "Green IT", "IT Efficiency", "NightWatchman", "SCCM", "WakeUp"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2010-12-02 00:00:00"}, {"Tags": ["document save", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2010/12/02/pc-power-management-with-all-power-to-the-user-part-3/", "Area": ["Green IT", "IT Efficiency", "PC Power Management"], "Comments": [{"Comment": "Pingback: PC Power Management with All Power to the User (Part 3) - 1E Blog", "Author": "PC Power Management with All Power to the User (Part 3) - 1E Blog"}, {"Comment": "Pingback: Tweets that mention PC Power Management with All Power to the User (Part 3) | 1E Blogs -- Topsy.com", "Author": "Tweets that mention PC Power Management with All Power to the User (Part 3) | 1E Blogs -- Topsy.com"}], "Content": ["", "Weve looked at the mechanics of a scheduled shutdown, and examined the options regarding backing up user files. This final piece looks at the actual user interface, icons and options  what does it all mean?", "", "The following table shows the six possible states for the NightWatchman system tray icon.", "If there is a backup present due to a shutdown having occurred while the user was away from the computer, the following pop-up is displayed when a user logs on.", "Selecting this option keeps the system free from NightWatchman power down events for a period of time. When the option is selected the user is prompted by a NightWatchman Keep Active dialog to choose the period of time to keep active for. This option can be useful when deadlines are imminent and the machine is liable to be used out of normal office hours, or when a particular running task will take a long time to complete. Kind of a Leave me alone Im busy! option.. You even get to select how long you want to remain undisturbed!", ""], "Author": ["Phil Wilcock"], "Date": "2010-12-02 00:00:00"}]