[{"Tags": ["ConfigMgr 2012", "SCCM 2012"], "URL": "http://blogs.1e.com/2014/06/09/a-new-configmgr-start/", "Area": ["ConfigMgr", "SCCM", "SCCM Migration"], "Comments": "", "Content": ["Hopefully I have convinced you to start afresh! In the remainder of this article I will discuss some of the highlights of ConfigMgr 2012 which can help you get the most out of the product whilst not creating an administration nightmare.", "ConfigMgr 2012 has increased the number of clients that a Primary site can manage to 100k clients. This should enable you to only require one Primary site and which means there will be no need for a Central Administration Site (CAS). A CAS will be required if you intend to connect and administer multiple Primary sites. The administration of ConfigMgr through security scopes and roles means that greater granularity can be achieved compared with ConfigMgr 2007. This too can add to the design requirements of not using a CAS in your ConfigMgr 2012 hierarchy.", "You can also have more than one Management Point per Primary site without the need for a Secondary site. If you have a global network then a Secondary site may be required in locations with high numbers of machines. By only having one Primary site you can remove the need for multiple site codes and the administration overhead of clients changing ConfigMgr sites when they travel can also be removed.", "Use the ConfigMgr 2012 design phase to build a reliable and efficient hierarchy and only use a CAS if you really really have to.", "Throughout July Ill be hosting a webinar series on ConfigMgr 2012 migrations. Hope to see you there.", "Peter Clark | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Peter Clark"], "Date": "2014-06-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/06/06/the-life-of-a-1e-support-tech/", "Area": ["1E Careers", "1E Products", "1E Support"], "Comments": "", "Content": ["The life of a 1E Support Tech is predictably challenging. Its not just knowing about our products functionality inside out, but also having hands on experience with related tools and technologies. It requires a rock solid understanding of the architecture  the binaries that make up the product, how it integrates with Microsoft SCCM, how it communicates with Active Directory and MS SQL server, how they communicate back  and it doesnt stop there.", "Spread across the USA, UK, India and Australia and New Zealand, we are a team of technically motivated engineers catering to a diverse global customer base. A three-tier structure within the team sees each group assigned specific roles and responsibilities to ensure smooth function. While the tier one folks answer customer calls, perform initial investigation and troubleshooting, and other frontline duties, the upper tiers quite predictably have a tough job to do. With their expertise and experience, not only do they mentor the frontline guys and handle escalations, but also work in tandem with the genius world of developers, reviewing codes and strengthening the knowledge base. It becomes increasingly important for us to be in sync with each other and share regular updates. Given our geographic spread many of us in the team have not met all our support colleagues in the flesh. We rely heavily on the ever improving Microsoft Lyncs voice and video calls for our triages and meetings. That being said, weve done a great job in sharing our learning and improving as a group  which I think has helped our communication processes.", "Ashutosh Tripathi | Product Support Engineer", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Ashutosh Tripathi"], "Date": "2014-06-06 00:00:00"}, {"Tags": ["branchcache", "whitepaper"], "URL": "http://blogs.1e.com/2014/06/04/new-branchcache-whitepaper/", "Area": ["1E Products", "ConfigMgr", "Nomad", "SCCM"], "Comments": "", "Content": ["The key reasons that BranchCache is not suitable for ConfigMgr content distribution are that it:", "The whitepaper goes into detail on these points followed by an examination of why the expectation that BranchCache could be appropriate for ConfigMgr content distribution should be questioned and needs to be compared to alternatives before deploying in your organization. The final sections of this document review how BranchCache works, how it has changed over the years, and where to learn more.", "Lee Gallington | Product Manager"], "Author": ["Lee Gallington"], "Date": "2014-06-04 00:00:00"}, {"Tags": ["script", "SMSDP variable"], "URL": "http://blogs.1e.com/2014/05/29/where-has-the-smsdp-variable-gone/", "Area": ["ConfigMgr", "SCCM"], "Comments": [{"Comment": "Pingback: where has the SMSDP variable gone? | peter clark consultant blog", "Author": "where has the SMSDP variable gone? | peter clark consultant blog"}], "Content": ["This Task sequence variable was around in ConfigMgr 2007 and I used it to get the name of the server where content was being pulled from.", "One thing I have found when deploying the task sequence that will run the script and set the SMSDP variable the deployment distribution options must be set to Download content when needed by the running task sequence. This option will not download the package into the CCM cache but directly into the _SMSTaskSequence folder and this option does not use an Alternate Content Provider (ACP) if present. The content will then get deleted after the task sequence runs. This will force the content to be downloaded every time the task sequence is run.", "Now we can get on and use the DP FDQN to our hearts content.", "Peter Clark | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Peter Clark"], "Date": "2014-05-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/05/27/bring-your-own-pc-why-not/", "Area": ["1E Products", "BYOD / BYOPC", "MyWorkNow"], "Comments": "", "Content": ["Would the user be interested in bringing in a PC and if so, can they expect to gain to the same level?", "Clearly there are the age old concerns of security and compliance and so long as these items are being catered to, what else is there to prevent a user making use of her own PC?", "In the enterprise today, there are many technologies that enable a user to use any PC with total security such as server hosted virtual desktops (commonly referred to as VDI desktops) that make use of a simple client side software title that enables the authentication of the user to corporate systems before granting access to a desktop that is executing 100% in the enterprise datacenter, transmitting only key presses/ mouse movement and screen refreshing across the network from and to the client device respectively. Such technology delivers security by design since the only thing to leave the datacenter are the visible content of the screen, leaving all data within the safety of the datacenter walls.", "Other solutions also exist to enable the user who needs to also be able to access the corporate applications when they are not connected to the corporate network. Such solutions typically make use of similar virtual desktop technology that are hosted on the users PC itself in a secured encrypted bubble preventing prying eyes from gaining access to the goodies held within. These solutions are generally delivered with a much stronger/ louder story of security since they are effectively executing a copy of the desktop on the users own PC, meaning that the enterprise administrator instinctively does not trust it at all. However, considering the solution will typically only communicate to central services via encrypted channels (SSL) and then all local content is encrypted to high levels (typically AES 128 or greater), then the security of the data is actually greater than it is in the server hosted virtual desktop models.", "In both of the above examples, the users PC need not have direct access to the enterprise network (in fact it should be encouraged to remove the option to have direct network access  use a dirty WiFi network instead perhaps), so operating from home/ on the go is a pretty simple affair and afford the user that luxury of choice over what device they use to perform their work duties and perhaps importantly open up the ability to choose WHEN they do it also.", "1E are bringing to market a brand new solution to market later in 2014 that will give the CIO the ability to enable the user to make use of their own PC (Windows or Mac), while working from a standard corporate Windows image that is managed alongside all existing corporate Windows desktops, while enjoying the full peace of mind of being secured both in transit (SSL) and while at rest (AES 256) on the users PC. MyWorkNow will help drive down the cost of delivering Windows in the enterprise while enabling the users to bring their own PC into the enterprise without impacting on either personal or work data, or allowing them to actually meet.", "Simon Rust |Director, Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Simon Rust"], "Date": "2014-05-27 00:00:00"}, {"Tags": ["Our people"], "URL": "http://blogs.1e.com/2014/05/23/introducing-our-shopping-product-owner/", "Area": ["1E Community", "1E News", "1E Products", "Shopping"], "Comments": "", "Content": ["Before joining 1E, I gave a long and hard thought to which type of organization I should consider for my next assignment. Learning more about the 1E product line certainly helped me streamline my thoughts. I noticed that each of 1Es products had two common characteristics:", "Shopping is of particular interest to me. Not because I am a part of the Product Group that manages it, but because of the unique positioning it brings. It effectively takes the modern day App Store experience and applies it to the long standing helpdesk problems most of us have faced in our corporate career. It is also a product where I can make good use of my past experience, which has mainly been in managing enterprise products. Apart from managing products from the middleware technologies and Supply Chain, I also have a Consulting and Business Analysis background. Additionally, I hold a B Tech. degree from the National Institute of Technology, Bhopal.", "Over the next few weeks, I will be talking about the upcoming features in Shopping and stressing the underlying value they bring in. Version 5.0 was a big release in Shoppings lifecycle, and I believe that the upcoming ones will be just as exciting. Watch this space for more updates.", "Abhishek Chandhock | Product Owner", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Abhishek Chandhock"], "Date": "2014-05-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/05/20/how-to-minimize-the-risk-of-an-osdisaster/", "Area": ["ConfigMgr", "OS Deployment", "Systems Management", "Windows 7 Migration"], "Comments": "", "Content": ["Ill stop for a second to let you take that in.", "Yes, even servers. By the time it was realized what exactly had happened, the Windows 7 sequence had repartitioned, reformatted, and installed Windows 7.", "System Center 2012 R2 Configuration Manager does a great job of deploying Windows operating systems. We at 1Ehave been able to hit some pretty high success rates in helping our customers with their Windows migrations. However, if not done correctly, OSD can be very dangerous and can cripple your environment in a short amount of time, as Emory found to their cost.", "There are several checks and balances that can be put into place in order to prevent something like this from happening and in this post I will focus on Maintenance Windows and limiting Collections. If you are still stuck in the habit of setting up deployments to All Systems, then the best thing you can do is break that bad habit now! Otherwise, be sure to keep a copy of your resume updated in case something really bad happens.", "Mike Terrill | Systems Management Practice Lead", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Mike Terrill"], "Date": "2014-05-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/05/19/introducing-client-hypervisors-to-deliver-anything-anywhere/", "Area": ["BYOD / BYOPC", "Data Center", "MyWorkNow"], "Comments": "", "Content": ["That very solution that gave me an ability to test software compatibility and run multiple different Operating Systems on a single laptop to emulate my customer environments as a consultant back in the late 90s, now has a whole heap of additional uses that have moved beyond those initial QA use cases and forward into the enterprise as a means to actually deliver a business desktop or business applications that are relied upon daily.", "It didnt take long for users of Mac laptops / desktops to figure that they could make use of such technology (now available from other organizations than the original VMware) to spin up their own Windows Operating Environments to enable them to make use of the Windows applications that they still need in order to conduct their business. In fact, my wife has a Macbook Air today as she prefers its style but has a Windows virtual machine running on it that runs the Internet Explorer browser because the companies that she consults with make use of web technology that mandate the use of this particular browser to access their services.", "Microsoft themselves have used the technology as a means to deliver backwards compatibility for their customers where a specific software title simply will not function on the newer operating system. This is where the Virtual PC (originally from a company called Connectix) became an installable component (known as Windows XP Mode) within Windows itself on Windows 7, Pro, Enterprise and Ultimate and has since migrated over to the Hyper-V nomenclature within Windows 8.", "So, there we have it, the client hypervisors (known as type 2 hypervisors as they rely on an existing operating system being in place to layer an additional operating system on top) are reasonably widespread used by users (typically more technically savvy users) to enable them to perform tasks on their PC that they could not otherwise do (hardware or software compatibility being the main use case). The next stage is enabling the same technology to be made available to the less technically savvy users who have the same use cases and requirements. Of course this is a complex requirement due to the very nature of the less technically savvy users not necessarily understanding the build-up of multiple operating systems (nor caring about this somewhat trivial piece of information!) on the same physical device, together with the need for things to just work effortlessly.", "At 1E we have such a solution that is under development and on its way to a desktop near YOU, so please stay tuned for more information and spoilers in the coming weeks.", "Simon Rust |Director, Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Simon Rust"], "Date": "2014-05-19 00:00:00"}, {"Tags": ["Graduate Diary", "Graduate Scheme", "Graduate Training Program", "Graduate Training Scheme"], "URL": "http://blogs.1e.com/2014/05/15/graduate-diary-2014-3/", "Area": ["1E Careers", "1E Community", "1E Graduate Scheme"], "Comments": "", "Content": ["If youve been following us from our previous blog posts, you probably know that weve found 1E to be a great place for recent graduates to work. Though 1E has experts in a variety of subject matter, information transfer isnt always easy, especially when one of the participants is a graduate. Despite being a practice that usually occurs in much larger companies, 1E also operates a mentorship programme. This was set up to help graduates become accustomed to the methodologies and practices that are part of working at 1E.", "Shortly after joining 1E, we were each assigned a mentor that would assist us through the graduate scheme. This was done in a formal fashion, where they would assign us objectives and milestones that we were able to work towards. This helped us develop our skills and product knowledge during actual work for the company, as opposed to more meaningless training scenarios. Our mentors would have regular catch ups with us and discuss our daily progress. They would take the time to walk us through concepts and hurdles, even if we felt we were distracting them from their usual tasks. Mistakes are bound to occur when youre new to a role, but they were never an issue with our mentors, who encouraged us to learn from our experiences. It is easy to see that our mentors were picked for both their experience and skillsets, as well as their friendliness. It was up to us to prove ourselves worthy of the mentors time and effort. Nowadays, we dont lean so much on our mentors, but work without pairing up, but the foundations they gave us was a massive boost in the early days of our careers with the company."], "Author": ["Kanthiraj Thiyagarajah", "Winta Zibello", "Ravi Acharya"], "Date": "2014-05-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/05/12/access-anywhere-at-any-time/", "Area": ["1E Products", "BYOD / BYOPC", "MyWorkNow"], "Comments": "", "Content": ["As I sit on this busy train heading north back home after a week in the city, I observe that of the 12 people sat directly around me, two are sleeping, four are on laptops and everyone else is staring into a mobile phone. Rather incredibly there are no conversations going on in the physical sense  just plenty of keyboard clicks or screen taps. Forget the future is mobility and access anywhere, it is here folks today and is staring us down.", "So what does this mean? Why should we care?", "It is a maturity level around our collective use of technology that is unprecedented  never before have we been so reliant on technology to conduct our lives and it is only going to get more so.", "All these expectations are not left at the door when we walk into the office ready to be collected on the way out, so it doesnt take a large leap to realise that we have expectations that are gaining in both magnitude and quantity building up around the business technology/ IT groups doorways. The only way to be ready for the onslaught is to be ahead of the game and build services for both today and tomorrows expectations.", "Access anywhere at any time may well just be the current big challenge dropped on our doorstep so are we ready for it? Are we ready for whatever maybe next? Can we predict it yet?", "Simon Rust |Director, Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Simon Rust"], "Date": "2014-05-12 00:00:00"}, {"Tags": ["Tech Ed NA", "TechEd 2014"], "URL": "http://blogs.1e.com/2014/05/08/1e-at-teched-na-2014/", "Area": ["1E News", "Events", "TechEd"], "Comments": "", "Content": ["The days of requiring extensive hardware and resources to build out a decent test environment are fading fast as new technology and more powerful hardware come out. Yet, often times companies disregard the importance of a lab and take major risks by doing things directly in their production environment. It is always best to have a lab to play around in, test that script that is needed to be used in production or simply test and document an upgrade process. This can easily be done by using equipment and software that is already available and can prevent costly mistakes to a production environment. Using tools like the Microsoft Deployment Toolkit, Hyper-V, PowerShell and a little bit of automation, you can quickly be on your way to setting up the Essential Lab Environment. Once the framework is in place, building out new environments is a snap. Need to refresh a few test client systems or build new ones? No problem! With a reusable solution in place, you should never be without a lab environment again.", "See you in Houston!", "Mike Terrill | Systems Management Practice Lead", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Mike Terrill"], "Date": "2014-05-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/05/06/three-key-techniques-for-amazing-osd-success-a-new-whitepaper/", "Area": ["1E News", "AppClarity", "Nomad", "OS Deployment", "Shopping", "Windows 7 Migration", "Windows XP"], "Comments": "", "Content": ["Implementing an OSD project can be a bumpy ride, especially considering the plethora of requirements in terms of location, build types and the way organizations like to operate their systems management environment. One of the requirements in this case was for the ability to deploy the majority of build types at all locations. By build type we mean the application profile that identifies the function of the machine within the company. Considering the number of types and the number and dispersal of the locations to consider, utilizing T1 network links or worse, it was clear this really was going to be a challenge.", "How did they measure OSD success? The core questions are:", "Clearly in this case success was impressively achieved. The numbers and rate are large for any organization. The techniques used ensured that branch operations were not compromised and the workstations had the applications required. The unique techniques the consultants developed include:", "Paul Thomsen |Associate Product Manager", "If you found this article useful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Paul Thomsen"], "Date": "2014-05-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/05/01/there-are-no-silver-bullets-in-sam/", "Area": ["Software Asset Management"], "Comments": "", "Content": ["In this, the final blog I will be writing during my tenure consulting for 1E  I wanted to leave the reader with a notion of what a software asset management (SAM) framework should be capable of adapting to.", "Possibly the reason we dont talk about a SAM system or a SAM framework, is because we have been willingly led by the nose by tools providers that their product is the silver bullet to SAM, and so with a weary reluctance we nod our heads and watch systems implementers and product consultants scurry about our premises like the mice on Bagpuss (US readers, please reach out to your British colleagues for this reference) in the vain hope that the tool is the solution.", "But as I heard on a recent podcast on ITAM Review: A fool with a tool, is still a fool!", "There are no silver bullets in SAM, and so whilst the implementation of a software product might answer an element of your SAM woes, the wider picture will still need addressing.", "So rather than swallow the orange whole, lets take a stab at the information that might reasonably be expected within the SAM solution, and then assess the frequency and speed of change for that data. If, after having gone through a software vendor audit, you will wish to keep a tempo or operating routine to keep your reports fresh/relevant then perhaps you might be able to direct finite resources to where they are needed to ensure that whatever ad-hoc reporting mechanism provided you with your audit and reconciliation reports is consolidated, and then refined, over time:", "This list is not exhaustive, but in assessing data flux/change, hopefully you will begin to see where you need to direct your SAM efforts once a BAU status is close to being declared.", "Rory Canavan | Director, ITAM Services", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Rory Canavan"], "Date": "2014-05-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/04/24/windows-is-still-the-king-of-applications/", "Area": ["BYOD / BYOPC", "Windows 7", "Windows 8"], "Comments": "", "Content": ["In fact the analysts seem to agree that almost 70% of all corporate applications in use today are still Windows applications and that this is a fact that is not going to be reducing significantly anytime soon. Maybe five years from now we will be in a different place and the reliance on the Windows platform will have lessened enough that the business computer platform will have become somewhat irrelevant, however for the next few years, we must accept that we remain shackled to Windows as the corporate desktop operating system.", "Yes, we have Mac users in the enterprise who can get along OK for some work tasks (Microsofts Office 2011 for Mac is pretty good and certainly meets the good enough entry bar for most people), but these users will require some form of virtualization to deliver a Windows desktop into the Mac device so that work may be completed in the applications that are not available natively on the Mac platform (examples such as Microsoft Project or Microsoft Visio are appropriate here).", "While technologies have existed for many years now to deliver a virtual desktop to such users, the key offline use case has not been catered to, leaving users unable to work effectively while offline (such as during travel or even on poorly connected networks).", "So we are left with client virtualization (using tools such as VMwares Fusion (for Mac) or Workstation (for Windows)) as a potential means to deliver Windows desktop and Windows applications to such use cases while enabling offline usage, typically leaving the user in control of creating and maintaining their own Windows desktop.", "In conclusion, regardless of the platform that the user population use, in the enterprise, Windows is still the king of applications.", "Simon Rust |Director, Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Simon Rust"], "Date": "2014-04-24 00:00:00"}, {"Tags": ["heartbleed"], "URL": "http://blogs.1e.com/2014/04/22/heartbleed-bug-and-1e/", "Area": ["1E News", "1E Products", "ActiveEfficiency", "AppClarity", "IT Security", "NightWatchman", "Nomad", "Shopping"], "Comments": "", "Content": ["I hope this is pretty clear and unambiguous, but If you have any questions, feel free to reach out.", "Regards,", "Geoff Collins | VP Product Management", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Geoff Collins"], "Date": "2014-04-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/04/22/what-motivates-users/", "Area": ["BYOD / BYOPC"], "Comments": "", "Content": ["It depends on what sort of user they are  i.e. are they in sales or in engineering, marketing or research. Many users are motivated financially, with others being motivated by challenging work. This is a subject that has been written about many times over, so this will not just be a re-write of such existing work.", "A few years ago, the workforce might have been motivated by the car that their job function came with, as an example I recall being HIGHLY motivated when my boss said to me one morning that it was time for me to receive a company car. A month later I took delivery of a brand new Volkswagen Golf GTI and wow did I cover some miles, eating into my own time every day on behalf of that company travelling in my dream car, not caring that I was probably giving the company more than 50% more time each week. I gave some of the best energy of my career during the 12 months that followed receiving that car, awakening at 4am to do a four hour drive before spending a full day with a client and thinking nothing of it. This is what motivation did for me personally.", "As I have written about recently, computing devices may well be a motivator today as we generally like to be thought of highly and being given a nice laptop/ desktop computer/ smartphone may well be a motivator that has a similar effect. For example, if I had a cheap looking plastic laptop then I may be more than a little embarrassed to get it out to perform a presentation or product demo, but if I had a nice cool laptop that others aspired towards or wanted, then the thing would be jumping out of my bag at each opportunity and the quality of my presentations and demonstrations would be immeasurably better.", "The trick is spending time getting to know the users and thus understand exactly what makes them tick. Having this knowledge enables you to deliver the right thing(s) to give them the hit that they need at the right time. It is also key to point out that this will change over time, where in my example the car gave me a boost for almost 12 months, but some motivators may only have an impact for weeks (such as a spot bonus) so be always on the lookout and most importantly, UNDERSTAND YOUR USERS; it will pay handsomely once you begin to get it right.", "Simon Rust |Director, Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Simon Rust"], "Date": "2014-04-22 00:00:00"}, {"Tags": ["Our people"], "URL": "http://blogs.1e.com/2014/04/17/introducing-our-nomad-product-manager/", "Area": ["1E Community", "1E News", "1E Products", "Nomad"], "Comments": "", "Content": ["Prior to joining the 1E product team around five months ago, I was leading the EMEA Pre-Sales team and before that was a Senior Consultant here. I joined 1E, around eight years ago now, after working alongside them on a project which showed me just how much they lived up to their reputation of having truly world class systems management expertise, and quite simply, this was a place I wanted to work and grow my career.", "Working with various clients and on many varied projects over the years it has been a great opportunity to spend a lot of time observing the challenges our customers were having, and the ingenious ways both 1E products and 1E people expertise have been used to overcome these systems management challenges.", "A big part of many of the projects I have worked on had Nomad firmly at the heart of them. So it is an honor for me to take on this product management role, and as I intend, to help guide it along a path to achieve even more in addressing and overcoming the systems management challenges of today and tomorrow.", "Over the coming weeks Ill be blogging about some of the upcoming features, use scenarios and maybe some features / differentiators that maybe you werent aware of.", "If theres anything youd like me to write about in terms of Nomad capabilities, how our customers are using it or windows deployment and migration scenarios perhaps  please feel free to leave a comment below.", "Lee Gallington | Product Manager"], "Author": ["Lee Gallington"], "Date": "2014-04-17 00:00:00"}, {"Tags": ["BAAF", "London Marathon"], "URL": "http://blogs.1e.com/2014/04/16/1e-london-marathon-exploits-net-charity-20000/", "Area": ["1E Community", "Charity"], "Comments": "", "Content": ["Sumir along with Will Edmondson, Chief Financial Officer and Nick Milne-Home, Chief Operating Officer and President of 1E North America, crossed the line in an impressive 4 hours 16 minutes.", "Dressed during the race in distinctive sunflower outfits, they have so far raised 20,000; almost double last years total. This comes from around 10,000 in donations, which 1E have then matched. The trio had been aiming for 15,000, so have well surpassed that mark.", "Sumir, who was running his second London Marathon after finishing the 2013 race, and who managed to beat his PB by a quarter of an hour, said after the race, I was keen to return after last years race, and once again the passionate support of the London crowds was a huge help in pushing us around the course. It has been great fun training, running, and fundraising for the London Marathon.", "A keen supporter of BAAF, Sumir continued, There is a serious message behind our costume choice. We hope that our work with BAAF brings Sunshine to the lives of those children who struggle to find adoptive parents. Our aim was to raise 15,000, and to surpass that by such a distance is testament to the generosity and spirit of our friends, colleagues, and acquaintances, and the worthiness of this great cause. All three of us feel tremendously privileged to have been able to support BAAF in this way.", "Marta Montague, Corporate and Major Donor Fundraiser at BAAF, said All of us at the BAAF office were very excited about Sumir, Nick and William running in the London Marathon in support of BAAFs work. As if that was not enough of a challenge they chose to run dressed as Sunflowers on what was quite a warm day! We were wondering whether we would be able to spot them, and awaited in anticipation at our main point between mile 22 and 23. We neednt have worried as long before we saw them at mile 22, we spotted them across the road at mile 13. I have also received many I just saw three 1E-BAAF sunflowers messages from colleagues and supporters at different points.", "Sumir, Nick and William were amazing, finished in a great time and made the London Marathon look easy. They also inspired so many to generously support them too. We are very grateful to the three 1E sunflowers, everyone at 1E and all that sponsored them.", "1E has been BAAFs supporter for a decade now and we feel very privileged to work with such an amazing company led by Sumir whose commitment to charitable work is second to none. It is with support like this that we are able to find more families for children who cannot be with their birth parents.", "Will Edmondson, running his fourth London Marathon, said Its not too late to back BAAFs work by sponsoring us. We really appreciate all your support and thank you for any donations, they have a huge impact on so many lives. If you are a UK tax payer, please remember to tick the Gift Aid box, it makes a big difference and doesnt cost you a penny extra.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2014-04-16 00:00:00"}, {"Tags": ["server management"], "URL": "http://blogs.1e.com/2014/04/14/life-of-a-configmgr-administrator-part-2/", "Area": ["ConfigMgr", "Data Center", "Server Power Management"], "Comments": [{"Comment": "Pingback: A Day in the Life of a ConfigMgr Administrator: Part 11E Blogs  Insight and debate on IT Efficiency", "Author": "A Day in the Life of a ConfigMgr Administrator: Part 11E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Point-of-View: from a ConfigMgr Administrator to his Manager, discussing how he/she spends their day managing a ConfigMgr environment.", "So a little background first; weve got 140 Distribution Points in our ConfigMgr environment and sometimes we have package distribution problems. Ive previously described to my manager how I spent an entire day troubleshooting a failed application deployment, and what I had to do to fully resolve the problem. Well, when I mean fully resolve, I mean resolve the problem within the current constraints of ConfigMgr itself.", "BranchCache  unfortunately BranchCache still utilizes the BITS technology (which we previously had to restrict heavily with 5kbps rate-limits to avoid WAN saturation) and therefore it would take days for packages to be transferred to remote locations. We had many offices with multiple subnets, which meant ConfigMgr would have to transfer the same content multiple times over the WAN link (using BITS) to each subnet at the same time. We would also still need to keep the Distribution Point anyway as we needed the PXE network boot capability on a Windows server. Oh, and the State Migration Point or another file server storage for user profile & data backup when performing OSD. All these restrictions immediatelydiscounted the use of BranchCache anywhere. We found a few more, lesser known areas that discounted the use of BranchCache further. BranchCache required twice the disk space of a normal ConfigMgr Client cache as content was required to physically reside in both cache locations, and there is no way of telling what content was held in the cache or how long this would be retained until tombstoned/deleted. Yeah, BranchCache was definitely not an option for our business.", "WAN Caching devices  an advantage for us was that we already had these in our Tier-1 office locations. It was hit-and-miss at our smaller Tier-2 offices, but nothing at all for offices in smaller locations like South East Asia. OK, not a massive problem. We could take advantage of the caching boxes where we had them and maybe use something else at the other locations. The network team didnt like this at all! When I said we might want a few GBs of storage for ConfigMgr they simply couldnt believe me. WAN Caching devices are used to cache Internet content that is continually reused by users, they told me. I said that was exactly what ConfigMgr was doing, we needed to cache applications that were going to be used again and again for months on end. Ahh, the content on the caching devices can only be kept for a few days before it is rolled over (deleted) during refresh. That is not going to work with ConfigMgr, as that will usually mean the same application is having to be re-transferred over the WAN multiple times! That isnt very efficient at all! Plus wed have different processes for different offices, and Id prefer to keep to one standard operating procedure.", "1E Nomad  this software doesnt cause WAN congestion as it is true adaptivebandwidth throttling, rather than basic rate-limited technology (like BITS). The most interesting point of 1E Nomad is the fact that it will be transparent to my normal day-to-day operations of ConfigMgr. I wont have to worry about a managing the Nomad add-on as a separate infrastructure outside of ConfigMgr (like WAN caching devices) as I can control 1E Nomad within the same ConfigMgr Administrator Console I use every day. And I can see where content actually exists (cached), whereas I couldnt with BranchCache. Another great feature with 1E Nomad is that I wont have to worry about ConfigMgr site boundaries  more importantly overlapping or misconfiguration of site boundaries! Furthermore, 1E Nomad would provide the same level-of-service as if we had a real ConfigMgr Distribution Point. The PXE Everywhere and Peer Backup functions of Nomad provide the normal PXE Point and State Migration Pointfunctions respectively, and utilize the same most suitable computer technology to automatically choose the best computer to perform these functions. Nomad is obviously much more than just an Alternate Content Provider.", "I reported back to my manager with this preliminary information and we decided to evaluate 1E Nomad further. We contacted 1E, and after an initial meeting to understand the basics, we were provided with the evaluation software, access to the online documentation,and I was engaged by a Solutions Engineer who helped get me going in our lab environment. The Solutions Engineer remained on hand to answer my questions and helped me whenever I needed throughout our evaluation.", "This is part two of a story I experienced in a past life as a ConfigMgr Administrator. The third part of this story will detail our evaluation and testing of 1E Nomad, and what we had to prove so we could put this tool into production use within our business.", "Brent Hunter |EMEA Solutions Engineer", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Brent Hunter"], "Date": "2014-04-14 00:00:00"}, {"Tags": ["Consumerization of IT", "User transformation"], "URL": "http://blogs.1e.com/2014/04/09/consumerization-of-it-user-transformation/", "Area": ["BYOD / BYOPC", "Software Delivery"], "Comments": "", "Content": ["The vast choice of mobile devices available and ease of use of such devices has radically changed the way in which we all interact with technology by moving it as something that most of the population use every day rather than it being something that you had to use in the office or something that the nerds do. The mobile phone for many was the entrant into this new world where the desire to be available by telephone in almost any part of the world became a highly regarded requirement. As we became users of the technology, Apple entered the market and helped it shift up a gear by driving the cool must-have end to the market, simplifying usage along the way, thus carrying us all along with it. Before we knew it, we were craving the latest Apple or Android device, including the newer large screen devices (tablets) that were (and still are) effectively just bigger form factor phones.", "The key to all of these consumer devices was simply ease of use  they were easy enough for mom and dad to pick up and use, and hey, even grandma and grandpa could pick one up and be making and taking phone calls and photographs in no time at all.", "It didnt take long for us to realize that the IT that we were using in the office just wasnt quite as easy to use as the IT in our pockets and so as a result we began to use our own IT to conduct office activities, starting with email and calendar activities as these were native applications to our own IT.", "The transformation was beginning  we were realizing that there were better, easier ways to perform certain tasks than our respected IT departments had been telling us and that we could be in more control of how and when we did things. A few years ago, I was the CIO of a small company where one of the team brought in his shiny new iPhone, demanding that he be able to get his email on it. At the time, we could not accommodate the request since there was no way to remotely manage the device or more importantly clear out his emails and calendar information should he leave the business. It was actually during this very conversation way back in 2008 when I realized the importance of giving the user the capability to work when and where they wanted to, since it was clearly a motivator for this chap. It didnt happen overnight but we searched out solutions that would allow our users to make use of their own IT to access our systems, so long as we could remote wipe them should the need arise. In these early days the users would accept the fact that the IT team could wipe their entire device because they were so overjoyed at being able to use their own kit to conduct business at a time that they desired  it was almost like having competitive edge over their colleagues as they could check email and prepare for their day before they actually arrived in the office.", "As our personal devices have become ever smarter by virtue of there being a plethora of applications available to them today from checking the weather through to creating content and on to being able to store that content online, securely and be able to access it from any device in any location at any time. Our lives have become ever more online and our tolerance of complex IT has lessened significantly, where we are actively rejecting standard enterprise policies and procedures in the quest of simplicity and ease of use. No longer will we accept that our personal information may be wiped at will by some guy in IT who doesnt seem to understand my needs quite like I do, resulting in a real challenge for the CIO.", "The result of this? Well we (as users) see ourselves actively working around policies in a bid to make our lives easier. Clearly, IT management may see this as the users turning into potential hackers and raise the risk associated with the user population when in the most part, the users are just trying to get things done more efficiently.", "The CIO who has taken steps to listen to the requests and needs of the user is embracing the transformation as it is occurring and should ultimately begin to see a happier, more productive workforce who will always be testing out the boundaries of reach, but who will help increase profitability as they know how and when they want and need to work. Sure, data security must remain center stage for the CIO as he/ she remains responsible for corporate data security, but working with the user population to deliver services that can enhance their satisfaction and ultimately throughput can only serve to help increase profitability while maintaining staff motivation. In todays disposable world, where staff have way more of a choice of where they want to work, the CIO who is providing a motivational work environment is always going to be a popular guy.", "The question is where does our transformation go next and how will we all react?", "Simon Rust |Director, Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Simon Rust"], "Date": "2014-04-09 00:00:00"}, {"Tags": ["Product support"], "URL": "http://blogs.1e.com/2014/04/08/extended-support-contract-for-windows-xp-on-1e-products-throughout-2014/", "Area": ["1E Products", "OS Deployment", "Windows 7 Migration", "Windows XP"], "Comments": "", "Content": ["Hello there,", "As Im sure you know today marks the end of Microsofts extended support for Windows XP. While the majority of our customers have taken advantage of our windows migration technologies, we acknowledge there will be pockets of legacy systems out there. This may be for a variety of reasons such as legacy applications or regulatory compliance issues, etc. Over the last few weeks, weve had a couple of people reach out to us to ask for advice on 1E product & Windows XP support.", "Kind Regards,", "Geoff Collins | VP Product Management", "Ultimately it comes down to: We will make reasonableendeavoursto diagnose and resolve the issue", "If you have any further questions  Please comment below and Ill try to answer or update the FAQ above.", "Geoff Collins | VP Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Geoff Collins"], "Date": "2014-04-08 00:00:00"}, {"Tags": ["ConfigMgr 2012 security"], "URL": "http://blogs.1e.com/2014/04/07/better-understanding-configmgr-2012-security-controls/", "Area": ["ConfigMgr", "SCCM"], "Comments": "", "Content": ["ConfigMgr 2012 security is a very broad topic, so to be clear Im only talking about some core concepts that apply to the SCCM console, and to what ConfigMgr administrators can do with it (or equivalent solutions, such as PowerShell scripts, that use the SMS provider).", "Central to simplifying ConfigMgr hierarchies is removing the need to have primary sites to manage subsets of clients. With ConfigMgr 2007 you might have created a separate SCCM site to manage datacenter clients, another for your clients in Europe, and another for the executives computers. The same logic could have applied to managing their ConfigMgr objects, such as packages, task sequences, and software update deployments. SCCM 2012 gives you new options to put controls in place without having to add primary sites.", "The first set of such controls are what well call assignment collections, meaning collections used to define the clients and users that the administrators can manage. Those are collections that can be assigned to administrators (thus the name, but thats not official Microsoft terminology). When setting up an administrator in the ConfigMgr console you should assign them one or more collections that the administrator can use. When the administrator is creating deployments or otherwise managing clients or users they can then use those collections to target the right clients or users, or use collections that are directly or indirectly limited to those assigned collections. Clients or users that are outside those assigned collections are not available to that administrator, no matter how the collections limited to those collections are defined.", "The second set of controls are security scopes. Scopes control which ConfigMgr objects the administrators can see in the ConfigMgr objects (except for collections and the clients and users in those collections, which are limited as above). So scopes control which administrators can see applications, packages, deployments, task sequences, sites, distribution points, software metering rules, configuration items, and a wide variety of similar objects. When creating such objects the administrator can assign the objects only to scopes that they are assigned, and thus other administrators cannot see the objects they have created unless the other administrators also have that at least one of those scopes as one of their assigned scopes.", "The third and final set of controls are security roles, meaning the ConfigMgr permissions that the administrators have. There are a number of predefined sets of permissions (roles) and you can easily create more.", "Between these three sets of controls you can ensure that administrators can do only what you intend, using only their objects or the objects you want, to the appropriate set of clients or users. You can be confident that the administrators wont do more than intended, no matter what site the administrators have access to.", "I hope thats reasonably clear. I find that SCCM experts know about Role Based Access Control (RBAC) and have no problem with the concept of roles and permissions. Scopes are fairly straightforward too, except that sometimes people think that collections or clients and users can be limited using scopes. Everyone knows about limiting collections (you cant create a collection without one), but they dont always appreciate that an administrator can be limited to one or more collections (one or more high-level limiting collections, if you will).", "The concepts especially come together when creating deployments  you might want to limit which administrators can see the deployment, and which administrators can include their clients in the target of that deployment. So you might think that scope is the critical concept in that if the admins cant see the deployment in the console they wont be able to use it. For example, if your German administrator creates an Office 2013 deployment that is scoped to only the German administrators and targeted at a collection that is defined to contain only the German clients, you might think theres no chance of anyone else receiving it. But thats not the case if all your European administrators are assigned to a collection that contains all the European clients. In that case an Italian administrator might see the German Office 2013 Deployment collection and he could change its rules so that it also includes the Italian clients. Scoping doesnt stop him from doing that, nor does collection limiting. Of course your administrators are all professionals so this particular example wont happen, but mistakes along these lines could.", "Given this understanding, we should consider whether there are any implications for our processes. One possibility is that you could consider whether you need a process to coordinate object creation. For example, administrators from multiple scopes may require an Office 2013 application, but the second administrator to have such a need might not be able to see that another administrator has already created one because they are in different scopes. With appropriate coordination the second administrator could ask a senior administrator to add his scope to the already existing application, allowing him to see and use it as well.", "Any SCCM administrator with even a little experience is aware of the dangers of changing a collection and thus changing the targeting of deployments using that collection. However, we should extend that thinking to the extension of changing the security boundaries of your administrators by changing collections. As a senior administrator you would check the Deployments tab of a collection before changing the rules of that collection to ensure that you dont increase or decrease the targeting of deployments inappropriately. But do you also check the Security tab to see which administrators can see the clients or users in that collection? You could be unintentionally changing the jurisdiction of some of your administrators. This is another good reason to limit the number of collections you use  this gets complicated very quickly.", "We hope that this discussion based on our experiences here at 1E is helpful. Ultimately the SCCM 2012 administrator security controls are not complex, but its still appropriate to take a few minutes to think through the implications of your security design. Let us know if we can help.", "Paul Thomsen |Associate Product Manager", "If you found this article useful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Paul Thomsen"], "Date": "2014-04-07 00:00:00"}, {"Tags": ["self service", "Self service software", "shopping"], "URL": "http://blogs.1e.com/2014/04/04/self-service-give-people-choice/", "Area": ["Software Delivery"], "Comments": "", "Content": ["Self Service Checkouts have become common", "Although I spend a lot of my time thinking about how self service works in enterprise IT, the concept itself is much more pervasive. Increasingly in modern life there are self service options for many actions traditionally handled in a manual way. The local supermarket offers a key example of this. Increasingly self-service checkouts are becoming more and more common, often augmenting traditional staffed checkouts.", "The lesson I take from this is that it is very difficult to predict who would prefer to use a self-service capability. Although there are undoubtedly people out there who prefer to deal with a person  either face to face in a shop, or on the phone when dealing with corporate IT  you just cant tell who will take which position, and how fast that might change when other options are available. As populations as a whole become used to self service in their every-day life (with smartphone and tablet app-stores, online banking for more complex activities, and any number of other examples), it seems clear that Enterprise IT must see the provision of at least the choice of self-service as increasingly important. Users of corporate IT services expect to have the option to help themselves rather than just call a helpdesk. They expect a self service portal like an App Store that can give them the experience they get from modern consumer devices and that can automatically deliver the software and services they need when they need them  just as savvy shoppers expect to be able to pay for their goods without queuing for a checkout assistant.", "Dave Harding | Senior Product Manager", "Did you find this article helpful? If so, please share it with your contacts using the social media buttons to the left."], "Author": ["Dave Harding"], "Date": "2014-04-04 00:00:00"}, {"Tags": ["Graduate Diary", "Graduate Scheme", "Graduate Training Program", "Graduate Training Scheme"], "URL": "http://blogs.1e.com/2014/04/04/graduate-diary-2014/", "Area": ["1E Careers", "1E Community", "1E Graduate Scheme"], "Comments": "", "Content": ["During our first week in 1E we were introduced to the rest of the staff within the department, who were very welcoming and at ease with both us and each other. We were invited to an engineering team day, where everyone was very open about the processes used in the past and how they could be improved.", "The engineering team day involved discussions on how to work better individually and in our respective teams. We also partook in some team building exercises which were quite challenging but also fun. The evening was accompanied by a trip to the pub. A bit conscious, (this was our first day!), some of us were a little reluctant. But after some gentle persuasion, we had one, or two drinks. The rest of the first week flew by. As well as the wider engineering team, we got to meet each and every one in all departments within the company, and had HR and IT inductions. We were also instantly involved in the calendar of 1E activities and competitions, of which there are many. Kanthiraj and his mentor even to win the companys Christmas tree decoration competition.", "Later on in the week, our line managers treated us to a company lunch in order to get to know us better. We started to work for different teams but we had enough time to have regular knowledge sharing sessions amongst ourselves to learn about principles used within 1E such as testing methodologies and virtualization technologies. We were introduced to our mentors and given objectives for the next few months which were generally our work flow. We each began work on separate products.", "The Engineering work floor is the coolest place in the whole company building with high tech trolley labs, the network scalability lab, engineering desks, and most importantly a fully stocked kitchen for snacks and breakfast, courtesy of a weekly Waitrose delivery (No joke!). We communicate with the team using Lync and Yammer, and access the knowledge base using SharePoint and Confluence. Fortnightly engineering meetings and monthly company updates by the CEO eliminates the question Whats going on?, that seems to plague so many companies."], "Author": ["Winta Zibello", "Kanthiraj Thiyagarajah", "Ravi Acharya"], "Date": "2014-04-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/04/03/windows-migrations-an-analysis-of-your-options/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration", "Windows 8", "Windows XP"], "Comments": "", "Content": ["Some of these late movers have started to think about taking on the enormously high costs of extending XP support for the near term, and some have even evaluated the risks of moving forward for a period of time in an unsupported state on XP.", "These late movers find themselves far behind their peers in meeting a hard deadline,and it can appear to them that all of their options are either fraught with extreme costor extreme risk. And while it may be fair to view them as having reaped the consequencesof a failure to act earlier, this trailing group may actually have a benefit they can realizefrom their position.", "They have the ability to look at what their peers have done and not done; evaluate thoseorganizations successes and challenges; and craft a tight plan that actually puts themin a better cost position than the early movers, with a superior user experience andsatisfaction level to boot.", "An evaluation of the strategies that organizations have used to migrate from Windows XPto date and their associated costs, shows that the very best practice strategies have thetriple benefit of being a fastest route to a completed migration (and therefore offerthe prospect of actually achieving the deadline), the most user-friendly and likely todelight end users, as well as the most cost effective (sparing the trailing organizationsthe financial hit of having waited beyond the point where the majority of their peershave taken action).", "* Source: Forrester Research Inc. Forrsights Hardware Survey Q3 2013", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2014-04-03 00:00:00"}, {"Tags": ["Graduate Scheme", "Graduate Training Program", "Graduate Training Scheme"], "URL": "http://blogs.1e.com/2014/04/02/1e-graduate-training-scheme-an-update/", "Area": ["1E Careers", "1E Community", "1E Graduate Scheme"], "Comments": "", "Content": ["As the guys move towards the end of their first three months with 1E, I run a series of hands on sessions where I can assess their progress in an independent manner. These sessions are based on a hypothetical scenario around building a specific part of a HR application. We move through various phases from requirements analysis, elaborating on acceptance criteria, through to test cases design and identifying some defects.", "What I really like about these sessions is their interactive nature  its all about talking through their ideas as well as mine. I really enjoy exploring the impacts of, and alternatives to, their proposals and ideas. We work through the pros and cons, discussing why some ideas and approaches are better than others.", "From my point of view I can see how the training theyve been given, and the skills theyve developed, are being applied in practice. Is everyone engaging? Can they see patterns emerging? Do they grasp the pieces come together in terms of bigger picture thinking?", "Hopefully the graduates get to feel their views are valid, that its an open forum, and showcase their progress. Its really important to me that they enjoy the sessions and feel like they have gained something by participating.", "Congrats on progress to date  and passing the not insignificant 3 month milestone.", "Brendan Clarke | QA Manager"], "Author": ["Brendan Clarke"], "Date": "2014-04-02 00:00:00"}, {"Tags": ["BYOD", "Macs in the Enterprise"], "URL": "http://blogs.1e.com/2014/03/28/byod-would-you-wear-cheap-shoes/", "Area": ["1E Products", "BYOD / BYOPC"], "Comments": [{"Comment": "Funny how the most expensive laptop means youre important to your company, but the most expensive car means youre paid too much  is this because the BYOCar world has been around alot longer and thus perceptions change..", "Date": "2014-03-31 03:48:00", "Author": "Mark Lillywhite"}, {"Comment": "Not sure I agree that having a nice car means that you are overpaid. Although when company funded cars were popular in the nineties and early noughties, then yes, if you were important then typically you had a nicer car.", "Date": "2014-03-31 04:18:00", "Author": "Simon Rust"}], "Content": ["The actual purpose of this quote was around the driver for enabling Mac devices in the enterprise, although I happen to believe this goes far deeper than this relatively small use case. Clearly this hits home hard in the evolving land of BYOD where the user population do actually care about what tools they use to conduct their work and personal lives.", "Lets face it, if you feel good about something, then you generally are pretty successful with whatever it is, so the importance of having the right tool(s) for the job is somewhat critical for success. Those cheap plastic shoes are going to have you slipping around feeling uncomfortable, where the discomfort will cause irritation which will undoubtedly have a negative impact on your day, resulting in sub-optimal work. Worse still could be the mocking / ridiculing that your colleagues and customers may give you for wearing those shoes, knocking your confidence further. Funnily enough, I recall a few years ago having some shoes that I took on a business trip and my customer mocked the shoes reasonably significantly  those shoes did not come home with me from that trip and I vowed to never buy such shoes again  thankfully I had the choice and did not let it happen again  a real confidence knock thats for sure.", "Now, without question, that cheap plastic laptop referred to in the quote is going to have a very similar effect with your business acumen and desire to actually do well. Granted some of you out there just get on with it and dont blame the tools, but those who have the right shoes (and of course the right tools) have a definite advantage.", "Bottom line is, do you WANT the advantage to be able to make the deal that the other guy couldnt? Maybe it is time to change your shoes", "Simon Rust |Director, Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Simon Rust"], "Date": "2014-03-28 00:00:00"}, {"Tags": ["OSD Week"], "URL": "http://blogs.1e.com/2014/03/21/osd-week-mastering-windows-deployment-with-configmgr-2012-r2/", "Area": ["1E Partners", "Events", "OS Deployment", "Windows 7 Migration"], "Comments": "", "Content": ["There are two main technical factors with implementing a new Operating System across your enterprise: Ensuring you have an infrastructure that can support the migration process, and acquiring the expertise to upgrade your end user workstations with minimal effort. Of course, this transitions into the ever-present build or buy question. Regardless of the path an organization chooses to take when initiating an SOE upgrade, it is critical that internal resources be fully trained on the solution.", "In the past, it was simple enough to send the team on a Microsoft course or bring a trainer in to go through the product. Today however, organizations are reaping the benefits of third party solutions for core products, and have heavily customized environments. Learning the textbook method of a product like Configuration Manager does little more than form a baseline from which to start.", "By incorporating some quality tools, you see a reduction in server, operating, and support costs, while providing a familiar self-service portal to your end usersnot just for software requests, but to schedule their OS upgrade as well. Unfortunately, the only third party training typically offered to a team is during product implementation. When the time comes to plan the next SOE upgrade, technology has changed and possibly staff as well.", "During OSDWeek, Johan teaches you how to optimize your infrastructure to support the migration to Windows 7/8.1. He uses proven methodologies to help scale out Configuration Manager to meet your organizations needs, builds core concepts critical to creating a stable deployment solution, and introduces you to the possibilities in deployment automation. He guides you to building an OSD task sequence that supports multiple deployment scenarios, and teaches you how to optimize it for maximum success and performance.", "The entire week is jam-packed with real world scenarios, lessons learned, and best practices with building an Operating System Deployment Solution for your enterprise. Since a great car needs a great engine, architectural advice is also discussed throughout the five days. You come out of the course with a solid understanding of the inter-workings of a Configuration Manager environment that is optimized with ActiveEfficiency, and how to make OSD really shine.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2014-03-21 00:00:00"}, {"Tags": ["BAAF", "London Marathon"], "URL": "http://blogs.1e.com/2014/03/14/team-1e-to-tackle-london-marathon/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["Joining Sumir will be Will Edmondson, Chief Financial Officer and Nick Milne-Home, Chief Operating Officer and President of 1E North America. Will, who is running his 4th London Marathon, says I was only asked in February to run with Sumir & Nick so I am playing catch-up to get fit for the big day, however the opportunity to raise much-needed funds for BAAF, which 1E matches, and also to run as part of Team 1E was a challenge I could not refuse.", "Nick, 1Es Chief Operating Officer, and President of 1E North America, adds, I last ran the London Marathon 20 years ago and vowed never again! However, BAAF is such a great cause that I am delighted to put my running shoes back on and join Sumir and Will in this great fundraising effort.", "The trio are aiming to raise 15,000 for BAAF; 7,500 through donations which 1E will then match. Every child deserves a family and they work tirelessly to find forever families for children who can no longer live with their birth parents. Since 1980, they have transformed the lives of nearly 10,000 children and helped over a 1,000,000 people through our helplines.", "There are currently 91,000 children in care. 6,000 of them need to be adopted. Please support this amazing team generously so that BAAF can find more loving, safe and secure families for children who cannot be with their birth parents.", "Sumir, who finished the 2013 race in 4 hours 32 minutes, jokes I was hoping to set a personal best this year, but wearing a costume provides the perfect excuse to miss it!", "Thanks again for your support!", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2014-03-14 00:00:00"}, {"Tags": ["EndofDaysXP"], "URL": "http://blogs.1e.com/2014/03/11/windows-migration-endofdaysxp/", "Area": ["AppClarity", "NightWatchman", "Nomad", "OS Deployment", "Shopping", "Windows 7", "Windows 7 Migration", "Windows 8", "Windows XP"], "Comments": "", "Content": ["If your organization has yet to complete its migration to Windows 7 or 8, then April 8, 2014 ought to be in your diary in block red letters.", "http://youtu.be/cBLULiXYJsA", "And its not only fantastic software tools that we have to offer: 1Es consulting arms provides our clients with expert guidance from those who have had years of experience in Windows Migrations, meaning you can approach an OS deployment with confidence.", "Speak to 1E and take the smart, fast, automated route off XP, and witness true zero-touch migration in record times, at unbeatable costs.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2014-03-11 00:00:00"}, {"Tags": ["Graduate Diary", "Graduate Scheme", "Graduate Training Program", "Graduate Training Scheme"], "URL": "http://blogs.1e.com/2014/03/03/graduate-diary-2014-1/", "Area": ["1E Careers", "1E Community", "1E Graduate Scheme"], "Comments": "", "Content": ["Prior to the graduate day at 1E, we had all visited the webpage, and learned a little about the companys products and their offering. 1Es core values are posted on the website, and we wondered whether theyd show through on the day.", "Initially we met in the companys games room which put us at ease. We each introduced ourselves and talked about our backgrounds. This felt more like a conversation, instead of a presentation, which allowed us to learn more about the day and 1E itself.", "Next we moved into the lab and went through a few coding exercises. We were mentored through the process by some engineering staff, who were both talented and friendly.", "The recruitment panel knew exactly what they wanted, but were very interested in discovering what qualities we had, hence, the day was centered on activities which attempted to match the personalities of each of us with the core values of 1E. It felt strange compared to other interviews which sometimes target the weakness of the interviewee. Another thing that stood out clearly during the process was that just being an expert in the subject matter wouldnt be enough to win the panel over. They wanted to see what else we had to offer, apart from our technical ability.", "We also got a chance to meet the graduates from the year before during the lunch hour. They were really welcoming and they encouraged us to participate, giving us tips as to how to successfully progress to the next stage.", "The group exercise in the afternoon was informative and gave us an insight into 1Es focus on quality and robustness. The interactive nature of the exercise allowed us to get to know the other candidates better. This was followed by a tour of the departments."], "Author": ["Ravi Acharya", "Kanthiraj Thiyagarajah", "Winta Zibello"], "Date": "2014-03-03 00:00:00"}, {"Tags": ["SaaS"], "URL": "http://blogs.1e.com/2014/02/26/the-future-of-sam/", "Area": ["Software Asset Management"], "Comments": "", "Content": ["At a glance, the prospect of a long-term career in SAM might see one reaching for a university prospectus, but before everyone throws themselves head-long into a path of re-education, it might be worth considering some current aspects to the topic:", "Rory Canavan | Director, ITAM Services", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Rory Canavan"], "Date": "2014-02-26 00:00:00"}, {"Tags": ["Collaboration", "Customer Development Engineering", "Early Adopter Program", "Lean Startup"], "URL": "http://blogs.1e.com/2014/02/20/customer-development-engineering/", "Area": ["1E Customers", "ActiveEfficiency", "AppClarity"], "Comments": "", "Content": ["We, at 1E, place customers at the heart of our innovation, and take pride in delighting them with wonderful and relevant technology. Listening to customers and their success stories is increasingly important to us, as is working and collaborating with them closely. I am Gokul Raju, and would like to take this opportunity to describe the ways in which we work and learn with our customers, andespecially Customer Development Engineering.", "Engineering at 1E is not just about creating wonderful products that solve complex problems, but also about creating maximum value for our customers. As an engineering function, we place agility at the core of our development processes. Likewise as a Product organisation, a term we increasingly like to use is the Lean Startup philosophy which talks about creating MVP (Minimum Viable Products) by placing Validated Learning at the heart of its approach.", "The marriage of these two philosophies creates what we call Customer Development Engineering (CDE)  an area I have had some experience of while working at 1E. We often hear technologists say: Why dont customers just tell us what they want and well build it for them. The danger of doing this would risk creating bespoke solutions that lack mass enterprise appeal. Complexity in the real world is sometimes hidden away from the dungeons of a technology function, and CDE solves some of that pain but comes with its own set of challenges too.", "Talking and engaging with customers from the outset of an engineering cycle is not only a significant shift in mindset, but also a big shift from the perspective of engineering processes. Marrying the Build-Measure-Learn feedback loop with customers into an existing Agile process is a challenge. Imagine the process impact of a task as prototyping with a customer. Early Adopter or Joint Development programs give us a platform to engage with our customers on an end-user basis. You are not just talking to the people who could decide to buy the software youve written, you are also talking to the people who could use your software day in, day out. Gathering requirements from end-users reduces requirements churn and thereby creates a low-burn cycle. MVP (I prefer to call it Maximum Value Product with minimal effort) is not a judgment any more, but is closer to reality.", "It also brings increased opportunities for our customers to know the technology better and, get priority access to the cool technology we come up with. In turn, It helps us know our customers better, and provide a richer customer journey. Our customers love discovering tips and tricks about products they use, ones that could save them the effort of writing a script or a couple of hours of time. Greater communication and collaboration foster better points for innovation, and represent a great opportunity for customers to obtain maximum value from the end product.", "Get in touch with us if you want to learn more about Early Adopter or Joint Customer Development programs. I look forward to hearing from you.", "Gokul Raju |Senior Software Engineer", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Gokul Raju"], "Date": "2014-02-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2014/02/13/shopping-5-0-consumer-app-store/", "Area": ["1E Products", "Insidev1ew", "Shopping"], "Comments": "", "Content": ["The release was centered on a simple yet thought provoking vision of completely revolutionizing the overall user experience UX to make Shopping look, feel, and behave like a modern consumer App Store.", "For the technical team, this meant that the Shopping web application component was in for a technological upgrade. One area we worked hard on was updating all our web pages to use an industry standard MVC approach (MVC stands for Model-View-Controller and helps separate the business logic from the display control). The total embrace of MVC framework was a clear distinction that the team discussed at length. The MVC framework neatly instils single responsibility in your design. The benefits that developers reap by unit testing UI are not hidden. Additionally, the restful MVC clearly brings out the best in integration testing the overall product scenarios.", "On the User interface end, the developers led the implementation of the new UI with a nice blend of MVC, CSS and jQuery tools to dish out the improved look and feel of Shopping 5.0. The use of standardized HTML and CSS was key to enabling cross-browser support.", "One interesting series of conversations was around a particular behaviour in the new Shopping 5.0 UI. Each Application can appear as a tile which automatically flips when the user hovers over the tile with their mouse. There was differing feedback from groups who played with early versions of the UI  some loved the flip and some didnt. The flip ended up being customizable with a CSS switch. The application tile flip adds quite a prominent usability touch that looks modern, clearly moves on from version 4.7, but allowing organizations who dont like it to control it via CSS configuration", "On the architecture front, Shopping has also moved forward to integrate with the 1E ActiveEfficiency platform. This falls in line with the overall 1E product vision and allows Shopping 5.0 to take advantage of more common platform capabilities.", "Our development team has been privileged to work on this wonderful product and we are already working hard on a load of new features for the next release of Shopping. Stay tuned.", "Amar Kaldate | Technical Lead  QA", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Amar Kaldate"], "Date": "2014-02-13 00:00:00"}, {"Tags": ["Urban Renewal"], "URL": "http://blogs.1e.com/2014/02/06/1e-urban-renewal-corp/", "Area": ["1E Community", "Charity"], "Comments": [{"Comment": "Pingback: 1E supports Urban Renewal Corp with technology donations | PRIMAL Test", "Author": "1E supports Urban Renewal Corp with technology donations | PRIMAL Test"}, {"Comment": "Nice work here. There is one way out of poverty and that is education and training. 1E is helping a great organization accomplish this task.", "Date": "2014-02-12 12:28:00", "Author": "February 12, 2014 at 12:28 pm"}, {"Comment": "Thank you! I once learned that even the little things matter, and working with Urban Renewal we are doing a little thing to make a big difference!", "Date": "2014-02-18 02:55:00", "Author": "February 18, 2014 at 2:55 pm"}], "Content": ["We decided to work with Urban Renewal Corp for this exact purpose. They are taking items, whether working or not, and having collected them, if they are able to be used for education and life skills classes they will use them for that purpose. If not, Urban Renewal Corp also operates a recycling center that will responsibly dispose of the parts and items that cannot be reused.", "Our first donation was of 15 laptops, two printers, and three monitors, all of which can be put to good use instead of gathering dust on our shelves! 1E plans to continue donating what it can to this great cause moving forwards.", "We at 1E take tremendous pride in our community activity. We have a mission to give as much back to the world as we take from it, and it makes us happy that with our technology, we are able to give back in a full circle.", "Naaila Hossain | Internal Systems Administrator", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Naaila Hossain"], "Date": "2014-02-06 00:00:00"}, {"Tags": ["enterprise app store"], "URL": "http://blogs.1e.com/2014/02/03/shopping-5-0-enterprise-app-store/", "Area": ["1E News", "1E Products", "Shopping"], "Comments": "", "Content": ["Shopping 5.0 represents an enormous shift in enterprise IT delivery, blending, for the first time ever, the traditional rich functionality of an enterprise request portal, with the experience expected of a modern consumer app store. Version 5.0delivers a simple, modern interface which enables users to find and obtain the software and services that they need, when they need them, within their corporate IT environment in a way they now expect and are familiar with.", "Shopping provides a web portal that gives users the modern app store UI experience they are used to when obtaining new apps or services on their consumer devices like smartphones and tablets. Simple, attractive, easy to use.", "Consumerization of IT covers a number of topics, but one thing is clear: end users want enterprise IT to work in the same way that their consumer products do, and this extends to theirenterprise app store. Shopping makes that a reality today while also ensuring cost-savings for IT managers, says Sumir Karayi, CEO of 1E. It is simply the best way of making software and services available within an organization.", "Dave Harding, Senior Product Manager, adds Shopping allows any user to access a familiar feeling interface, through a standard web browser within their corporate desktop environment, and then browse for the software or services that they might need. This can include desktop applications, web-apps, virtualized apps, group privileges, and even hardware items. Where needed, approval workflows can be configured within Shopping to allow business managers to make decisions via actionable email notifications. There is no good reason an enterprise app store should lag behind its consumer cousins.", "Once any approval is complete, the requested software or services are delivered within minutes, just like users have come to expect from their consumer app store. Shopping does this through close integration with enterprise IT systems, including deep out-of-the-box integration with Microsoft System Center Configuration Manager 2007/ 2012 and ActiveDirectory. An open integration framework also allows for integration to any third-party provisioning or service-desk system.", "Shopping 5.0 provides individual pages for each application or service, with the ability for administrators to build in contextual information, images, and other materials that may be of interest to a user determining if they require the item  again replicating the capabilities of modern consumer app stores.", "IT administrators are able to promote and advertise new software and service capabilities to their end users avoiding both user disruption from forced mass-deployments and the lack of user adoption from relying purely on requests. A striking feature that aids this in Shopping 5.0s UI is the use ofbanners on the front page to show highlighted and featured apps or services.", "Another feature of this enterprise app store, is improvedgranularity than ever to the end user about the status of their requests. Whether waiting for approval, or in the process of being delivered by an enterprise systems management tool, their status is visible to the end user as well as being communicated through email notifications.", "Dave Harding | Senior Product Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Dave Harding"], "Date": "2014-02-03 00:00:00"}, {"Tags": ["British Liver Trust", "Love Your Liver"], "URL": "http://blogs.1e.com/2014/01/28/love-your-liver-1e-support-helps-deliver-results/", "Area": ["1E Community", "Charity"], "Comments": "", "Content": ["Earlier,Sumir Karayi, co-founder and CEO at 1E, said Were a social company and know all about playing hard, but of course its important to recognize that its not just heavy drinkers who are at risk of liver disease. We wanted to do what we could to help promote awareness of this issue, and the British Liver Trusts Love Your Liver roadshow is an excellent initiative.", "British Liver Trust is a registered charity 298858 in England and Wales, SC042140 in Scotland.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2014-01-28 00:00:00"}, {"Tags": ["IT Automation", "The Year of IT Automation"], "URL": "http://blogs.1e.com/2014/01/16/2014-the-year-of-it-automation/", "Area": ["Insidev1ew"], "Comments": "", "Content": ["With more than 24 million licenses across 1700 organizations of which many figure in the top 2000 global firms, 1E has found a number of trends  albeit anecdotal  that are common to many. Here are five of the most common trends weve noticed:", "1. The rise of mobile", "This is the first year that large companies are spending more money on mobile devices (including tablets) than they are on PCs.", "2. The growing adoption of cloud applications", "Cloud applications are increasingly being bought by individual departments rather than centrally. Weve seen this trend before, when PCs were first introduced. This behavior creates inconsistencies such that business units cant talk to each other with incompatible software, which means streamlining processes and automation is less possible  resulting in less agility and flexibility for the organization. Another consideration here is that the organization is not getting scalable benefits of corporate buying power, as they will likely be paying over the odds for the technology. Issues such as security and data leakage are also important to consider.", "3. Windows Migration", "4. Software Licenses", "Many companies have found that the cost of software licensing has increased yet again. This surge has occurred based on the fact that many vendors have changed their licensing rules, theyve increased pricing and have also been more aggressive in the number of audits they conduct. As a result, customers are suffering at a time where clearly costs shouldnt be rising.", "5. Energy", "While we dont have a magic wand to improve these massive trends that IT departments are not fighting or controlling, there are ways to free up money and resources to support new initiatives.", "For example, IT can reduce the spend on maintaining and upgrading existing infrastructure (hardware, software, manual labor) by using tools than can automate many of the tasks. Windows Migration is a perfect example of where computers are simply better than people at completing an entire migration task. Companies such as Google and Amazon have automated many processes, and IT should learn from such examples where they can see how automation scales in a way that people could never have imagined before. Through IT automation, weve seen a company complete their Windows Migration on 80,000 desktops in just three and a half months.", "In general in 2014, the Year ofIT Automation,IT organizations will need to become more efficient and spend more on what the business needs. Dont fight it, automate it.", "Sumir Karayi | CEO", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Sumir Karayi"], "Date": "2014-01-16 00:00:00"}, {"Tags": ["Graduate Scheme", "Graduate Training Program", "Graduate Training Scheme"], "URL": "http://blogs.1e.com/2014/01/15/1e-graduate-training-scheme/", "Area": ["1E Careers", "1E Community", "1E Graduate Scheme"], "Comments": [{"Comment": "Pingback: 1E Graduate Diary - part one1E Blogs  Insight and debate on IT Efficiency", "Author": "1E Graduate Diary - part one1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: 1E Graduate Training Scheme  An Update1E Blogs  Insight and debate on IT Efficiency", "Author": "1E Graduate Training Scheme  An Update1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: 1E Graduate Diary - part two1E Blogs  Insight and debate on IT Efficiency", "Author": "1E Graduate Diary - part two1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Though it might not seem obvious why, and perhaps even strange, but the Engineering Graduate Training Scheme isnt just targeted at Computer Science graduates. Rather it is about finding candidates oozing with potential who are bursting with eagerness to learn about all aspects of software development. Clearly they need some knowledge of computers and programming, but we want to help them develop. You dont have to be the most technically able candidate, just show your potential and an enthusiasm to learn.", "We take on up to three candidates annually and provide them with a flexible, personalized, training structure to develop a variety of skills required in software engineering. They get exposed to everything from quality assurance and automation techniques, through to software development and operational support.", "Initially candidates work alongside a mentor from the QA team and begin to understand how Agile Development works in a real world environment. Utilizing a proactive, hands-on approach we look for them to gain real world exposure as early as possible, assigning them to work on actual live projects and be treated as any other member of the Engineering Team.", "We endeavor to foster their talent and present opportunities to them to become brilliant. Its up to them to demonstrate their commitment, enthusiasm and ability  their progress throughout the Graduate Training Scheme is very much under their own control. As software engineering has many facets, we will always try and help them towards the path that they finally decides suits them most, be that as a Software Engineer or any of the other role in our engineering team. We aim to allow our candidates to develop to their full potential and become valuable members of the 1E Engineering Team.", "Ed Walsh, one of the 2012 intake, saysJoining the 1E Graduate Training Scheme has given me the chance to learn from extremely talented individuals, and in doing so has greatly improved my skill set and shown me how much more there is to learn past university. I truly enjoy working at 1E and feel that I have progressed extremely well in my professional career, not just through gains in technical knowledge but also through experience of working in an agile development environment and as part of an exceptionally talented team.", "Moyo Lawal, another of the initial intake in 2012, adds, After finishing university, it is fair to say I had no experience in the IT industry. The 1E Graduate Training Schemehas provided me with the right platform to advance in the IT industry. You get to learn from people that are greatly experienced in the fields they work in. There is also more to the Graduate Training Schemethan just work. You get the option to undertake any project of your choice, and play around with different technologies. The 1E Graduate Training Scheme is definitely an experience that will remain with me for life.", "Brendan Clarke | QA Manager"], "Author": ["Brendan Clarke"], "Date": "2014-01-15 00:00:00"}, {"Tags": ["SCCM 2012 R2 Support"], "URL": "http://blogs.1e.com/2014/01/13/1e-sccm-2012-r2-support/", "Area": ["1E News", "1E Products", "AppClarity", "NightWatchman", "Nomad", "SCCM", "Shopping", "WakeUp"], "Comments": "", "Content": ["AppClarity", "NightWatchman", "Nomad", "Shopping", "However, we recognize that because Shopping 5 has the exciting new UI, some of our customers happily on 4.7 will need to plan the migration a little more carefully than an incremental release. At the same time, we recognize the pressures to move to the latest Microsoft technologies. Therefore we have made the decision to extend support for SCCM 2012 R2 to Shopping 4.7 to help accommodate the transition. Testing on Shopping 4.7 will be complete by February 14th, though early indications suggest no breaking changes.", "Kind Regards,", "Geoff Collins | VP Technology", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Geoff Collins"], "Date": "2014-01-13 00:00:00"}, {"Tags": ["British Liver Trust", "Love Your Liver"], "URL": "http://blogs.1e.com/2014/01/08/love-your-liver-1e-to-support-british-liver-trust/", "Area": ["1E Community", "Charity"], "Comments": [{"Comment": "Pingback: Love Your Liver: 1E support for British Liver Trust helps deliver results | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Love Your Liver: 1E support for British Liver Trust helps deliver results | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["British Liver Trust is a registered charity 298858 in England and Wales, SC042140 in Scotland.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2014-01-08 00:00:00"}, {"Tags": ["EndofDaysXP"], "URL": "http://blogs.1e.com/2013/12/29/windows-xp-100-days-until-endofdaysxp/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration", "Windows 8", "Windows XP"], "Comments": "", "Content": ["100 days is not long to migrate a large organization if yours is among the estimated 30-40% that have yet to move fully off XP. Yet all is not lost.In fact, there are some big advantages to letting so many other companies migrate before you: theyve learned the hard lessons about large-scale application and OS migration, so you can swerve around the obstacles and hop over the pitfalls.", "So, with 100 days to go until #EndofDaysXP, the race is truly on. 1E can help you across the finish line, allowing you to get on with what you do best. Your business.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2013-12-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/12/27/shopping-and-appclarity/", "Area": ["1E Support", "AppClarity", "OS Deployment", "Shopping", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["But when the two separate products are integrated to work together, they provide an even richer feature set that amounts to an even more streamlined method for processing software requests and accountability.", "With the introduction of Shopping 4.0 in 2011, the self-service OSD feature was added. This feature meant that an end user could visit the Shopping website and request when to migrate their Windows XP machine to Windows 7 or Windows 8 at a time and date that suited them. The whole process is automated to the end user, including the reinstallation of applications that were present on Windows XP, and that were originally requested through Shopping.", "That feature was enhanced in later releases, and the current version of Shopping allows you to make use of the integration services available in AppClarity to automatically reinstall applications. A benefit of this is that machines can even reinstall software which wasnt originally obtained via Shopping.", "A normal OSD task sequence can be used with with additional steps where scripts make calls to the OSD API. Functions to assign machines to rulesets\\install Items\\and refresh the inventory are all available and can allow a streamlined migration.", "By using Shopping, an administrator can provide the freedom to end users of letting them pick when they want to carry out an OS migration. Administrators can also choose which applications should be installed on the new machine, and utilize AppMapping, which enables them to choose which applications in the XP environment should be replaced with another type. For example a newer version, or even different software which is better for the business. All this is possible because of the tight integration with AppClarity.", "The advantage of using Shopping and AppClarity integrated together is that a lot of the process becomes automated, which ultimately results in time and money savings.", "This solution is intended for deployment and configuration through 1E Professional Services.", "Deven Patel | Tier2 Support Engineer", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Deven Patel"], "Date": "2013-12-27 00:00:00"}, {"Tags": ["Software Asset Management", "software audit"], "URL": "http://blogs.1e.com/2013/12/19/software-asset-management-in-2014/", "Area": ["Insidev1ew", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["There is great appeal to software vendors to adopt this approach to software delivery; it still means the existing sales channel can be leveraged, whilst also sweating the assets of their software through metered billing. Additionally, the opportunity to pirate software will be vastly curtailed.", "2.More software vendor audits", "As if to follow up the last point about sweating assets; those companies that dont have cloud delivery as part of their mid-term strategy will realize that existing titles in the market need to make money  and so until most (if not all) software is cloud based, then expect software vendors to crank up the audit count to squeeze every last drop out of older titles.", "3.More cloud companies going into administration (and the associated pain)", "4.The first (public) outing of a cloud provider over-charging a client", "5.Software re-selling to be legally challenged in North America", "We have already seen two court cases in the EU (one against Oracle and one against SAP) uphold the principle that software can be re-sold without the express permission of the software vendor (subject to certain terms and conditions). The argument being made that it is anti-competitive behavior on behalf of the software vendors to write this into their licenses and contracts. I know how a good legal drama is enjoyed in the USA; so Im expecting a repeat case in the next 12 months", "All the more reason for software vendors to move their software to cloud-only offerings.", "Whatever else 2014 brings, I hope it is your year for happiness and prosperity.", "Rory Canavan | Director, ITAM Services", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Rory Canavan"], "Date": "2013-12-19 00:00:00"}, {"Tags": ["server management"], "URL": "http://blogs.1e.com/2013/12/17/life-of-a-configmgr-administrator-part-1/", "Area": ["ConfigMgr", "Data Center", "Server Power Management"], "Comments": [{"Comment": "Pingback: A Day in the Life of a ConfigMgr Administrator: Part 21E Blogs  Insight and debate on IT Efficiency", "Author": "A Day in the Life of a ConfigMgr Administrator: Part 21E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Point-of-View: from a ConfigMgr Administrator to his Manager, discussing how he/she spends their day managing a ConfigMgr environment.", "I had a real difficult time the other day trying to explain to my manager what I spent the entire day working on. Well one of our ConfigMgr Distribution Point servers had a heart-attack. This came out of the blue, it wasnt like it had been on life support or anything like that. In fact, it was only built up almost a year ago and had been operating perfectly fine since then. Typically when something breaks on a server, its because something recent has changed, and is usually (falsely) blamed on security or application updates  a reboot usually remedies the problem. Well, I tried that, and it didnt work. Grrrrr", "Just like a Microsoft Knowledge Base article, lets describe the problem first", "A new application request came into the team which was packaged up and imported into ConfigMgr. It was distributed to our three staging DPs in order to complete the required Support and User Acceptance Testing. Fast forward almost four weeks, and we now had sign off from the business to deploy ApplicationA. I assigned and distributed the content to all production DPs. The next day I was reminded by Outlook that I needed to check the Distribution Status reports and doing so I had discovered that the content had only successfully distributed to 28 out of 36 servers. This isnt peculiar  in fact this is more common than you may know!", "Reviewing the messages within each of the reports I was able to discover the following:", "Ive seen lots of seemingly random issues with healthy DPs. The resolutions range from restarting the Content Distribution Manager component, having to delete transferred temp files, editing the database, removing files from SCCMContentLib, to simply restarting the ConfigMgr services, or worst case scenario completely restarting the server! And this all takes time, my time! And then there are problems that re-occur, for example, IIS Content Filtering mis-configuration. Set it once and forget about it, right? If IIS is ever re-installed, you may need to re-configure IIS Content Filtering, again.", "This was just one package, ONE package! And all up it took one day to monitor and resolve the distribution problem of ONE package. We distribute lots of content every day so the possibility of this happening time and time again is very high, like several times a month! Keeping ConfigMgr Distribution Points healthy requires some effort. Ive only got 140 DP servers in this ConfigMgr environment, and thats already a headache. Imagine if I had 400, or even 4,000 DPs! There must be another way", "Brent Hunter |EMEA Solutions Engineer", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Brent Hunter"], "Date": "2013-12-17 00:00:00"}, {"Tags": ["Adobe", "ITAM Review"], "URL": "http://blogs.1e.com/2013/12/10/1e-appclarity-for-your-adobe-pains/", "Area": ["1E News", "AppClarity", "IT Asset Management", "Software Asset Management"], "Comments": "", "Content": ["I particularly like the quote 1E have done a great job in taking an action-oriented approach to SAM since entering the market in 2011. It really sums up what were about  not just showing stuff, but acting on it andachieving results. This is illustrated in a recent case study where a 13,000 seat company was audited by Adobe, immediately cleaned up their unusedsoftwareusing 1E solutions, including AppClarity, and ended up being declared aModel Citizen at the end of the audit.", "Cheers,", "Geoff Collins | VP Technology", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Geoff Collins"], "Date": "2013-12-10 00:00:00"}, {"Tags": ["Application Mapping"], "URL": "http://blogs.1e.com/2013/12/03/application-mapping-windows-migrations/", "Area": ["AppClarity", "Nomad", "OS Deployment", "Shopping", "Software Asset Management", "Windows 7 Migration"], "Comments": "", "Content": ["With the deadline of end of Microsoft Windows XP extended support approaching (April 2014), one 1E client realized it needed a robust solution to deliver its Windows 7 migration. At the same time it wanted to rationalize and standardize versions of all applications used across its 12,000-seat estate in 70 locations as well as remove any software that was not being used.", "Using 1E solutions combined with Services from 1E consultants, the company was able to successfully migrate its entire estate to Microsoft Windows 7 in a few months. Users automatically got back only the applications they needed (based on their individual usage) in rationalized and updated versions resulting in satisfied users and reduced license costs.", "The timescales were beginning to matter especially as the company wanted to take advantage of the Operating System deployment opportunity to rationalize the number of software licenses as well as standardize application versions for users.", "With 12,000 users across 70 locations the company needed an automated zero-touch solution that could handle the OSD and ensure users have the new Windows 7 image and the applications they need as well as remove those that they are not using.", "1E came to us with an Application Mapping solution which leveraged AppClarity and Shopping along with some customization for our environment to complete the task.", "The ability for the company to be able to systematically rationalize applications using AppClarity was very important. AppClarity sits next to ConfigMgr which has a very rich data collection in relation to software, including software inventory, add/ remove programs, asset intelligence, software metering and similar data. It is a complex and laborious process to manually try to reconcile all that data into actionable information, even for a small subset of software. AppClaritys automated analysis and its extensive software catalogue normalize ConfigMgrs data, so administrators can easily see what software is installed as well as how it is categorized according to usage. This way all the application migration activities can focus on the applications that are most important to the organization.", "What we ended up with as core applications are the unlicensed apps like free Adobe Suite tools and the Office viewers. It was the licensed applications which were primarily the mapped applications that are not on every desktop.", "All this automation around the application side marries the automation that Nomad has enabled for zero-touch deployment of Windows 7. The company has been able to roll out an average of 300/ 400 deployments per week with the BAU team.", "We have found that its between 80/ 100 deployments per site with a 1-2% bypass rate where we need to deploy specific hardware that we cant find Windows 7 support for. We completed the migration for our entire estate in a matter of months. Without Nomad, AppClarity, Shopping, the Application Rationalization and Mapping functionality we would be nowhere near finishing the project.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2013-12-03 00:00:00"}, {"Tags": ["device collection"], "URL": "http://blogs.1e.com/2013/11/28/how-to-add-computers-listed-in-a-text-file-to-a-device-collection/", "Area": ["ConfigMgr", "Insidev1ew"], "Comments": "", "Content": ["In this post, since we will be reading a list of computers from a text file,we will usethedirect membership rule cmdlet Add-CMDeviceCollectionMembershipRule to add them to the device collection. Using this cmdlet, you can add a device resource object to one or more device collections. Since collection names are unique in CM 12, it is easiest to reference the collection that you want to add objects to using the -CollectionName parameter. For the device that we are trying to add, the easiest way is to get the resource ID and use the -ResourceId parameter. We can get the resource ID of a device called PC01 using the Get-CMDevice cmdlet.", "Mike Terrill | Systems Management Practice Lead", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Mike Terrill"], "Date": "2013-11-28 00:00:00"}, {"Tags": ["platform support", "Third Party platform support"], "URL": "http://blogs.1e.com/2013/11/26/platform-support/", "Area": ["1E Support", "IT Asset Management", "Software Asset Management"], "Comments": [{"Comment": "Pingback: 1E Products and Microsoft SCCM 2012 R2 Support1E Blogs  Insight and debate on IT Efficiency", "Author": "1E Products and Microsoft SCCM 2012 R2 Support1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Do you support Windows 8.1? or When will you support SCCM 2012 R2?.", "The answer is different, depending on the sort of customer you are. There are three main groups of people when it comes to this answer.", "We offer these three different levels of platform support, because everyones expectations are different. Working with some of the worlds largest organizations has taught us that enterprise software is always more complex than you think  you cant just do a couple of days test and slap a certified logo on it and yet some people like to see it ASAP. Were offering options for whichever end of the spectrum you are on.", "Kind Regards", "Geoff Collins | VP Technology", "P.S Theres another group called customer sponsor, where we work directly with a customer from the inception through to release, showcasing it as we go through the development. Sometimes these are customer funded features, sometimes these are general items, that a customer is really keen to work with us on. Were always open to conversations  please reach out.", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Geoff Collins"], "Date": "2013-11-26 00:00:00"}, {"Tags": ["Ealing Equality Council"], "URL": "http://blogs.1e.com/2013/11/21/ealing-equality-council/", "Area": ["1E Community", "Charity"], "Comments": "", "Content": ["The Ealing Equality Council offers free legal advice, community advice, and hate crime support to local residents. As a charity it relies on generous donations, which allow it to employ two full-time and two part-time staff, and is supported by a large pool of volunteers throughout the week, and at drop-in clinics every other Saturday. As Ealing lacks a Citizens Advice Bureau, EEC is the areas premier source of free legal advice to residents.", "An average day  if such a thing exists!  will involve speaking with around 15 clients, either by telephone or face-to-face. Around half of those have issues that can be resolved there and then, the other half will have cases that are a bit more complex, and require repeat visits, says Barbara.", "I advise on a wide range of issues, such as benefits and welfare, housing issues including evictions and rogue landlords, and some immigration cases. As we dont turn anyone away, we do come across illegal immigrants, trafficked people and undocumented British people.", "There is a constant flow of information between our volunteers, and we talk a lot, as it is important we communicate effectively with each other to remain informed about changes, client communication, and so on.", "Our work is about levelling the playing field. Our society is skewed against the powerless and the poor. Sadly, we are ever busier due to the closure of other local resources as a result of Government cutbacks, and the lack of availability of affordable rented accommodation.", "In addition to their client facing work, EEC is heavily involved in the debate at a higher policy level, through seminars, policy work, and meeting with officials. Recently, to mark Hate Crime Awareness Week, Londons Deputy Mayor Stephen Greenhalgh, of the Mayors Office for Policing and Crime, met two EEC clients. The event was a big success, with Borough Commander of Hounslow, deputy leader of the council, and the director of EEC also in attendance.", "With its historic roots in promoting racial equality, EEC believe it is vitally important to offer a service which meets the specific needs of different hate crime victims: victims of race hate crime, faith hate crime, homophobic or transphobic attacks, and those targeted because of their disability, learning disability or mental health issues (a growing national issue of concern). For this reason EEC are partners in the Hounslow Hate Crime Support Service, which aims to provide support to individuals who feel they have been the target of hate crime, and raising awareness and increasing prevention ofhate crime within the community.", "As well as Barbara, other 1E staff have gotten involved with EEC; for example Andrew French lent his expertise with IT, whilst Kapil Batra and his team helped build the organisation a new website. Further to that, last year 1E was delighted to provide a 10,000 donation.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2013-11-21 00:00:00"}, {"Tags": ["Proof of Entitlement"], "URL": "http://blogs.1e.com/2013/11/19/what-constitutes-proof-of-entitlement/", "Area": ["Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Proof of entitlement is the necessary evidence a software vendor requires of a client to demonstrate their rights to install and use software.", "Suitably ambiguous for you?! Perhaps so, however if you think of the number of software vendors you deal with, each one will ask for different items depending on the software title in question. Some typical examples of evidence might include:", "This list is not exhaustive, so check with your supplier/software vendor as to what evidence should be required; Proof of entitlementcould even vary within one software vendors portfolio if their product set is wide enough.", "Rory Canavan | Director, ITAM Services", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Rory Canavan"], "Date": "2013-11-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/11/15/migrating-to-windows-7-why-are-large-organizations-so-slow/", "Area": ["Windows 7", "Windows 7 Migration", "Windows XP"], "Comments": [{"Comment": "Pingback: Windows XP: 100 Days Until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows XP: 100 Days Until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["We, at 1E, believe there are five major factors which prevent IT from staying current in terms of the Operating System, and many other technologies. I discuss each factor in a two-part article series for The Huffington Post, and suggest potential alternatives. Our understanding comes from the work we have done with more than 1500 organizations over the last 15 years, with a good deal of expertise in helping large firms migrating to Windows 7.", "Having spent time talking to some of the largest organizations, there is an overwhelming need for enduring value from investments in IT itself. If this is established as a goal, then the technologies, skills and processes developed for OS migration can be applied to achieve a constant state of readiness; a state in which virtually any change can be implemented across the Windows estate rapidly and with minimal cost. That way the next time the business wants change, IT is not holding it back.", "Sumir Karayi | CEO", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Sumir Karayi"], "Date": "2013-11-15 00:00:00"}, {"Tags": ["software vendor", "software vendor audit"], "URL": "http://blogs.1e.com/2013/11/12/three-reasons-why-a-software-vendor-may-come-knocking/", "Area": ["1E Consulting", "Software Asset Management"], "Comments": [{"Comment": "There is a 4th reason.. being reported under whistleblower and reward schemes.", "Date": "2013-11-13 11:49:00", "Author": "November 13, 2013 at 11:49 am"}, {"Comment": "Hey Rob,", "Date": "2013-11-13 01:25:00", "Author": "November 13, 2013 at 1:25 pm"}], "Content": ["So what three drivers can the lowly IT Manager watch out for to get his/her house in order?", "Merger/Demerger", "Audited by other Software Vendors", "The world of SAM is microscopic when compared to accounting, marketing or any other tranche of business you might care to mention. So if Vendor A has been knocking at your door and scored a sizeable settlement for an unkempt IT estate, word will get through the auditing community which could kick-start another vendor to come knocking.", "Massive Growth, but no increase in software spend", "Financial returns via the Inland Revenue/ IRS are matters of public record; a quick comparison of previous years returns compared to the latest financial year will determine that if vastly improved profits have not been proportionately matched by IT spend, then perhaps it might be time for an audit.", "These are just three flags that an IT Manager can potentially watch out for to prepare for software vendor audits. In the immortal words of Mr Miyagi, the best way to avoid a punch is not to be there.", "Rory Canavan | Director, ITAM Services", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Rory Canavan"], "Date": "2013-11-12 00:00:00"}, {"Tags": ["Warwick University scholarship"], "URL": "http://blogs.1e.com/2013/11/11/1e-launches-university-of-warwick-undergraduate-scholarship/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["1E has decided to invest in the future of a Warwick scholar by setting up an undergraduate scholarship. This award will provide vital support to a talented student who would struggle to finance their education otherwise. As part of the University of Warwick Undergraduate scholarshipprogramme, the University will provide additional social, cultural and professional opportunities to ensure a full and rich educational experience.", "Professor Christina Hughes, Pro-Vice Chancellor for Education at the University of Warwick, said: We are enormously grateful for the support of 1E and their commitment to students from low income families. It is essential that we continue to provide fair and open access for those wishing to enrich their lives through Higher Education and to do this we need help from our supporters and friends. 1Es contribution to the University of Warwick Undergraduate scholarshipprogramme will have a sizeable impact on a scholars life and future prospects and we are extremely appreciative of their generosity.", "1Es Founder, Sumir Karayi, is himself an alumnus of the University of Warwick and has remained supportive of the institution since his graduation. He said of the scholarship, Having been sponsored through Further Education myself, I have personal experience of what an incredible difference this sort of scholarship can make to a young persons life. Furthermore, through 1Es long-standing sponsorship of orphans in India, getting them in to education and supporting them right through to places at the University of Delhi, weve seen the fantastic opportunities education can offer young people, and wed delighted to be able to expand on that in the UK through the University of Warwick Undergraduate Scholarship.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2013-11-11 00:00:00"}, {"Tags": ["Zero-Touch Windows Migration"], "URL": "http://blogs.1e.com/2013/11/08/achieving-fully-automated-zero-touch-windows-migration/", "Area": ["1E Partners", "OS Deployment", "Windows 7", "Windows 7 Migration", "Windows 8", "Windows XP"], "Comments": [{"Comment": "Pingback: Windows Migration: Less than one month to go until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows Migration: Less than one month to go until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Windows XP: 100 Days Until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows XP: 100 Days Until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["The eBook comes as Microsofts April 2014 End of Support deadline for Windows XP approaches. Companies who havent upgraded to Windows 7 or 8.x by this date face significant security risks and other dangers, though many struggle to identify an efficient and cost-effective way to migrate their users. 1Es Zero Touch Migration enables late-mover organizations to not only complete their migration on time, but also as a Business-As-Usual activity, in the most cost-effective manner.", "This eBook provides practical insight into how IT teams can take a zero-touch approach to a Windows migration with minimal user frustration or business disruption. This revolutionary new approach eliminates the vast majority of manual work and costly desk-side visits, while drastically improving speed and user satisfaction.", "Together with 1E, for example, one organization was able to migrate 80,000 desktops, from Windows XP to Windows 7, in a little over three months, which we believe to be a record.", "The eBook, features hard lessons about large-scale application and OS migrations to enable IT teams to avoid obstacles and pitfalls, and will serve as a regular reference guide for companies looking for a solution to this looming issue.", "Highlights from the Zero-Touch Windows Migration eBook include:", "Su Kent | Corporate Marketing Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Su Kent"], "Date": "2013-11-08 00:00:00"}, {"Tags": ["BAAF"], "URL": "http://blogs.1e.com/2013/11/06/baaf-adoption-supporter-of-the-year/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["The award was given to Sumir for his personal commitment to adoption  which goes beyond even that of the corporate support from 1E. Since 2005, Sumir has been incredibly pro-active in encouraging 1Es staff to get involved with fundraising for BAAF, as well as funding some of BAAFs research and education programmes through his own means.", "Sumir is a passionate believer in philanthropy and charitable giving  and is a man who leads by example. Over the years, he has taken on challenges as diverse as the London Marathon and eating blazing hot chicken wings in the Viper Chilli Challenge, all in the name of raising vital funds for BAAF.", "Alan Wood, BAAFs Deputy Chief Executive, said The National Adoption Week Awards are a great opportunity to recognise all the fantastic work being carried out by adoption social workers and their agencies throughout the UK and to thank everyone who supports adoption and BAAF.", "Sumir Karayi said of receiving the award, My support for this excellent cause is aboutturning around the negative statistics whereby only two per cent of children in state care go on to further education versus 50 per cent of kids that are in a family. A disproportionate number of those in state care end up in prison so it just makes sense if we can contribute to get children out of state care.Its been great fun fundraising on behalf of BAAF, but I couldnt have done so without the support of my wonderful family or colleagues.", "Matt Lewis | Digital Marketing Program Manager"], "Author": ["Matt Lewis"], "Date": "2013-11-06 00:00:00"}, {"Tags": ["Nomad 2012 v5.2", "Peer Backup Assistant"], "URL": "http://blogs.1e.com/2013/11/04/enhancedpba-nomad-2012/", "Area": ["1E Products", "Insidev1ew", "Nomad"], "Comments": "", "Content": ["You may know that Peer Backup Assistant does essentially what it says, backing up data to peer clients. Thats especially useful for operating system deployments when you cant save the USMT data on the disk of the computer that is being built or upgraded and you dont want to invest in State Migration Points. My favorite v5.2 enhancement is that weve expanded PBA by taking advantage of a popular Nomad v5.0 feature: Single Site Download (SSD). If you happen to have a large location with multiple network subnets at the end of a slow WAN link, such as a building in a distant country, SSD can be very handy. Nomad does a single smart download of your ConfigMgr package to the building and then thanks to SSD that copy can be shared amongst the multiple subnets. And the definition of that location (site, but not to be confused with a ConfigMgr site) is easily set and thus easily maintained as the buildings network changes over time.", "With v5.2 we can now use the functionality underlying SSD with PBA. So when your OSD task sequence backs up the computers state and user data to the peers, those peers can be on multiple subnets. You just specify the maximum and minimum number of peers you want the USMT data to go to. If you specify more than are on the current subnet, the other subnets will be contacted. You dont even have to worry about adding delay toyour task sequence because the first peer to back up your data is actually the one that pushes the extra copies to other peers, so your OSD task sequence can continue while this is happening.", "I should also note that while PBA could backup to two peers prior to 5.2, you can now back up to as many as seven peers. That should be enough redundancy for anyone!", "So what were my task sequence updates? When Im testing I try to keep things as simple as possible so that I can focus on the functionality Im working on. With PBA that means I had one task sequence to do the backup and another to do the restore. Of course Im already using SSD in my main lab. So when I upgraded my Nomad clients to v5.2 I set a flag to let them use the single site functionality with PBA and I just added one step to my backup task sequence to backup to multiple clients. Heres how I did it:", "See the Nomad documentation for complete details, as always. But as you can see there were just two simple changes for me to make, given that I had Nomad, PBA, and SSD working in my lab already. Even if you dont have those, getting this working is not hard.", "With those settings in place I was able to backup data from all variety of clients to as many or as few peers as I like, including on multiple subnets. Backing up to multiple clients synchronouslytakes a little extra time but in fact most of the backup time is USMT processing, which has to happen anyway. And with the async option the backups dont have to delay the OS build task sequence. Restoring the data was the same as before but now there were multiple peers to choose from, sometimes on other subnets, in case any should happen to be unavailable.", "One thing that I did find important was that when I tested a backup I should then do the restore, which is what youll do in production. Repeating a bunch of backups in a row without restoring (or at least resetting) could cause a problem, and isnt a real-world process.", "Enjoy!", "Oh, and you might notice that this new version is v5.2 while the previous version was v5.0. So what happened to v5.1? v5.1 was a minor release between our quarterly release cycles and so we released it on a limited basis to those customers that needed its specific updates.", "Paul Thomsen |Associate Product Manager", "If you found this article useful, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Paul Thomsen"], "Date": "2013-11-04 00:00:00"}, {"Tags": ["Cyber Security", "Security Patches", "Windows XP extended support"], "URL": "http://blogs.1e.com/2013/10/31/end-of-windows-xp-extended-support/", "Area": ["IT Security", "OS Deployment", "Windows 7", "Windows 7 Migration", "Windows 8", "Windows XP"], "Comments": [{"Comment": "Pingback: Windows XP: 100 Days Until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows XP: 100 Days Until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Windows Migration: Less than one month to go until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows Migration: Less than one month to go until #EndofDaysXP1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Criminal hackers, as you might imagine, cant wait until April 8, 2014. Thats because most consumers are clueless about the true scope of security risks. And thousands of companies, for economic and operational reasons, appear intent on continuing to use XP machines well after Microsoft officially stops Windows XP support, which was launched in October 2001.XP has been a beloved Operating System for millions and millions of people around the world, but after 12 years of service it simply cant mitigate the threats were seeing modern-day attackers use, says Tim Rains, director of Microsoft Trustworthy Computing.", "So whilst the bad guys will continue to work to find ways to exploit Windows XP, Microsoft will stop fighting back. Without users being issued regular security patches for XP, cybercriminals can quickly move to take advantage.", "On the first Tuesday of each month, Microsoft issues new security patches for Windows 7 and 8. Roughly two thirds of malware developed for newer Windows platforms will also effect Windows XP. Therefore, each security patch issue will act as a signpost for hackers as to potential holes in Windows XPs security. Holes which Microsoft will not move to patch once Windows XP extended support comes to an end.", "Potential cyber attackers can take publicly available information about new problems identified with Windows 7 and test if the same issue also applies to Windows XP, says Sumir Karayi, CEO at IT Efficiency company 1E. With no more patches being made available by Microsoft following the end of Windows XP extended support, the XP Operating System will make an easy, and obvious, target for hackers.", "Microsoft itself is offering companies who choose not to sunset XP the opportunity to purchase Custom Windows XP Support in order to receive critical security updates and related technical support. Organizations considering it as an option best be prepared for eye-wateringly high costs though: Depending on the size of your estate, this could cost you anywhere from $200K for a smaller estate (of 25K PCs) to more than $2m for 100K PCs or more in just a year, and these costs are likely to DOUBLE over two years.", "Doing nothing is not an option: We have already had a glimpse into what happens when a Windows XP-based platform goes out of support. In the two years after Windows XP Service Pack 2 went out of support, its malware infection rate was 66 percent higher than Windows XP Service Pack 3  the last supported version of Windows XP, warns Tim Rains.", "Operating System migrations can be complex, time-consuming, and expensive, but they dont have to be. Automation eases the process for true zero-touch Operating System migrations. A software-based solution enables automated company-wide content distribution; application optimization, rationalization and mapping; user self-service without affecting your users productivity; and to top it all, with a business as usual team.", "[1] Source: Forrester Research Inc. Forrsights Hardware Survey Q3 2013", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Matt Lewis"], "Date": "2013-10-31 00:00:00"}, {"Tags": ["Nomad 2012 v5.2"], "URL": "http://blogs.1e.com/2013/10/30/whats-new-in-nomad-2012-v5-2/", "Area": ["1E News", "1E Products", "Nomad"], "Comments": "", "Content": ["This new release provides the following features:", "Peer Backup Assistant (PBA) allows Nomad 2012-enabled clients to act as equivalents to ConfigMgr State Migration Points. It rides on top of Nomads peer communication mechanism which is normally limited to the local subnet and would prevent neighboring subnets on the same site from being used for potential Nomad PBA stores. Single Site Peer Backup Assistant (SSPBA) uses single site capabilities, provided as part of the single-site download feature, to enable PBA data stores to reside not only on the local subnet but also on nearby subnets. This enables you to:", "Peer Backup Assistant (PBA) allows Nomad 2012-enabled clients to act as equivalents to ConfigMgr State Migration Points. High-Availability Peer Backup Assistant (HAPBA) ensures that USMT data is stored and made available on multiple machines during the migration process to minimize risk and maximize success. Implementing HAPBA enables you to:", "HAPBA is implemented using a custom task sequence action, Peer Backup Assistant: High Availability, and requires no configuration of the underlying Nomad system.", "Nomad supports Application Virtualization (App-V) applications which are deployed as streamed content by Configuration Manager 2012. Note thatNomad 2012 only handles App-V applications that use Configuration Manager as the App-V server. Nomad does not integrate with the standalone App-V server.", "Streaming is a way of providing an application to many enterprise users on a central server such that the vast majority of the App-V applications content is not downloaded until a user actually invokes the application for the first time, thus not wasting network bandwidth (and a users time) until the user needs the content. The icons etc. for the application appear on the users desktop, but the executable part of the application is held back until it is required.", "Nomad 2012 respects the Configuration Manager settings for fast and slow networks. For example, an App-V applications deployment type may specifyuse streamingfor a fast network butdo a full downloadin a slow network.", "Most Nomad customers will not have deployed version 5.1 so those changes are relevant too. Those include:", "Paul Parke | Head of Product Management", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Paul Parke"], "Date": "2013-10-30 00:00:00"}, {"Tags": ["Global Condition"], "URL": "http://blogs.1e.com/2013/10/25/using-global-conditions/", "Area": ["1E Products", "ConfigMgr", "Insidev1ew", "Nomad", "SCCM"], "Comments": "", "Content": ["Global Conditions are a new and powerful way to define requirements for AppModel Application installs BEFORE being made available to devices and users for installation.", "One such use-case is when deploying software or plug-ins that integrate with the ConfigMgr console. 1E Nomad AdminUI Extension integrates with the console -and in-fact -, the MSI installer will check to see if the console is installed on the computer before continuing with the install. The traditional method would be to create a dynamic collection of all computers which:", "Later, the created collection would be targeted with a deployment to install Nomad AdminUI application.", "In ConfigMgr 2012, the same goal to deploy Nomad AdminUI to all computers with the ConfigMgr console installed can be achieved using Global Conditions. The Global Condition defined as a requirement for the Nomad AdminUI application deployment type (e.g. Is ConfigMgr console installed?), simplifies targeting the desired computers to deploy the application to. Essentially, the administrative task no longer requires creating a collection with a complex query rule the targeting logic is all in the Global Condition!! The administrator can now target more generic collections to deploy the application like: All Workstations (Managed), All ConfigMgr Administrators, All Site Servers, etc you get the idea. Most likely, these type of generic collections will have simple membership rules, using either INCLUDE or EXCLUDE rules, or static memberships.", "To see this in action, heres how to create a Global Condition for identifying if the ConfigMgr console is installed and how to associate the Global Condition as a requirement for the Nomad AdminUI Extension application.", "This Global Condition  when referenced by the Nomad AdminUI Ext application as a requirement -, will check to see if the CM console is installed. If Global Condition detects that the console is installed, then the Nomad AdminUI Ext application will be presented for installation (e.g. of course how the deployment is configured will determine if the install will be mandatory or available).", "I created this because if you try to install Nomad AdminUI Ext without the CM console first being installed, the MSI will error-out with 1603 meaning the CM console was not installed. So the global condition makes sure the CM console is present before installing Nomad AdminUI Ext application.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Troy Martin | Principal Consultant", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Troy Martin"], "Date": "2013-10-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/10/18/aor-proving-realized-value/", "Area": ["1E Services and Analysis", "Analyze-Optimize-Realize", "IT Efficiency"], "Comments": "", "Content": ["Increasingly, CIOs are expected to reverse justify every major IT program and initiative. Project sponsors are regularly expected to show the realized results of their projects against the prospective business cases generated at the beginning of their initiative and explain differences. IT financial management experts and analysts regularly recommend this backward-looking analysis as part of best practice management.", "AORs goal is to ensure maximal business value realization for every 1E implementation, beginning with significantly more accurate pre-project business cases and cost analysis, continuing with maintaining focus on business value throughout the technical deployment, and regular customer reviews to continually drive realization past implementation. 1E works directly with clients year after year to quantify, verify, and maximize the savings achieved via 1Es ActiveEfficiency platform.", "This approach has already earned the respect of many blue-chip organizations around the world  withstanding close scrutiny to ensure that it is both accurate and financially conservative.", "The AOR methodology builds on the collective experience of hundreds of in-person interviews conducted by 1E business analysts and senior consultants. 1E has refined the models underlying the methodology over time to reflect the most accurate cost and business benefit picture generated by the ActiveEfficiency platform and to meet the requirements of CFOs in organizations reporting, communicating value, and making technology decisions.", "A key strength of our approach is that it focuses exclusively on bottom-line results. This isnt about theoretical savings  its all real  and the results accurately reflect the reality faced by decision makers when evaluating their IT environment and close the loop on justifying their investments.", "Nathaniel Martinez | Senior Analyst", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Nathaniel Martinez"], "Date": "2013-10-18 00:00:00"}, {"Tags": ["1E Support Portal"], "URL": "http://blogs.1e.com/2013/10/16/1e-support-be-efficient-use-the-portal/", "Area": ["1E Customers", "1E News", "1E Support"], "Comments": "", "Content": ["Therefore here in the 1E Support team we want to give you the tools to help you achieve this.", "If you are a 1E customer and have maintenance for any one of our Products then you have access to this Support Portal.", "The 1E Product documentation repository containing Installation and Administrator guides to our software is here, also you can download the latest versions of our software and appropriate hotfixes or maintenance releases.", "This also gives you access to a vast searchable Knowledge Base which includes a range of articles for each product. Explaining features, best practice, methods of implementation, configuration or upgrading.", "If you want to be kept up to date with the latest articles being produced then you can sign up to our RSS feeds, divided by product, so you only see the information that applies to you.", "If you dont find an answer to your question through the Knowledge Base then you can log a case directly through the Support Portal, update it and then track the case through to resolution.", "As part of any Support case you can also create an FTP account on our server so you can provide us with any additional logs or data.", "Remember the Support portal is now your first and best method to raise a Support incident.", "Rob Nichols | Escalation Engineer", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Robert Nichols"], "Date": "2013-10-16 00:00:00"}, {"Tags": ["International Standards Organisation", "ISO", "ISO 19770"], "URL": "http://blogs.1e.com/2013/10/15/iso-19770/", "Area": ["IT Security", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["I recently joined WG21 which is the working group within ISO (International Standards Organisation). The group has been working to create standards around the field of IT Asset Management. The group is comprised of a blend of software publishers, SAM tool vendors and consultants.", "Well standards can sound a bit dry, but these things really could improve the industry. Let me give a few examples:", "And one final point  Open is always better than closed. Pushing your vendors to commit to this philosophymeansintegration between products will be easier and data will be far more portable so changing providers will be much more simple.", "Some people might be daunted by the new stuff coming and might feel that they shouldnt invest before the complete product is finished Well I have two observations on this comment:", "If youd like to know more  please feel free to reach out to me.", "Geoff Collins | VP Technology", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Geoff Collins"], "Date": "2013-10-15 00:00:00"}, {"Tags": ["Customer savings"], "URL": "http://blogs.1e.com/2013/10/14/1e-customers-pass-2-billion-in-it-efficiency-savings/", "Area": ["1E Customers", "1E News", "1E Services and Analysis", "IT Efficiency"], "Comments": "", "Content": ["Our customers are forward thinking companies; outfits that recognize that IT waste is a crime, and want the tools to do something about it. Names such as Verizon Wireless, Dell, ING, Nestl, BNP Paribas, Ford Motor Company, the US Department of Veterans Affairs, and the UK Department of Work and Pensions, utilize 1Es industry-leading IT efficiency solutions every day.", "To date, our customers have made over $2.3 billion in efficiency savings (1.4 billion,1.7 billion). This includes $1.3 billion in energy costs alone and a reduction in CO2emissions of 11.5 milliontons. This represents an incredible saving of around half a billion dollars in the past twelve months alone!", "Our client feedback speaks for itself:", "We are building the worlds first ActiveEfficiency platform, which will allow us to empower our customers to make even larger savings, more quickly and easily than ever before. In the meantime, why not speak to us to find out how and where 1E can make real savings for your business?", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Matt Lewis"], "Date": "2013-10-14 00:00:00"}, {"Tags": ["Return on Investment analysis"], "URL": "http://blogs.1e.com/2013/10/10/return-on-investment-analysis/", "Area": ["1E Services and Analysis", "IT Efficiency"], "Comments": "", "Content": ["Some organizations require a Return on Investment (ROI) analysis because they have an internal hurdle rate that must be achieved before any new project will be considered. An ROI analysis provides an apples-to-apples comparison of an organizations investment options so it can compare seemingly different projects across various departments.", "Nathaniel Martinez | Senior Analyst", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Nathaniel Martinez"], "Date": "2013-10-10 00:00:00"}, {"Tags": ["Windows XP Danger Zone", "Windows XP Migration", "Windows XP Support"], "URL": "http://blogs.1e.com/2013/10/08/windows-xp-support-expiration/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration", "Windows XP"], "Comments": "", "Content": ["Its true that OS migrations can be complex but really you must not delay further, you need not be daunted. Automation eases the process for true zero-touch OS migrations.", "A software-based solution enables automated company-wide content distribution; application optimization, rationalization and mapping; user self-service without affecting your users productivity; and to top it all, with a business as usual team.", "Tick tick.", "[1] Source: Forrester Research Inc. Forrsights Hardware Survey Q3 2013", "[2] Source: IDC Mitigating Risk: Why Sticking with Windows XP Is a Bad Idea by Al Gillen Randy Perry Nancy Selig. May 2012. Sponsored by: Microsoft Corporation", "Su Kent | Corporate Marketing Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Su Kent"], "Date": "2013-10-08 00:00:00"}, {"Tags": ["sustainableIT"], "URL": "http://blogs.1e.com/2013/09/25/the-strength-of-nightwatchman-enterprise/", "Area": ["1E Partners", "NightWatchman", "PC Power Management"], "Comments": "", "Content": ["We have been a partner of 1Es for more than five years and during this time have implemented NightWatchman Enterprise at some fairly large and significant sites.", "Recently we undertook an exercise at one of the major corporates in South Africa in an effort to secure energy rebates from the local utility. South Africa operates within an energy constrained environment and the national utility has a monopoly in terms of energy supply. In an effort to reduce demand on the grid, the local utility is providing incentives to corporates to reduce energy consumption.", "The local rebate is quite unique in that it only kicks in, or is available, based on a load reduction of 50 KW which has to be achieved within the hours of 6am and 10pm at night during weekdays only. This is not to be confused with kWh, although the minimum kWh savings during this period would be 208000 kWh per annum.", "The client in question was also unique in that around 60 percentof workstations were shut down manually by the end users. Normally in South Africa we find between 10 and 15 percentof machines are manually shut down. This meant that the opportunity to lower energy usage was far reduced and we had to ensure that the solution provided the maximum savings possible on the 8500 workstations in question.", "After implementing NightWatchman and establishing a baseline of energy consumption for at least a calendar month, we were then in a position to start implementing policies and tracking changes. When we first did this we were in for a bit of a shock as the load reduction we were achieving was only 23 kW, far below the minimum savings we needed to achieve!", "This is when the power of NightWatchman Enterprise really kicked in, in particular the value of the reports and the feedback we were receiving from the solution.This feedback and information I might add just cannot be achieved with traditional systems management tools, which in this case was SCCM 2012 SP1. The level of reporting for the enterprise just simply is not there.", "After realizing we were not achieving savings the first thing we focused on was uncompleted shutdowns, or in this instance uncompleted standby. It immediately became clear that a significant percentage of the workstations did not support the sleep state, the NightWatchman report indicated as such. We initially thought this very odd as the hardware was all modern Dell and Lenovo but on investigation we realised that the VGA driver in some of the builds was in fact incorrect and hence preventing shutdowns.This was resolved with the build team.", "We also found that there was older hardware in the environment, still running Windows XP that would also not support sleep, again based on NightWatchman data. These machines have been targeted for refresh and successfully shutdown when a shutdown rather than standby policy is applied. Again, one of the powers of NightWatchman is allowing mixed policies across mixed sets of workstations.", "Next we moved on to sleepless processes, these are processes running on a workstation which essentially tell the machine not to go to sleep, despite what policies are in place. Many of these processes are redundant, superfluous and frankly wasting energy. On investigation we determined that there weremore than3000 sleepless events happening on a daily basis. These were events stopping machines from going into a sleep state. By utilizing the sleepless client detection functionality within NightWatchman, we were able to isolate these processes and ensure that machines successfully transitioned to a sleep state and reduced sleepless events to between 200 and 300 a day.", "The process we followed was an iterative one, but over a period ofthree to fourweeks we have seen dramatic results and the latest load reduction reports we have run show a minimum reduction of 52.8 kW, in excess of the minimum required to achieve the rebate. NightWatchman also provides us with all the data required by the energy utility reported in half hour intervals which reduces the ongoing reporting requirements of the client which is now literally a click of a button.", "I read an analyst report recently stating that the PC Power Management market was now limited due to inherent functionality within the Operating System and enhancements in system management tooling. This may be true in many instances but the reality is that in a complex enterprise environment we could not have achieved what we did without NightWatchmans reporting capabilities, and without a tool of this sort you may be leaving a significant amount of cost and energy on the table.", "Tim James | Director, sustainableIT", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Tim James"], "Date": "2013-09-25 00:00:00"}, {"Tags": ["1e", "software reclaim"], "URL": "http://blogs.1e.com/2013/09/23/savings-via-software-reclaim/", "Area": ["1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Why 1E leads the way in software reclaim", "Using 1E AppClarity, and working with the 1E Customer Advocacy team, the insurer was able to successfully identify more than $300,000 of cost savings through software reclaim in under two months and ensure license compliance. The IT Asset Management team now have a level of visibility of their software licensing situation across the organization in a way that couldnt be easier or quicker.", "By focusing on just a handful of applications in the first instance, the Director of IT Asset Management was able to detect and reclaim many unused installations to the value of $326,478 in less than two months.", "We gave users a detailed message, reminding them that unused software should be removed and gave them the choice to opt out of the software reclaim if they still needed it, he says. With the enterprise app store that is available via 1E Shopping, users are less resistant about removing software as they know they can reinstall it very quickly themselves if they need it later on.", "With the success of this project for desktop software, the asset management team is looking to replicate it for server software. The Director comments,We are looking at the new version of AppClarity for this, Im excited that visibility into server software is available. Its much more complex to see whats happening in the server environment and to analyze usage. I want to ensure that all our server software remains compliant and also to identify costly unused installations software and safely uninstall them.", "Through our deployment of AppClarity, and our excellent working relationship with 1E, we have made $326,478 in cost savings in just eight weeks through the identification and reclaim of unused software, he concludes.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left.", ""], "Author": ["Matt Lewis"], "Date": "2013-09-23 00:00:00"}, {"Tags": ["1e", "1E Community", "Charity fundraising", "Charity work"], "URL": "http://blogs.1e.com/2013/09/23/1e-bike-ms-city-to-shore-ride/", "Area": ["1E Community", "1E News", "Charity", "Events"], "Comments": "", "Content": ["Some of the 10 team members are keen cyclists, others like me have only just taken up cycling in the last few months, and others are hiring a bike on the day to do the ride! We all know of families and friends who are affected by Multiple Sclerosis (MS), and we are taking part in this fund-raising ride because it is a great cause. So far our team has raised over $5000 inBike MS: City to Shore Ride sponsorship,and the money raised will help fund critical research needed to end MS and to support the vital services the National Multiple Sclerosis Society provides.", "The R2R jerseys have arrived, and as you can see from the pic they look quite cool (as modeled by my son, Hugo). Nothing like an official team shirt to suddenly make a competition feel very real. Any spare jerseys will be available for sale and the proceeds will be added to our sponsorship monies and go to support the National MS Society.", "Also, we would like to send a HUGE thank you to David Rodes daughter, Mason, for designing the R2R jerseys. She did an awesome job and we couldnt have made this happen without her creativity and hard work. Thank you, Mason!", "For those slightly older members of 1E, the only serious cycling Id done until three months ago was 30 years ago on my cool 3-gear Chopper! Ive certainly never cycled 100 miles!", "Seriously, we do appreciate your support. MS is a disease of the central nervous system that usually strikes adults in the prime of their lives as they are starting their careers and raising families. Scientists are continuing to expand their understanding of multiple sclerosis, but theres still much work to be done for people with progressive forms of the disease. Currently, there are no medications approved for progressive MS, an advanced form of the disease for which there are no periods of remission.", "Nick Milne Home | COO and President, 1E North America"], "Author": ["Nick Milne-Home"], "Date": "2013-09-23 00:00:00"}, {"Tags": ["Windows XP Migration"], "URL": "http://blogs.1e.com/2013/09/23/mastering-windows-xp-migrations/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration", "Windows XP"], "Comments": [{"Comment": "Great article, one close to our hearts.  We are in the end user adoption space providing context sensitive performance support software for organisations using the new Office / Windows versions.  Some are very blas about the impact of migrations on productivity/efficiency, which they find out later on to their cost.  Sounds like you have a useful product.", "Date": "2013-10-01 01:43:00", "Author": "Stuart Summers"}], "Content": ["For years I had been windmilling my hands through the water and probably been rather splashy, and not very graceful or efficient in completing my lengths. Over the course of five days my stroke was broken down by the minutest of steps and then built back up again so that I became reasonably efficient through water. From the dry land sessions I discovered new patterns of movement and how to really flow through the water.", "Today I swim a kilometre in three minutes less than I did before, and have come to realize that it is never too late to learn to adapt to a new style having benefited from expert guidance and insight. I would never have been able to do that just by myself. Now, I can easily swim a mile, and its because Im efficient with my stroke and glide properly that its no biggie to swim greater distances as I dont tire by wasting energy.", "Windows XP Migration: Our expert consultants will help your OS Deployment go swimmingly", "They have found that theres no one solution fits all approach for Operating Systems (OS) deployments as the provision of OS and the delivery of business applications needs to be scalable and efficient as well as adapt to the changing ways in which people work. Many large companies have to operate across a complex infrastructure that covers multiple locations and work environments to deliver an IT platform that serves differing user needs and requirements.", "1E consultants help overcome the many challenges of a Windows XP migration (all the while meeting business and technical requirements) by using a structured approach to manage the life-cycle of the migration. This can be achieved using defined project phases with checks and balances to ensure that the migration project delivers what it set out to do.", "Jeff Wyrich, former technical director at JP Morgan responsible for global desktop configuration management says, The idea that you take the time to analyze the current configuration of your environment will ensure that only relevant products and services are migration improving the efficiency of the project. An OS migration project is the ideal time to leave behind legacy and unused software, and create best practice going forward to keep the environment clean, efficient and running as it should.", "The challenge with moving to Windows 7 is that few administrators have ever experienced such a complex migration, and as a result come across myriad issues  from application mapping to gotchas around device drivers  which they have never encountered before. They may think they are close to completion, but there will be many unknowns they havent anticipated which will impact timescales. They think they know what to do but they struggle against unexpected elements that impede progress. Its the inside knowledge from those experienced with Windows XP Migrations wholl know what to look out for which enables progress to be monitored against planned timescales, quality to be maintained, and the early resolution of issues.", "Typically our consultants find organizations already have basic Operating System build processes in place that can handle provisioning of bare metal computers with the corporate image. But during an Operating System migration (particularly XP to Window 7) the process is vastly more complex, issues like User Data Migration, Application Compatibility, language packs compatibility and refreshing of hardware are often overlooked until issues are found during the pilot phase of the project.", "Therefore its the inside knowledge from those experienced with Windows Migrations who know what to look out for which enables progress to be monitored against planned timescales, quality to be maintained and the early resolution of issues. 1E consulting engagements adhere to a project framework are targeted to reduce costs where possible. This is primarily achieved by increasing automation of the migration process to the maximum number of endpoints, thus, reducing the operational and administrative burden so that fewer manual tasks are required.", "1E consultants use their technical knowledge and experience to obtain requirements and identify areas where infrastructure, planned migration tasks and expected disruption can be reduced. Solutions are then designed and engineered using best practice tools and techniques i.e. ConfigMgr and MDT but also using 1E solutions to add further value.", "I thought I knew how to swim crawl, but I didnt really. There was a lot to finesse and change, and without the expert knowledge and insight Id have kept doing the same thing  the usual floundering. This really resonates for Jeff, You need to abandon this is the way its always been done mentality and be open to new standards, new processes and new tools.", "Now, you can throw me in the deep end and Ill do more than just stay afloat. Similarly you, with expert guidance from those who have had years of experience in Windows Migrations you can approach an OS deployment without feeling like youre drowning. Instead, with the right insight and experienced guidance, youll have an upgrade that goes swimmingly well.", "Su Kent | Corporate Marketing Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Su Kent"], "Date": "2013-09-23 00:00:00"}, {"Tags": ["BAAF"], "URL": "http://blogs.1e.com/2013/09/23/baaf-talk-like-a-pirate/", "Area": ["1E Community", "Charity"], "Comments": "", "Content": ["September 19th was International Talk Like a Pirate Day, and the crew of the good ship 1E couldnt pass up a chance to drink, plunder, and dress up, in the name of a worthy cause!", "Buccaneers, wenches, cabin boys and all manner of scurvy seadogs came in their nautical best in aid of the British Association of Adoption and Fostering (BAAF), a fine bunch o shipmates that 1E is always glad to swing some pieces of eight at.", "At the end of all the lootin, fightin and wenchin, near 200 (and a few doubloons) was raised for BAAF, enough to soften even the hardest pirates heart. Our thanks to all crewmates and landlubbers alike who parted with their loot!", "Here be what BAAF achieved last year with the help of shipmates like us!", "The amount the scurvy swine at 1E raised will pay for one of the following:", ""], "Author": ["Matt Lewis"], "Date": "2013-09-23 00:00:00"}, {"Tags": ["server management", "software vendor audit"], "URL": "http://blogs.1e.com/2013/09/13/software-vendor-audits-sasol-embarks-on-optimizing-software-licenses-on-servers-as-well-as-desktops/", "Area": ["1E Customers", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Last week I spoke with Cobie Nel, IM Services: Manager Applications for Sasol Group Services, based in South Africa, on the complexities and challenges that a software vendor audit can present when a vendor comes knocking on the door.", "She has recently been under scrutiny from Microsoft who decided to conduct a global audit across all Microsoft software residing on desktops and servers throughout the company.", "We are already a few months into our program of optimizing how software licenses are used and managed across the business. So far we have reclaimed more than 185,000 installations within just a few months of deploying 1E AppClarity covering 15,000 PCs and laptops; thats an average of 16 applications per user. We are now extending the installation across our regional offices in AsiaPac, North America, and Europe to get visibility on the total 22,000 desktops.", "We are in the midst of implementing the new functionality that AppClarity has to get visibility of usage of software on servers, and it has already helped us to uncover the extent of our SQL license position. Again the challenge is to fully understand the licensing model  per core or per processor  and again it really depends on the vendor and the product.", "Thanks to the server feature of AppClarity we have been able to discover what we have in terms of SQL Express, SQL Standard, and SQL Enterprise. This has given us all the relevant information to show Microsoft what we have and we were able to downgrade versions depending on the extent of functionality needed, and were able to bring down the count.", "Have you been able to get visibility of other vendor software on servers?", "So far we have only really scratched the surface of discovering what we have on all 1700 servers, but what information is being revealed is very promising. Now implementing the VMWare module, we can already see that we installed certain versions unnecessarily and can make instant savings on maintenance. AppClaritys Optimization Report is very good indeed; it gives us an immediate ability to understand the number of servers or processors needed  it shows that we can downgrade a number of licenses and we have been able to make saving on both the capital cost and software plus additional savings on maintenance.", "Was the implementation of AppClarity itself an issue?", "Su Kent | Corporate Marketing Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Su Kent"], "Date": "2013-09-13 00:00:00"}, {"Tags": ["Metropolitan Police", "public sector"], "URL": "http://blogs.1e.com/2013/09/05/it-efficiency-and-the-met-police/", "Area": ["IT Efficiency", "OS Deployment", "PC Power Management", "Software License Optimization", "Systems Management", "Windows 7 Migration"], "Comments": "", "Content": ["The report mentioned that one core system still in use today by the capitals police force is based on a 1970s baggage-handling system, while the Mets IT infrastructure consisted of more than 750 separate systems which had been pieced together over the last 40 years. Seventy per cent of the forces systems were labelled redundant in the report, with that number expected to increase to 90 per cent by 2015.", "To think that little is done to stop 212m ($330m) being so prodigiously wasted is probably due to the fact that in the past solutions were not available to ensure IT efficiency. Today, there are a number of tools and practices available that can identify IT waste, remove inefficiencies and optimize everything else. Sumir Karayi, CEO of 1E says, This flagrant waste of public money is completely avoidable. Now, solutions exist to realize a CIOs wish to streamline IT, reduce costs, remove unused IT assets and have a larger slice of budget available for spending on innovation.", "There are a number of quick and easy steps that can improve the efficiency of IT with the Met and boost the productivity of its 36,000 users.", "Furthermore, like some enterprises, many public institutions (including the Met) are still using Windows XP. In just over six months (April 2014), the deadline for extended support will expire and these organizations will expose themselves to grossly expensive custom support agreements, or risk possible security breaches (as there wont be any new updates or patches) not to mention that many applications will (and many already) no longer support old versions of the OS, nor do many hardware drivers.", "The Met tells us its changing. It wants to become a Force that is more efficient and better at what it does by improving access and processes. It should look to decommission ineffective IT and reclaim unused assets. By tackling the IT budget and driving down costs to enforce efficiency will facilitate the Mets transformation and set it on the path of becoming a model citizen. Now is the time to police its IT estate.", "Su Kent | Corporate Marketing Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Su Kent"], "Date": "2013-09-05 00:00:00"}, {"Tags": ["France", "Osiatis"], "URL": "http://blogs.1e.com/2013/09/04/1e-set-to-expand-its-activeefficiency-footprint-in-france-through-its-exclusive-partnership-with-osiatis/", "Area": ["1E News", "1E Partners", "ActiveEfficiency"], "Comments": "", "Content": ["1E believes Osiatis is the best positioned IT player in France to promote ActiveEffiency in the marketplace. Osiatis is a major IT player, which is deeply entrenched in its customers operations and IT strategy, and is currently managing 1.2 million desktops and 170,000 servers.", "Architects and consultants from Osiatis are constantly leveraging experience from the field to anticipate the concerns and expectations of IT Departments and Finance Departments, and are constantly exploring avenues to reduce costs in collaboration with its customers.", "In light of this, 1E Solutions, which make such projects extremely attractive to IT Management  through a very short sales cycle and a quick return on investment (between six and 10 months)  appeared a good fit. The close technology integration of 1E products with System Center Configuration Manager from Microsoft, another major partner of Osiatis, was seen as another key benefit of this partnership.", "Osiatis and 1Es joint approach to IT Efficiency is based on three pillars:", "Nathaniel Martinez | Senior Analyst", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Nathaniel Martinez"], "Date": "2013-09-04 00:00:00"}, {"Tags": ["1e", "1E Community", "Charity fundraising", "Charity work"], "URL": "http://blogs.1e.com/2013/08/28/charity-fundraising-on-your-bike/", "Area": ["1E Community", "1E News", "Charity"], "Comments": [{"Comment": "Pingback: Team 1E to take on Bike MS: City to Shore Ride1E Blogs  Insight and debate on IT Efficiency", "Author": "Team 1E to take on Bike MS: City to Shore Ride1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["It all started when I lost my father to cancer a few years back. It was a tough time and I wanted to do something, so I signed up to run the New York Half Marathon in 2012 on behalf of the American Cancer Society. A couple of colleagues expressed interest in joining me, and it snowballed from there. Before we knew it, a group of us from 1E had raised over $11,000, which the company matched.", "Before that though, Id started biking in February 2011, and my first Pedal to the Point with MCPC was in August of that year, a race I have participated in every year since then. Running in the NY half marathon with colleagues Nick and Ambareesh only became a reality after my Father died of cancer, and I was looking for a high profile race, where I could give back and raise some money for the fight against this hideous disease. I saw that there were available spaces on the American Cancer Society team in the NY Half, so I signed up. It was an amazing experience, and one I will never forget.", "Im good friends with MCPCs VP Sales, Andy Jones, and we were talking about his massive weight loss, and how cycling had changed his life. Soon after he talked me in to splashing out on a rather expensive bike. And having done that, I had extra motivation to make sure I used it! Over the past three years, Team MCPC has raised over $280,000 for Multiple Sclerosis, and hope to break the $500,000 barrier next year. I joined them on a ride, and stuck with it. Andy Jones has agreed in return to ride in our MS ride at the end of September.", "I have no personal connection to or experience of Multiple Sclerosis, but the charity has a great cycling program, and its very well organized. I ride in events such as these as its a great way to keep fit, foster relationships with our partners, and support a fantastic cause by raising lots of money on their behalf.", "Paul Szemerenyi, 1E Vice President of North American Channels, in charity fundraising gear", "Part of it is the desire to keep active, especially as I get older. Part of it is the enjoyment of overcoming the physical challenge. The real motivation though, especially with the cycling events, is seeing see men and women with MS competing with such passion and desire. This year, one of those guys came up to us and said thank you, and that topped all of the other reasons for taking part. Its really humbling, not to mention inspiring, to see that they arent letting their condition hold them back.", "Funnily enough, Ive been looking at taking up sprint triathlons! I live on the north shore of Long Island, so its ideal country for it. Watch this space", "Matt Lewis | Digital Marketing Program Manager", "Charity fundraising? On your bike!"], "Author": ["Matt Lewis"], "Date": "2013-08-28 00:00:00"}, {"Tags": ["1e", "Gartner ITAM", "it efficiency"], "URL": "http://blogs.1e.com/2013/08/28/1e-at-gartner-itam-2013/", "Area": ["Events", "IT Asset Management"], "Comments": "", "Content": ["1E at Gartner ITAM", "Its a fact of life that the IT vendor community has had the upper hand for decades  and the result has been serious IT over-spend, under-use and avoidable waste.", "1E helps IT departments fight back by identifying and removing the causes of overspend, so you can invest more in innovation and rise to the challenges of change.", "The 1E team will be fully represented, from Executive Management to Product Managers, meaning you will have direct access to some of the worlds foremost experts in SLO solutions.", "Not only that, but on the opening evening from our stand, we have a Sushi chef serving Japanese-inspired dishes, including classics such as sashimi and maki, with or without wasabi. So whether you love meat, fish or vegetables, spicy or sweet, come and tuck in.", "Were thoroughly looking forward to Gartner ITAM 2013, and we hope to see you there.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Matt Lewis"], "Date": "2013-08-28 00:00:00"}, {"Tags": ["1e", "Linux", "Linux Router"], "URL": "http://blogs.1e.com/2013/08/27/creating-a-low-resource-linux-router/", "Area": ["Insidev1ew", "IT Efficiency"], "Comments": "", "Content": ["I know several people who have set up personal lab environments to either use in their careers or to learn new technologies. More often than not it is a good idea to have multiple subnets in the lab to simulate real-world conditions. I was looking for a way to create the lowest resource router I could for my lab. Being a Linux user I decided that I would try to create a router using Debian Linux.", "I know that there are other ways to create a Linux router, but I figured I would post something on how I built the routers in the virtual lab environments on my laptop (using Oracles VirtualBox) and my home lab (using vmWare Vsphere 5.1). It was interesting to me to learn something different rather than just setting up a canned solution.", "Both Linux routers are using 64MB of RAM and about 1GB of disk space. I like having the infrastructure use minimal resources, leaving more for the real machines.", "When you build the VM, connect all of the NICs for the different subnets you want to use. Also, use at least 512MB of RAMduring the installation. Well change this later, but for now you want to get the install completed.Once the installation is doneyou can set up the routing configuration on the VM", "I know you can use vi to do all of the editing, but I chose to write this up using nano as the example. Also, keep in mind, Linux is case sensitive. The command Nano is not the same as the command nano.", "Edit the /etc/network/interfaces file (nano /etc/network/interfaces). The eth0 interface should be populated, but youll have to add the others. Add the auto eth# lines and the iface eth# inet static sections as shown below. Note that the IP addresses are all static.", "Shutdown the virtual machine, change the memory to 64MB, boot it up, and you now have a Linux router that uses minimal memory. I tried to use 32MB of memory, but the machine will not boot with less than 64MB.", "John DeVito | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["John DeVito"], "Date": "2013-08-27 00:00:00"}, {"Tags": ["1e", "BYOD", "BYOD / BYOPC", "Macs in the Enterprise"], "URL": "http://blogs.1e.com/2013/08/22/macs-in-the-enterprise/", "Area": ["BYOD / BYOPC", "MyWorkNow"], "Comments": "", "Content": ["Macs in the Enterprise", "Many employees have been using tablets and smartphones in the enterprise for a while and are now demanding to use their laptop of choice for work as well, and more often than not, users want to use Macs in the Enterprise.", "Apples approach to design and aesthetic has raised the bar to a new high. Since its launch, the iPhone has become the benchmark for the smartphone; this phenomenon has been mirrored for tablets with the iPad, now the global leader with more than a 50% global market share.", "Therefore its no surprise that the sleek MacBook Air and MacBook Pro laptops are much coveted items. They appeal deep in a users psyche, lending prestige (Ive got a shiny beautiful laptop and its nicer than yours) to people who care about the aesthetic. And in todays brand conscious society, which brands you use determines your currency of influence.", "Forcing users to continue on Windows XP for work is a source of frustration and although extended support for Windows XP is scheduled to come to an end in April 2014 many companies have taken a long time to upgrade their Operating System and some may have yet to do so.", "For IT the BYOPC problem lies in a number of areas:", "Many companies have experimented with Virtualization  (Server Hosted Virtual Desktops or SHVD). Reality shows there are many shortcomings, it doesnt work if you are not connected to the network, its a poor user experience, its expensive and it doesnt use the native power on the machine its running on. There are also issues surrounding software entitlements in a virtualized environment; different vendors have different rules around compliance.", "Unlike Server-Hosted VDI, Client Hosted Virtual Desktops (CHVD), utilize the native power of PCs and Apple Macs to deliver high-performing, personalized Windows desktops anytime, anywhere, that can be used online or offline. This enables enterprises to seamlessly introduce a Bring Your Own PC (BYOPC) program.", "There are many advantages over SHVD:", "IT departments using CHVD are seen to be enablers, giving users their choice of device for personal and business computing which improves user satisfaction and productivity as they gain the flexibility to work from wherever they are, at home or on the move and allowing users to run a secure, managed Windows desktop on a Mac.", "Paul Parke | Head of Product Management", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left.", ""], "Author": ["Paul Parke"], "Date": "2013-08-22 00:00:00"}, {"Tags": ["1e", "appclarity", "energy efficiency", "energy management", "green it", "nightwatchman", "nomad", "pc power management"], "URL": "http://blogs.1e.com/2013/08/21/energy-management-work-smart-and-become-smarter-at-efficiency/", "Area": ["AppClarity", "NightWatchman", "Nomad", "PC Power Management", "Server Efficiency"], "Comments": "", "Content": ["This data gives a company the ability to see the number of desks in each building (per floor/ subnet) that are being used or not, and will highlight deficiencies. It would be an extremely hard task to obtain any meaningful data if this was manually monitored due to home working, and the time it would take to collate this information every day.", "The ability to report on hardware utilization is an extremely useful strategic decision-making tool. It shows up trends on usage and Facilities and Property Management teams can look into using their office space smarter, by providing hot desks and using existing facilities more effectively, lower the energy footprint, and ultimately reduce costs for the business. Additionally it can be used to create power policies that are in tune with user behaviour.", "Ultimately, once you are armed with the right information and visibility into your hardware and software estate you can make a difference. Software that makes efficiencies, saves you money and reduces your environmental footprint must be a no-brainer.", "Su Kent | Corporate Marketing Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Su Kent"], "Date": "2013-08-21 00:00:00"}, {"Tags": ["1e", "appclarity", "true-up"], "URL": "http://blogs.1e.com/2013/08/15/how-to-avoid-paying-a-7-million-true-up-invoice/", "Area": ["AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Facing a substantial True-up invoice?", "Historically, software vendors built their financial success on the following iterative principle:", "1) Create a Killer App", "2) Reduce incremental costs, including cost of sales and distribution", "3) Sell in large quantities and possibly on a global scale.", "The upshot: software has become a strange beast, which can cost more in the future than at the time of purchase.", "That problem gets even more acute once the costs of underutilized software assets are factored in. Would anyone is his right mind acquire a family car, install it in the garage, never use it for a ride and still happily pay subsequently astronomical charges just because it is there? Even the most exclusive car collector gets to drive his cars at least to a car collector show once in a while.", "1) Software is by nature an intangible asset. It is not visible and can be difficult for business managers to apprehend (E.g. Why is a virtual desktop more expensive than a physical one?) Software has also a tendency to live for ever. And, as any Software Asset Manager would attest, software licensing can be tricky. For all these reasons, it is therefore important to have tools which make software instances and software usage visible on demand, so those assets can be properly managed in lines with the organizations actual use and limit any unnecessary liability exposure.", "To learn about software licence cost optimization, please listen to the following recordings:", "Alternatively, you can come and visit the 1E booth at the two upcoming Gartner events where we would be happy to discuss your software license optimization requirements, and help you avoid those true-up shocks.", "Nathaniel Martinez | Senior Analyst", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Nathaniel Martinez"], "Date": "2013-08-15 00:00:00"}, {"Tags": ["1e", "osd", "windows 7", "Windows Migrations", "windows xp"], "URL": "http://blogs.1e.com/2013/08/13/why-windows-migration-os-projects-dont-have-to-be-lengthy-and-inherently-inefficient/", "Area": ["1E Products", "OS Deployment", "Webinars", "Windows 7 Migration"], "Comments": "", "Content": ["After all, Windows migration is not rocket science and organizations around the globe have already been through a few PC OS migration rounds since the days of Windows 95.", "So why has Windows XP proven to be so resilient?", "Its because IT organizations perceive Windows migrations as a complex, time-consuming and manually-intensive program, which can get in the way of other business priorities. Complexity is compounded for large companies which operate across an intricate infrastructure that covers multiple locations and has to cater for multiple work environments (such as mobile workers, remote workers etc.", "Throughout numerous engagements, 1E consultants have identified three major hurdles in organizations initial approach to Windows migration, which make such projects more inefficient than necessary:", "1Es products and services address all these challenges. The 1E Solution for Windows Migration is proven to accelerate, automate and significant reduce costs for large scale Windows 7 migrations. 1Es approach is to extend and enhance Microsoft System Center Configuration Manager (ConfigMgr), as well as reduce and simplify its infrastructure and operational costs.", "To learn more about 1Es Approach to Windows migration, please register to the upcoming webinar:", "https://1e.webex.com/1e/onstage/g.php?t=a&d=706613375", "Nathaniel Martinez | Senior Analyst", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Nathaniel Martinez"], "Date": "2013-08-13 00:00:00"}, {"Tags": ["Compliance Baseline"], "URL": "http://blogs.1e.com/2013/08/09/how-to-fix-a-compliance-baseline-that-will-not-import-successfully/", "Area": ["ConfigMgr", "Insidev1ew", "SCCM"], "Comments": "", "Content": ["You have Compliance Items all set up in an environment, all added into a nice baseline that is deployed out to your estate and all is good in the world. You decide that you want to export the baseline into CAB file for any number of reasons. You want to send it to a buddy at another company so he can benefit from your excellent work. Or maybe you are a consultant who wants to save the good work you have done so that you can make it a part of the value you provide to your customers going forward. We all love reusable work. But what happens when your reusable work ends up being something less than reusable?", "Has anyone had difficulty importing a Compliance Baseline from a CAB file in ConfigMgr 2012? I just had that problem. It looked like this", "So I scratched my head. My first instinct was to do what we all do and consult with the All-Knowing Google on the matter. I searched The CI contains a missing or invalid CI reference. Two hits. Dont you love it when you look up a problem and find two hits? Well, hopefully if you are having this issue, this shows up as a third hit and is more helpful that the two I found. The suggestions I saw were to remove the configuration from the baseline being imported and try again.", "I figured there has to be an answer, and this is what I came up with to fix the issue I am having.", "I examined the Files in the exported CAB file and compared them to the contents of other exported Configuration Baseline CAB files I have used successfully. I noticed a difference, edited the XML files in the CAB, rebuilt the CAB, and import was then successful. Now for a three item baseline it might not be a big deal, but if you have a baseline with several failing items this just might be better than rebuilding all of the Configuration Items. Or perhaps you dont know what was in the original Configuration Items and cant recreate them. Either way, you may have a good reason for wanting to fix what you have rather than doing it over.", "I exported the contents of the CAB file into a temporary folder. The folder was named E:\\Source\\CabRebuild.", "First, the difference I had noticed was with the Operating Systems defined in the Configuration Items. The XML files in the failing import contained an Operands section that was populated as shown here", "I edited the Operands section in the XML files in E:\\Source\\CabRebuild as follows", "I did this for the XML that corresponded to each failingConfiguration Item.", "Step 1  Create the DDF file to configure the operation of MakeCab.exe. This is the definition of the structure of the CAB file.", "DDF FIle:", "In order to easily get the list of files you can grab a bare format directory listing and either grab the file names from the command prompt window or pipe them into a text file. Remember, if there are spaces in the path/filename you must enclose them in double quotes.", "I put my DDF file in the E:\\Source folder. Once the DDF file is complete you can make the CAB file. Its easy.", "Now that you have rebuilt the CAB you can import it into ConfigMgr.", "John DeVito | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["John DeVito"], "Date": "2013-08-09 00:00:00"}, {"Tags": ["1e", "operating system", "operating system migration", "os deployment", "os management", "osd", "OSD Week", "OSM"], "URL": "http://blogs.1e.com/2013/08/08/osd-week-early-bird/", "Area": ["Events", "OS Deployment"], "Comments": "", "Content": ["OSD Week", "It is an excellent opportunity to take a weeks training with two expert MVPs, Johan Arwidmark and Dave Kawula, who are well respected and have been contributing to the community for a long time.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Matt Lewis"], "Date": "2013-08-08 00:00:00"}, {"Tags": ["1e", "configmgr", "GPOs"], "URL": "http://blogs.1e.com/2013/08/02/ad-gpos-or-configmgr-2012-compliance-and-settings/", "Area": ["ConfigMgr", "Insidev1ew"], "Comments": "", "Content": ["The customer also had other settings in the base Windows installation that he had wanted to evaluate as well. He wanted to create a GPO which would make those settings. I thought that perhaps we could take the opportunity to create Configuration Items for the settings he wanted to control and deploy a Configuration Baseline to the target machines in order to evaluate the settings and remediate them if they were non-compliant.", "Why would someone want to do that instead of using a GPO? You wouldnt. I dont think this is an either/or scenario. You can use Compliance and Settings in ConfigMgr to enhance your GPO strategy. Let me explain.", "GPOs will work on any domain member machine. GPO is a great way to get configuration settings out to the machines in your domain. But there are two major problems with GPOs the way I see it.", "First, there is no real native solution for monitoring and reporting on GPO status across the environment. You basically put your GPO in place (hopefully after testing it!) and assume that it is applied across the board. If GPOs arent applied to some machines you really dont have a proactive way of knowing that there are problems. Im sure every IT person out there would much rather know about problems ahead of time. It stinks when your boss shows up deskside to tell you about an issue and your only response is Errrruhhhyeahuhhh. Much better to confidently say, Yup. I know. Already on it.. And that will only happen if you couldnt get it fixed before anyone noticed it.", "Second, There really isnt a good, centralized way of applying GPOs to machines that are not domain members. You basically have to edit the policy on each machine individually.", "If you have ConfigMgr 2012 you can use Compliance and Settings to address both of those issues. With ConfigMgr Compliance and settings you can centrally report on the success of evaluation and remediation of Configuration Items. You can also evaluate and remediate items on machines that are not domain members.", "So back to my questionWhy would someone want to use ConfigMgr Compliance and Settings instead of using a GPO?", "The answer was, you wouldnt. You use Compliance and Settings to supplement GPOs. The reason I said that is because, obviously, Compliance and Settings evaluation and remediation in ConfigMgr 2012 only applies to ConfigMgr clients. This will not work for machines which are not ConfigMgr clients, or problematic machines which do not have a working ConfigMgr client installed.", "So use your GPOs to make the settings on your domain member machines. Follow that upby deploying aConfiguration Baseline to check the machines and ensure that the settings are correct. If you have machines that the GPO is not applied on they will show up in reports of non-compliant machines.", "Make note of the fact that the Data Type for this registry value is specified as an Integer, while we mentioned above that it is a REG_DWORD value. There is no REG_DWORD type listed in the Data Type dropdown. Therefore, if you have a REG_DWORD you want to check select Integer and in the compliance check (shown below) enter the value as Decimal instead of entering the hexadecimal that appears in the registry.", "Next, you need to create a Compliance Baseline. Finally, after you have added the Configuration Item(s) you desire to the Baseline you need to deploy it", "Id like to close by visiting the topic of remediation. A ConfigMgr item can be configured to automatically remediate noncompliant settings (and dont forget, you have to set your Configuration Baseline deployments to allow remediation or the setting for remediation in the Configuration Items contained in the Baseline will not take effect). If you have your Compliance Items/Baseline Deployment set to remediate noncompliant items you really need to make sure that you are organized. Do not put yourself in the position where you have updated a setting in a GPO but then neglected to update the corresponding Configuration Item in ConfigMgr. If that happens, the GPO will make one setting and then when ConfigMgr evaluates the Configuration Item it will revert the setting back to the previous value. You might want to do something like naming your GPO and you Configuration Baseline similarly. Populate the Configuration Baseline with Configuration Items that correspond to each of the settings in the GPO, and name the Configuration Items so that they clearly identify the GPO setting you are checking.", "John DeVito | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["John DeVito"], "Date": "2013-08-02 00:00:00"}, {"Tags": ["1e", "1E Community", "BAAF", "Charity work"], "URL": "http://blogs.1e.com/2013/08/02/baaf-presented-with-cheque-by-1e-ceo/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["Marta said 1E and Sumir are fantastic supporters of BAAFs activities, and Im thrilled to accept this cheque on behalf of the charity.", "Sumir, who co-founded 1E in 1997, and completed what was his first Marathon in 04:32:22, said I want to contribute to helping disadvantaged children to a more stable and better future. A disproportionate number of those in state care end up in prison, whilst only two percent go on to further education, so it seemed best if we can contribute to get children out of state care.", "My goal for the Marathon was to finish the course, enjoy the run, and feel privileged to raise so much money for the charity. Im delighted to be able to hand over this cheque to such a worthy cause, and one that we will continue to support wholeheartedly.", "BAAF, the UKs leading adoption and fostering membership association, promotes the highest standards of practice in adoption, fostering and childcare services in social work, health, legal and other professional bodies on behalf of children separated from their birth families.The charityaims to increase public understanding of the issues and to act as an independent voice for children, informing and influencing policy-makers, all those responsible for children and young people and public opinion at large.", "In March this year, 1E was proud to achieve a two-star accreditation from the Best Companies Guide and a coveted position in The Sunday Times 100 Best Small Companies to Work For, where 1Eranked fifth for making a positive difference to the world, with 86 percent of staff agreeing with that statement. Eighty nine percent of employees believe the company has a strong social conscience and 72 percent agree that it encourages support for the community. Charity work is also part of the companys culture at 1E with 98 percent of employees stating they are encouraged to participate in charitable activities. Indeed, staff are allowed to takefive days of company time for voluntary projects every year.", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Matt Lewis"], "Date": "2013-08-02 00:00:00"}, {"Tags": ["1e", "operating system", "Operating System Deployment", "operating system migration", "osd", "OSD Week", "OSM"], "URL": "http://blogs.1e.com/2013/08/02/osd-week-are-you-ready/", "Area": ["Events", "OS Deployment"], "Comments": "", "Content": ["The class will require a basic understanding of Active Directory, WSUS and SQL as well as a basic understanding of Configuration Manager 2007/2012 or SMS 2003 although this is not a requirement.", "What does this class teach you?", "This class will take you through the design, installation and configuration of the Application and OSD features in Configuration Manager 2012 SP1. After the training you will have a solid understanding of ConfigMgr 2012 SP1 and be able to use and design and deploy Windows 7/8according to best practices.", "Who are the instructors?", "When and where is this training week?", "The event will be taking place in Calgary AB from Monday, November 4, 2013 at 8:00 AM to Friday, November 8 2013 at 5:00 PM (MST).", "Where do I sign up?", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Matt Lewis"], "Date": "2013-08-02 00:00:00"}, {"Tags": ["1e", "appclarity", "software audit", "software licensing", "software management"], "URL": "http://blogs.1e.com/2013/07/30/software-audits-research/", "Area": ["1E News", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["1E has today announced the findings of research looking at how effective businesses are at managing their software licenses and usage. The research shows that, although the number of software vendor audits businesses are exposed to is on the increase, the majority of firms only have limited visibility into what software is actually being used across their IT estates. With businesses unable to pinpoint the exact applications that are being used on their desktops, laptops and servers, they are prone to over-spend on software licenses in order to avoid the fines levied as a result of failed software audits.", "Our survey of 250 IT decision-makers across the UK, USA and France, conducted by Vanson Bourne*, found that 30 percent of UK IT decision makers still rely on ad-hoc and manual methods to track software usage.This is despite 71 percent of UK firms reporting that a software audit has been carried out within the company at least once by a software vendor in the last 12 months, and 46 percent revealing they have been subjected to multiple software audits. The research suggests that there is likely to be thousands, if not millions, of pounds worth of preventable and on-going costs associated with unused software or shelfware within organizations.", "Key overall findings from the survey include:", "Sumir Karayi, CEO of 1E, said that these figures highlight the business challenges associated with software license management:", "Software license management is getting harder too. Getting application licensing right is hard enough in the physical world, but in a world of desktop and server virtualization, organizations are faced with a whole new level of complexity. Its clear that organizations need to get a grip on what exactly they are using and have the ability to compare it to what they need from both an operational and compliance standpoint in order to remain efficient and competitive.", "Su Kent | Corporate Marketing Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left.", "*Survey of 250 IT decision-makers conducted by Vanson Bourne in the UK, USA and France in November 2012"], "Author": ["Su Kent"], "Date": "2013-07-30 00:00:00"}, {"Tags": ["1e", "1E webinar", "pc power management", "Software Asset Management", "Software License Optimization", "System Center Configuration Manager", "webinar", "Windows Migrations"], "URL": "http://blogs.1e.com/2013/07/29/1e-webinars-add-value-to-your-business/", "Area": ["1E Products", "Webinars"], "Comments": "", "Content": ["To this end, we run regular free 1E Webinars, which can be attended by any interested professional. The 1E Webinars are each hosted by an individual at 1E  from product management or our consulting team  who has specific expertise in that area, and are available as recordings afterwards to attendees. They cover a broad range of topics, including Windows Migrations, PC Power Management, Software Asset Management, Software License Optimization, and System Center Configuration Manager upgrades. Each and every 1E Webinar is designed to add value to your business; helping you reduce costs, save energy and optimize performance.", "Our upcoming 1E Webinars include:", "Matt Lewis | Digital Marketing Program Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Matt Lewis"], "Date": "2013-07-29 00:00:00"}, {"Tags": ["madrid", "tech ed europe", "TechEd"], "URL": "http://blogs.1e.com/2013/06/24/what-happens-in-las-ventas-stays-in-las-ventas-tech-ed-europe-2013/", "Area": ["1E News", "Events", "TechEd"], "Comments": "", "Content": ["Why not share some of the places youre looking to visit in Madrid:", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-06-24 00:00:00"}, {"Tags": ["2013", "tech ed", "teched europe", "xbox one"], "URL": "http://blogs.1e.com/2013/06/21/your-chance-at-teched-europe-to-win-an-xbox-one/", "Area": ["Events", "TechEd"], "Comments": [{"Comment": "i really need this i promised my son an xbox one and now i found out the price i taught it would maybe be 250  300 but + 400 euro is alot so maybe me  ", "Date": "2013-07-17 03:29:00", "Author": "July 17, 2013 at 3:29 pm"}], "Content": ["Now down to some more exciting updates -thecompetition changes.", "We will be holding a prize drawingtwice every day with a chance of winning a 1E Limited Edition MagLite from Tuesday, 25, to Friday, 28.", "On top of a chance to win a MagLite youll also have a chance to win a brand new Xbox One! If you entered the competition at any point during the week (and had a chat with one of our ActiveEfficiency Experts) youll be in the running with the winner being announced at 14:00PM on Friday, 28.", "Need to know what the drawing times are? Look no further:", "TUESDAY, 25 JUNE (x2 MagLites)", "Expo Hall Booth #95, Drawing Times  12:30 & 17:30", "WEDNESDAY, JUNE 26 (x2 MagLites)", "Expo Hall Booth #95, Drawing Times  14:00 & 16:30", "THURSDAY, 27 JUNE (x2 MagLites)", "Expo Hall Booth #95, Drawing Times  13:30  16:00", "FRIDAY, 28 JUNE (x2 MagLites & 1 Xbox One)", "Expo Hall Booth #95, Drawing Times  14:00", "1E Blogs", "", "The Xbox One prize will be fulfilled once the public release date has been reached. 1E will ship your brand new Xbox One on the day it is available."], "Author": ["Henry Truong"], "Date": "2013-06-21 00:00:00"}]