[{"Tags": ["1e", "configmgr", "ConfigMgr 2012"], "URL": "http://blogs.1e.com/2013/06/18/configmgr-2012-application-catalog-redirection-issue/", "Area": ["ConfigMgr", "Insidev1ew"], "Comments": [{"Comment": "Oh my goodness! Awesome article dude! Thank you\nso much, However I am experiencing issues with your RSS.\nI dont understand why I cant join it. Is there anybody getting similar RSS issues?\nAnybody who knows the solution can you kindly respond? Thanks!\n!", "Date": "2013-07-22 08:21:00", "Author": "instalator pozna&#324"}, {"Comment": "Its a pity you dont have a donate button! Id definitely donate to this outstanding blog! I guess for now ill settle for bookmarking and adding your\nRSS feed to my Google account. I look forward to fresh updates and will share this site with my Facebook group.\nChat soon!", "Date": "2013-07-23 02:43:00", "Author": "C and G Technolgies"}, {"Comment": "This is probably more symptomatic of Net Framework being installed after IIS.  When done in that order, Net Framework has to be registered manually.", "Date": "2013-08-23 10:07:00", "Author": "August 23, 2013 at 10:07 am"}, {"Comment": "I was adding the Application Catalog to the site server in this instance and I had .NET Framework 4 installed as it should have been, as this is a prerequisite that would have cause the server installation to fail.  My logs showed that the installation of the App Catalog components was successful, which was the tricky part.  I had missed the WCF component requirement and added it through Server Manager.  I reregistered .NET Framework as part of just running through all of the prerequisites for the role and not because .NET Framework was installed after the fact.  Then the App Catalog worked perfectly.", "Date": "2013-08-23 02:07:00", "Author": "August 23, 2013 at 2:07 pm"}, {"Comment": "Hey John, long time, no see.  Great post.  ", "Date": "2014-01-15 10:53:00", "Author": "January 15, 2014 at 10:53 pm"}], "Content": ["I recently installed the ConfigMgr 2012 Application Catalog and then realized that I had not installed the prerequisite WCF components on the server that would be hosting the catalog. I installed the WCF feature as required and toggled the Site Component Manager. The logs indicated that I had the Application Catalog components all installed properly. I tried to access the application catalog and I ended up watching the web page loop endlessly while redirecting itself towellitself.", "I checked redirection on the site and application in IIS, but no redirection was configured. I decided to try to find the answer on Bing. Beside the fact that I have no idea what their home page picture was for that day I came away disappointed. There really wasnt anything of any value in the results. I figured someone must have run into this before. So I decided to give the all-knowing Google a whirl. No joy there either.", "So I ran an elevated command prompt, switched to C:\\Windows\\Microsoft.NET\\Framework64\\v4.0.30319 and ran the following command", "aspnet_regiis -iru", "I hope the next person who finds themselves wondering why the ConfigMgr 2012Application Catalog webpage keeps endlessly redirecting to itself comes across this post before they pull out too much hair.", "John DeVito | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["John DeVito"], "Date": "2013-06-18 00:00:00"}, {"Tags": ["1e academy live", "1e events", "Announcement"], "URL": "http://blogs.1e.com/2013/06/12/missed-1e-academy-live-at-mms-theres-more/", "Area": ["1E Academy Live", "Events", "OS Deployment"], "Comments": [{"Comment": "Pingback: Your chance at TechEd Europe to win An XBOX ONE! - 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Your chance at TechEd Europe to win An XBOX ONE! - 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["", "", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-06-12 00:00:00"}, {"Tags": ["1e", "1e events", "2013", "europe", "madrid", "TechEd"], "URL": "http://blogs.1e.com/2013/06/10/1e-are-going-to-teched-europe-2013/", "Area": ["1E News", "Events", "TechEd"], "Comments": [{"Comment": "Great  are you guys going to be running your \"Windows Migration Workshop\" at any point there?", "Date": "2013-06-11 03:22:00", "Author": "June 11, 2013 at 3:22 pm"}, {"Comment": "Hi Cliff, as I mentioned, we've now got a link on our events page to allow you to register to take part in our 1E Academy Live before TechEd Europe.", "Date": "2013-06-12 09:18:00", "Author": "June 12, 2013 at 9:18 am"}, {"Comment": "Hi Cliff, having a sneaky peekat my inside sources and it looks like we are holding another 1E Academy Live on the Monday 24, June. Will you be at TechEd in Madrid this year?We'll be releasing more details on this soon.", "Date": "2013-06-11 03:57:00", "Author": "June 11, 2013 at 3:57 pm"}], "Content": ["Will you be using social media? Why not join in the conversation with our event hashtag?", "So what will you be expecting from 1E at TechEd? Apart from all the IT Efficiency goodness that weve come to expect from our ActiveEfficiency experts, well be giving away 1E goodies as well as an opportunity for two lucky people to win a Limited Edition 1E Maglite torcheach day!", "Make sure youre down there and remember to say Hi to booth #95!", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-06-10 00:00:00"}, {"Tags": ["1e support", "support portal", "update"], "URL": "http://blogs.1e.com/2013/05/23/1e-support-portal-update-phase-one-almost-complete/", "Area": ["1E News", "1E Support"], "Comments": [{"Comment": "Thanks for posting. Great to see changes are being made. The upgrade is a little bit frustrating from a user perspective. Changes are being published regularly and this results in confusion. Things are where they used to be, and I don't know where they went. During the transition period, or phases work hasn't been complete and therefore I am looking at unfinished work. It is possible to have releases to sections of the site? On one date release a series of changes rather than releasing a single change at a time. I guess I am asking that if you are making changes to your site do a cut over from the old version to the new one and let users know when you are done.", "Date": "2013-06-04 04:12:00", "Author": "June 4, 2013 at 4:12 pm"}, {"Comment": "Thanks for the suggestion Brett. We're always looking at ways to improve our customers experiences when interacting with 1E so we will take this suggestion going forward.", "Date": "2013-06-05 07:41:00", "Author": "June 5, 2013 at 7:41 pm"}], "Content": ["Weve just about to finishphase one of the support portal which meant restructuring and categorizing our Knowledge Base articles. Weve also reviewed and improved the articles making them even easier to use and understand.", "Phase two of the Support Portal will be completed in a few months which will be a revamp of the portal making it even better than before. Well have more news to follow so keep watching this space.", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-05-23 00:00:00"}, {"Tags": ["2013", "award", "green it", "green it award", "nightwatchman", "sustainable it", "win"], "URL": "http://blogs.1e.com/2013/05/10/1e-wins-green-it-award-for-fourth-year-running-for-nightwatchman-enterprise/", "Area": ["1E News", "Awards", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Very nice Henry, congrats from Forrester Forrsights!  Brian Luu", "Date": "2013-05-10 06:21:00", "Author": "May 10, 2013 at 6:21 pm"}, {"Comment": "Thanks Brian! Much appreciated!", "Date": "2013-05-10 06:34:00", "Author": "May 10, 2013 at 6:34 pm"}, {"Comment": "Pingback: 1E wins Green IT Award for fourth year running for NightWatchman Enterprise | www.cloud4green.it", "Author": "1E wins Green IT Award for fourth year running for NightWatchman Enterprise | www.cloud4green.it"}], "Content": ["", "Green IT Magazine hosted their annual awards for Green IT in London last week. The evening started with a drinks reception which allowed everyone to catch up with old friends and start to make new ones. Following a short speech from Richard French from BCS The Chartered Institute for IT.", "This means that the winner of each category not only helped in part by making the IT industry more eco-friendly but were also sponsoring an acre of rainforest in Ecuador.", "", "Energy Efficiency Solution of the Year", "Runner Up: Energy Software Solutions  ESSaver PUE", "", "It dispels common misconceptions around PC power management with its user-friendly approach and helps to give admins accurate power consumptions reporting across the entire estate taking into account any complex power tariffs or schemes.", "A lot of hard work has gone into making this solutionand we're extremely proud to have so many customers enjoying NightWatchman andwinninganother Green IT Award.", "Here's a picture of me proudly sporting ouraward:", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-05-10 00:00:00"}, {"Tags": ["awards", "green it", "nightwatchman", "sustainable it"], "URL": "http://blogs.1e.com/2013/05/09/1e-are-at-the-green-it-award-tonight-for-the-fourth-year/", "Area": ["1E News", "Awards", "Green IT", "NightWatchman"], "Comments": "", "Content": ["Nominations opened on December 19th, 2012 when this year's categories were announced. Successful companies have gone through to the finals of which 1E are proud to be one of them. We were up for three categories:", "Lets hope we can keep that trend going.", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-05-09 00:00:00"}, {"Tags": ["MSIEXEC", "REALLYSUPPRESS switch", "SCCM"], "URL": "http://blogs.1e.com/2013/05/07/sccm-2012-agent-reboots-when-msiexec-uses-reallysuppress-switch/", "Area": ["Insidev1ew", "SCCM", "Systems Management"], "Comments": [{"Comment": "I see this too, it causes machines to forcefully reboot which users are not too happy about. Doesn't even offer the option to defer the reboot in this case.", "Date": "2013-07-05 10:07:00", "Author": "July 5, 2013 at 10:07 am"}, {"Comment": "This is a behavior only seen when the installation type is set to Required rather than available. After extensive testing I found the following information:", "Date": "2014-03-24 06:11:00", "Author": "Dustin Estes"}], "Content": ["I recently discovered some rather worrying behaviour in SCCM 2012 SP1 regarding how the CM agent handles return codes from msiexec.If you pass the /REALLYSUPPRESS switch to msixec then that means that if msixec determines that the installation needs a reboot (for example, if a required file was in use during the install/upgrade) then msiexec will not initiate a reboot; instead it will suppress the reboot and return an exit code of 3010.", "SCCM 2012 Deployment Types define a 3010 as a Soft Reboot. There does not appear to be any definitive documentation online from MS regarding the meaning of soft reboot but it is generally taken to mean to put the machine into a pending reboot state and not actually reboot the machine.", "However, I have found that despite exiting with a 3010 code, the CM agent had initiated a system reboot.", "There are two workarounds:", "I recommend option 1 since it means that if you decide to do any reporting on those return codes you can get accurate data- after all, you may actually want to know that some machines are now stuck in a pending reboot state", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Luis Johnstone"], "Date": "2013-05-07 00:00:00"}, {"Tags": ["WOL Proxy"], "URL": "http://blogs.1e.com/2013/05/03/configuration-manager-2012-sp1-wol-proxy-feature-overview/", "Area": ["1E Products", "ConfigMgr", "Insidev1ew", "NightWatchman", "SCCM", "Systems Management"], "Comments": "", "Content": ["Microsoft System Center Configuration Manager 2012 SP1 includes a new feature named WOL Proxy. ConfigMgr (or SCCM) has had a wake-on-LAN solution since ConfigMgr 2007 for appropriately flagged deployments. ConfigMgr WOL runs in one of two modes: subnet-directed broadcast or unicast. ConfigMgr customers found that unicast did not work once the clients routers had dropped their MAC address (typically after 4 hours). Subnet-directed broadcasts only worked if routers were set to propagate subnet-directed broadcasts, which is normally not the case due to security concerns. Therefore ConfigMgr 2012 WOL was generally found to not be practical in production.", "The SP1 ConfigMgr WOL Proxy addresses the unicast weakness by ensuring that at least one client on each subnet has the MAC addresses for all its peers and is ready to send magic packets in response to the unicast packets. It never drops the MAC addresses and therefore should be ready at any time.", "WOL Proxy is a good concept but in this version both the communitys and 1Es observations are that the proxies have several weaknesses for most organizations. Security weaknesses are the most obvious, but amongst other issues the current implementation is also very counter-productive if you have a computer power management strategy in place. Were pleased to see Microsoft improve their WOL solution for some organizations but we encourage you to consider whether this implementation will work in your environment considering the details in the linked document.", "Paul Thomsen | Associate Product Manager", "If you found this article interesting, please take a moment to share it with your colleagues and contacts using the social media buttons to the left."], "Author": ["Paul Thomsen"], "Date": "2013-05-03 00:00:00"}, {"Tags": ["BAAF", "charity", "sumir karayi"], "URL": "http://blogs.1e.com/2013/04/25/sumir-karayi-runs-his-first-london-marathon-and-raises-11000-in-charity-to-the-british-association-of-adoption-and-fostering-baaf/", "Area": ["1E News", "Charity"], "Comments": [{"Comment": "Congrats Sumir!!! Impressive!!", "Date": "2013-04-25 04:44:00", "Author": "April 25, 2013 at 4:44 pm"}], "Content": ["Sumir acknowledges that the hardest part of the marathon was the final few miles where he had to really reach deep within to keep his motivation up to keep running. With many people walking the last section of the marathon route, it would have been easy to just follow the rest of the crowd and just walk the final stretch but Sumir was resolved to carry on and finish strong.", "Thanks again to all those who have contributed and those who supported Sumirs run.", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-04-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/04/23/nightwatchman-6-5-released/", "Area": ["1E News", "Green IT", "NightWatchman", "PC Power Management"], "Comments": "", "Content": ["Also included in this release is aunique new feature which looks at actual utilization of PCs in an organization:", "This can enable key stakeholders to make intelligent business decisions, including:", "1E Blogs"], "Author": ["Michelle Hazelton"], "Date": "2013-04-23 00:00:00"}, {"Tags": ["configmgr", "powershell", "SCCM 2012", "system center", "systems management"], "URL": "http://blogs.1e.com/2013/04/17/how-to-delete-multiple-packages-using-powershell-with-configmgr-2012-sp1/", "Area": ["ConfigMgr", "Insidev1ew", "SCCM", "Systems Management"], "Comments": [{"Comment": "Pingback: Deleting multiple Packages in Configuration Manager 2012 SP1 by Mike Terrill with 1E - Harold Wong's Blog with Geekie Thoughts and Insights - Site Home - TechNet Blogs", "Author": "Deleting multiple Packages in Configuration Manager 2012 SP1 by Mike Terrill with 1E - Harold Wong's Blog with Geekie Thoughts and Insights - Site Home - TechNet Blogs"}], "Content": ["How many times have you had the need to delete multiple packages in a ConfigMgr test site? In order to do this, you right-click on the package and select Delete. You get presented a welcome screen, then you are asked if you want to see more information. If you select no, then you are presented a summary screen, progress and then a completion screen (in which you need to click close). That is something like six clicks just to delete a package. In addition, you cannot multi-select a bunch of packages and delete them. So, if you have 100 packages that you want to delete, you are looking at about 600+ clicks. I am not sure about you, but that does not sounds like fun.", "After launching PowerShell (this can be done from the ConfigMgr Admin Console), you can avoid all of these clicks with just a few commands.", "The Name parameter does take wildcards, so if you have multiple packages with a common name (i.e. Test Package 1, Test Package 2, etc.), then you can simply add the asterisk:", "Now, say you want to delete all packages that dont have an empty Manufacturer field, 1E packages or Microsoft packages. Use the following command to get all of the package names:", "You can then just type $pkgs at the command prompt to see all of the packages that meet the criteria.", "This will display what kind of damage will be done before anything happens.", "When the results are what you expect, run the following command:", "Mike Terrill | Systems Management Practice Lead", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Mike Terrill"], "Date": "2013-04-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/04/12/exploring-the-four-most-effective-cyber-security-mitigation-strategies-part-2/", "Area": ["Insidev1ew", "IT Security"], "Comments": [{"Comment": "Pingback: Exploring the top four most effective cyber security strategies - Part 1 - 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Exploring the top four most effective cyber security strategies - Part 1 - 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Note that two out of the four mitigation strategies are about updating the software that is already installed on computer systems.", "Using patch classification to prioritize the deployment ofsecurity patches is vitalsince hackers will startexploiting new vulnerabilities once they are known. As soon as a security fix is available the clock is ticking", "Keeping desktop applications up to date is as important as patching the underlying Operating System. The difference comes from how updates are packaged and delivered, with less distinction made between the type of fix and its severity. In terms of deployment, some applications incorporate a self-update feature and others rely on the end-user or system management tools.", "Geoff Collins | VP Technology", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Geoff Collins"], "Date": "2013-04-12 00:00:00"}, {"Tags": ["Active Efficiency", "activeefficiency", "IT Security", "it system management", "security", "systems management"], "URL": "http://blogs.1e.com/2013/04/09/exploring-the-four-most-effective-cyber-security-mitigation-strategies-part-1/", "Area": ["Insidev1ew", "IT Security"], "Comments": [{"Comment": "Pingback: Exploring the four most effective cyber security mitigation strategies - Part 2 | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Exploring the four most effective cyber security mitigation strategies - Part 2 | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Over this series of three articles Ill be exploring the four mitigations in a series of three articles and explaining how they combine to form an effective cyber security defence strategy. Ill start in this article withApplication Whitelisting.", "An application whitelist is a register of applications that are approved to run on a computer system. Unless an application is explicitly listed it will not be permitted to run. This is the opposite of a blacklist where all applications may run except for those explicitly listed.", "Geoff Collins | VP Technology", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Geoff Collins"], "Date": "2013-04-09 00:00:00"}, {"Tags": ["Windows XP Danger Zone"], "URL": "http://blogs.1e.com/2013/04/08/warning-you-are-entering-windows-xp-danger-zone/", "Area": ["OS Deployment", "Windows 7 Migration", "Windows XP"], "Comments": [{"Comment": "Pingback: The Windows XP Danger Zone", "Author": "The Windows XP Danger Zone"}], "Content": ["Organizations that are not yet off the starting blocks or only a little way down the track are highly unlikely to complete before the Microsoft deadline. Whether the delay is because they misunderstood the sheer scale of the project, or that they are coming across myriad technical hurdles  from application reinstallation to gotchas around device drivers  which they never encountered before, it means they cannot confidently predict when they will finish the project or how much it will cost them. Ultimately the challenge of such a project is that few IT teams will have ever experienced such a complex migration.", "The most common approach to tackling a major OS migration is for IT departments to manage the migration process themselves. However, the challenge with moving to Windows 7 is that few have ever experienced such a complex migration, so are coming across myriad issues  from application mapping to gotchas around device drivers  which they never encountered before. They may think they are close to completion, but there will be many unknowns they havent anticipated which will impact timescales.", "The unknown pitfalls of a Windows migration", "United States Secretary of Defense, Donald Rumsfeld", "No single unknown will be massively complex, but each represents a hurdle to be overcome and IT teams shouldnt be duped into thinking that they are nearing completion just because theyve cleared one jump. The reality is they still wont know how far they are from finishing the migration. Projects become long, slow and complex and risk extending beyond April 2014.", "The alternative: automation, automation, automation", "Instead of just persevering with labor-intensive, increasingly lengthy manual migration projects, organizations need to look for newer, less painful, solutions.", "Using automation to upgrade computers from Windows XP or Vista to Windows 7 will free up the engineering resource to train users on how to use the new OS and make the whole employee experience much more positive.", "Traditionally a visit from an engineer would mean them taking over the computer for a few hours while the user does something (or nothing) else  in fact this can affect productivity for even longer periods, with the user unable to use their PC for the best part of a day. A better scenario would be that a users machine is automatically upgraded overnight (or at a time of their choosing when they wont be disrupted) and then the IT resource (helpdesk and engineers) can focus on educating users about the new OS and productively use the newly installed applications. IT departments simply do not have enough time to do this today, as they are bogged down with cumbersome, manual processes and troubleshooting.", "Talk to the Experts and beat the April 2014 deadline:", "Su Kent | Corporate Marketing Manager", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Su Kent"], "Date": "2013-04-08 00:00:00"}, {"Tags": ["1e academy live", "1EAL", "activeefficiency", "events", "MMS", "musings"], "URL": "http://blogs.1e.com/2013/04/08/1e-academy-live-a-great-kick-off-to-mms-2013/", "Area": ["1E Academy Live", "1E News", "Events", "MMS"], "Comments": "", "Content": ["We will be producing a nice little highlight video in due course so watch this space.", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-04-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/04/07/mms-2013-1e-academy-live-is-almost-here/", "Area": ["1E Academy Live", "1E News"], "Comments": "", "Content": [], "Author": ["Henry Truong"], "Date": "2013-04-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/04/05/1e-at-mms-2013-learn-when-and-where-to-be-for-1e/", "Area": ["Events", "MMS"], "Comments": "", "Content": ["Click to enlarge", "Are you using twitter at MMS?", "Official Hashtags:", "1E Academy Live", "You may have read that were hosting our first Windows Migration Certification Workshop called 1E Academy Live which will be held at the Luxor Hotel in the Egyptian Ballroom (west towers). Those who have registered will kick start their learning session early this year for MMS as well as become certified and get a limited edition t-shirt.", "1E Social", "Man vs OSD", "From our Man vs OSD feature. Chance to win a 1E Limited Edition Maglite and a myITforum MMS party ticket! Recording your OSD questions.", "1E Booth Presentations", "1E Booth #323, Expo Hall", "Man vs OSD", "From our Man vs OSD feature. Chance to win a 1E Limited Edition Maglite and a myITforum MMS party ticket! Recording your OSD questions.", "1E Booth Presentations", "1E Booth #323, Expo Hall", "Man vs OSD", "From our Man vs OSD feature. Chance to win a 1E Limited Edition Maglite and a myITforum MMS party ticket! Recording your OSD questions.", "MMS 1E Gold Session Streamline your ConfigMgr 2012 Infrastrucure to Make OSD Business As Usual", "In a sell-out session, Shaun Cassells, Mike Terrill and Troy Martin will be discussing how to make OS deployment Business As Usual. Were currently looking to moving this to a bigger capacity room so keep your eyes and ears on standby!", "An effective Configuration Manager 2012 infrastructure is needed that reduces operational costs and network infrastructure, while maximizing automation and scalability. There is also need to support an OSD process that meets the demands of an enterprise Windows 7 deployment. How do you achieve these goals and make it Business As Usual? We will demonstrate how Nomad 2012, Shopping and AppClarity can be used in some of the most challenging tasks ahead, all while achieving the goal of \"Business As Usual.\"", "1E Booth Presentations", "1E Booth #323, Expo Hall", "1E MMS Party", "1Es legendary party. If youve attended previous 1E MMS parties, then youll know this is a night that needs no promotion.", "1E Booth Presentations", "1E Booth #323, Expo Hall", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-04-05 00:00:00"}, {"Tags": ["1e", "Man vs OSD", "MMS"], "URL": "http://blogs.1e.com/2013/04/04/man-vs-osd-making-you-famous-at-mms-and-a-chance-to-win-a-1e-limited-edition-maglite-or-a-myitforum-party-ticket/", "Area": ["1E News", "MMS", "OS Deployment"], "Comments": [{"Comment": "Pingback: 1E at MMS 2013  Learn when and where to be for 1E - 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "1E at MMS 2013  Learn when and where to be for 1E - 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["We will be running an on-going feature throughout MMS, Sun 7  Tues 9, where we will be video recording your community questions surrounding OSD and automation to help you with your OS migration projects. We will then take your questions, answer them and then play them on our booth along with the answer! (Well also send you the answer separately.)", "With the deadline for Windows XP support creeping ever closer, we have the experts that can help give your projects the push it needs. Read the synopsis below:", "From the beginning of time, men have pitted themselves against a number of worthwhile opponents. None of which can be as feared as an OS migration project. The sheer number of tasks and approaches that man can take to attempt to tackle the beast that is Operating System Deployment (OSD) is bewildering.", "Many have been defeated by the sheer scale of the project while others have come across a myriad of issues  from application mapping to gotchas around device drivers  which they never had encountered before. Many have also fallen at the hands of insufficient bandwidth and slow links between remote branches. All of which means that they cannot confidently predict when they will finish the project or determine how much it will cost them, as well as leaving their IT systems in a precarious position.", "We have formed a team of experts that can help you tackle these problems and instead of Man vs. OSD, make it Man controls OSD.", "Ask our panel of experts a variety of questions regarding your OSD project and automation.", "Those who asked questions on the Sunday will be notified by Monday, Monday by Tuesday, and Tuesday will be Tuesday afternoon.", "You can collect your prizes from the 1E Booth #323.", "Make sure to note these down and we will be updating and reminding people through twitter!"], "Author": ["Henry Truong"], "Date": "2013-04-04 00:00:00"}, {"Tags": ["green it", "IT energy management", "pc power management", "sustainable it"], "URL": "http://blogs.1e.com/2013/03/25/face-facts-we-are-responsible-for-the-unseasonal-weather/", "Area": ["Green IT", "NightWatchman"], "Comments": "", "Content": ["I lost count of the number of people who commented on the unseasonal weather whilst out going about my business this weekend. Here, in Sheffield, we had about 15cm of snow fall over the course of Friday and Saturday. This was described as being dreadful and foul by some of my fellow shoppers, who were panic buying all the milk, bread and meat they could get their hands on. I have to say, I made the most of it and had a great time playing with my dog Pippa. She particularly enjoyed me throwing snowballs over drifts more than a metre deep in our local park where she would land submerged in soft powdery snow. Heres an action shot.", "\"The [current] variation we are seeing in temperature or rainfall is double the rate of the average. That suggests that we are going to have more droughts, we are going to have more floods, we are going to have more sea surges and we are going to have more storms.", "We should all be making an effort to reduce our carbon footprint. In our personal lives we have a responsibility to our children and our childrens children. Whether it is recycling, driving less or driving a smaller car, flying less or just consuming less stuff. We basically need to be less selfish and less consuming.", "You, as an employee have the power to influence and make a positive difference to our future."], "Author": ["Michelle Hazelton"], "Date": "2013-03-25 00:00:00"}, {"Tags": ["appclarity", "AppClarity 4.0", "release", "Service License Optimization", "vmware"], "URL": "http://blogs.1e.com/2013/03/22/appclarity-4-0-is-now-available-for-download/", "Area": ["1E News", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Hello All,", "AppClarity 4.0 includes a number of very exciting features:", "Agentless Server Software Inventory", "AppClarity now has the ability to remotely collect inventory of applications and important hardware characteristics such as number of CPUs and CPU cores from Servers. The latter is something that systems management tools such as SCCM often struggle to do accurately, which very often causes over licensing and massive waste.", "This leverages our ActiveEfficiency Scout technology and has no dependency on SCCM.", "", "", "Server License Management", "Server licenses are typically managed in a different way to desktop licenses. This is often based on the hardware characteristics of the server (such as number of cores or processors).", "AppClarity 4.0 features a completely redesigned license management system that can make managing this complexity a pleasure.", "", "UsefulWork for Server Applications", "AppClarity 4.0 also introduces the reinvention of our patented UsefulWork technology to hunt down unused server software.", "As an end user you just see the usage pie charts work exactly as it does for desktop software. Simple.", "", "", "First Vendor Optimization Pack: VMWare", "AppClarity 4.0 introduces the first of several planned vendor license optimization modules. The VMWare module is designed to help our customers reduce their spend on VMWare software maintenance by identifying which licenses can be downgraded.", "We are offering this module for free to early adopters that buy AppClarity 4.0 server endpoint licenses.", "", "", "Application Catalogue Cloud Sync", "The application catalogue that AppClarity uses to clean up the application inventory data is now connected to the internet to allow regular updates. This will also enable us to focus our catalogue efforts where it will provide the most benefit to the most customers.", "", "", "", "If you want more information then have a look at this video of Dave Harding, Product Manager at 1E, as he talks about all these great new features in AppClarity 4.0.", "Connect with Geoff on LinkedIn", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left.", "1E Blogs"], "Author": ["Geoff Collins"], "Date": "2013-03-22 00:00:00"}, {"Tags": ["patch management", "patch tuesday", "windows update"], "URL": "http://blogs.1e.com/2013/03/12/patch-tuesday-hell-for-it-admins-and-end-users/", "Area": ["IT Efficiency", "NightWatchman"], "Comments": "", "Content": ["In Windows 8, theyve opted for a more forceful approach. After three days of reminding you your PC needs to restart to finish installing updates, it will just tell you it will restart in 15 minutes, so get your skates on and save your work before you lose it.", "It doesnt have to be that way.", "NightWatchman has Wake-on-LAN technology built in to wake machines out of hours to apply patches. The key challenge is that not all power management solutions allow you to cleanly restart PCs after applying patches. The alternative (and often common) scenario means the user is forced to reboot during the working day to complete the cycle.", "To assist with best practices around remediating and testing patches, NightWatchman groups PCs by organization and location meaning you can stage deployments by system groups and priority. You can starting with smaller, lower risk groups, validating that no problems occur with the updates, and then work your way to larger and higher risk areas of the network.", "1E Blogs"], "Author": ["Michelle Hazelton"], "Date": "2013-03-12 00:00:00"}, {"Tags": ["compatibility", "ConfigMgr 2012", "Nomad reporting pack", "SCCM 2012", "server 2012", "support"], "URL": "http://blogs.1e.com/2013/03/11/nomad-2012-updates/", "Area": ["1E News", "1E Products", "Nomad", "SCCM", "Windows 8", "Windows Server"], "Comments": "", "Content": ["Alongside this release there are also a number of enhancements to the Nomad Reporting Pack, includingimprovementsto the base reports,a number of new reports and some greatnew graphical summaries. The Nomad Reporting Pack is available through the 1E Support Team.", "Shows a graph of network utilization, via stacking what nomad is downloading from DP, Peers and Multicast.", "Shows the same graph as above but in weekly aggregation. In addition it gives a pie chart of the overall bandwith used during the selected time period.", "A report to help keep track of any Hotfix deployment of otherwise Nomad upgrades.", "Shows you if a specific Subnet is fully ready for a OS deployment via checking out if any referenced Package is not yet pre-cached.", "Shows the details of the packages for a specific computer. Including details such as download from DP/Peer split and backoff/copy time.", "There may be a video in the works that highlights these great new reports soon so watch this space.", "Paul Parke | Head of Product Management", "1E Blogs", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Paul Parke"], "Date": "2013-03-11 00:00:00"}, {"Tags": ["1e", "BAAF", "charity", "London Marathon", "sumir karayi"], "URL": "http://blogs.1e.com/2013/03/04/sumir-karayi-ceo-at-1e-is-running-the-london-2013-marathon-for-baaf/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["Heres what Sumir had to say about his latest training session:", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2013-03-04 00:00:00"}, {"Tags": ["Brian Mason", "Dave Kawula", "os deployment", "OS Migrations", "osd", "video", "windows 7", "Windows Migrations", "windows xp"], "URL": "http://blogs.1e.com/2013/02/20/why-choose-1e-for-os-migrations/", "Area": ["ConfigMgr", "OS Deployment", "Windows 7", "Windows 7 Migration", "Windows XP"], "Comments": "", "Content": ["Here at 1E we understand that there are still those under the heavy pressure of migrating from Windows XP and are experiencing all the headaches that come along with it. Weve helped many organizations, including those which are extremely complex and large, migrate to Windows 7. So how can we help? Why choose 1E? Weve made a short video with Brian Mason, Microsoft ConfigMgr MVP, and Dave Kawula, Lead System Center Architect, discussing why they chose 1E.", "Take a look", "http://youtu.be/cBLULiXYJsA"], "Author": ["Henry Truong"], "Date": "2013-02-20 00:00:00"}, {"Tags": ["Active Efficiency", "activeefficiency", "IT Security", "it system management", "security", "systems management"], "URL": "http://blogs.1e.com/2013/02/19/good-systems-management-is-good-security/", "Area": ["ActiveEfficiency", "IT Efficiency", "IT Security", "Systems Management"], "Comments": "", "Content": ["By getting their systems in order, and harnessing the skills and toolsets of their systems management teams, businesses can bolster their security overnight. Good systems management is good security.", "Geoff Collins | VP Technology", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Geoff Collins"], "Date": "2013-02-19 00:00:00"}, {"Tags": ["Active Efficiency", "energy efficiency", "pc power management"], "URL": "http://blogs.1e.com/2013/02/15/microsoft-system-center-2012-configuration-manager-and-1e-nightwatchman-enterprise/", "Area": ["ConfigMgr", "NightWatchman", "PC Power Management"], "Comments": "", "Content": ["NightWatchman Enterprise will be fully compliant with Windows 8 in version 7, scheduled for mid-April.", "We will officially support ConfigMgr SP1, Windows Server 2012 and SQL 2012 and Windows 8 in version 7.", "NightWatchman Enterprise accurately reports on savings and emissions so that you not only save power you can prove it as well.", "Read the technical brief here", "", "", "", "", "", "", "", ""], "Author": ["Michelle Hazelton"], "Date": "2013-02-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2013/02/05/nightwatchman-enterprise-saves-power-and-co2-fact/", "Area": ["Green IT", "NightWatchman"], "Comments": [{"Comment": "Hi,\nWhat are the price for licences ? My company has 1500 workstations and I want to evaluate costs and benefits.\nRegards,\nLiviu\n\n", "Date": "2013-02-26 08:56:00", "Author": "February 26, 2013 at 8:56 am"}, {"Comment": "Hi Liviu,", "Date": "2013-02-26 12:38:00", "Author": "February 26, 2013 at 12:38 pm"}], "Content": ["Our user-friendly approach means that users are not impacted by enforced power management. If users are still active at the scheduled power down time then NightWatchman Enterprise backs off until the computer becomes inactive. Prior to shutdown, users open documents are saved.", "But thats not all; we add value in other areas too", "The Roadmap for 2013 is exciting; the NightWatchman team have sought inspiration from the cumulus skies over the past few months and have been working hard to deliver a solution to enable NightWatchman in the Cloud.", "Weve also been putting our thinking caps on  imagine, in the wake of BYOD, if you could identify all unused computers in your organization and be able to remove them? The potential cost reductions around hardware, energy and software licenses could be vastmore on this very soon. Watch this space!", "1E Blogs"], "Author": ["Michelle Hazelton"], "Date": "2013-02-05 00:00:00"}, {"Tags": ["Announcement", "release", "shopping"], "URL": "http://blogs.1e.com/2013/02/05/shopping-4-7-has-released/", "Area": ["1E News", "1E Products", "Shopping"], "Comments": "", "Content": ["Hello everyone,", "It has four new enhancements:", "OS Filtering", "Shopping 4.7 now allows the apps presented to the user to be filtered by whats compatible with their machine.", "This new capability makes Shopping an even more essential solution to getting off XP before April 2014", "", "", "Enhanced App Mapping", "The App Mapping feature, introduced in 2012 allows applications to be migrated as part of the Windows 7 process. The user will automatically get a replacement app based on their usage patterns and the app mapping rule configured by IT.", "4.7 builds on this to give the admin a UI to configure the rules and allows different mapping rules for different departments or roles.", "This feature requires the App Mapping solution which is comprised of Shopping, AppClarity and the App Mapping Solutions Accelerator.", "", "", "", "2012 Migration Assistance", "Many organizations are moving to SCCM 2012. For large organizations this may be a complex and lengthy process.", "Shopping makes one aspect of this much simpler  Shopping can provide a single portal to cater to users on the new SCCM 2012 infrastructure in parallel with the legacy 2007 as each business unit is migrated during the transition process.", "", "", "Extended Platform Support", "Shopping 4.7 adds support for Windows 8 clients, Internet Explorer 10, Windows Server 2012 and System Center 2012 (including SP1)", "", "", "", "", "", "", "Id like to thank the amazing team we have here at 1E and all the hard work theyve put into making some of the amazing additions in this release.", "Dave Harding | Senior Product Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Dave Harding"], "Date": "2013-02-05 00:00:00"}, {"Tags": ["Nomad 2012", "Nomad 2012 v5 released", "version 5"], "URL": "http://blogs.1e.com/2013/02/01/1e-nomad-2012-v5-has-been-released-get-it-now/", "Area": ["1E News", "ActiveEfficiency", "Nomad"], "Comments": [{"Comment": "We are looking to integrate 1E Nomad with our move to SCCM 2012, I am unable to find specifics regarding the architectural requirements for Nomad to assist in our design process. We have 250 sites, with 18k endpoints currently managed with SCCM 2007, each site is a Secondary in order to support OSDimaging at every location. Moving to 2012 we would normally plan a DP w/pxe at each and possibly a secondary for the larger sites, how would now intergrating Nomad possibly change or impact this design?", "Date": "2013-07-02 06:22:00", "Author": "July 2, 2013 at 6:22 pm"}, {"Comment": "Hi Eric,", "Date": "2013-07-10 03:59:00", "Author": "July 10, 2013 at 3:59 pm"}], "Content": ["Hello everyone,", "The three highlights of the release are:", "FanOut", "Nomads new many-to-many method of distribution allows distributions to happen in a fully connected or spider web manner across the local network.", "This is great for massive distributions such as Windows 7 images to happen extremely quickly even on the largest sites without any server infrastructure.", "", "", "Single Site Download", "Nomad 2012 is more efficient than ever before. Large and complex locations are mapped to ensure content is only ever downloaded once.", "", "", "Reporting", "The reporting pack is available from 1E support.", "", "", "If you need a little more reason to get excited check this video on version 5 of Nomad 2012 out and share with all your contacts:", "http://youtu.be/x0H0BsJ8h2Q", "This fantastic new release was the culmination of a lot of work from our amazing team.", "staging.1e.com/blogs"], "Author": ["Richard Threlkeld"], "Date": "2013-02-01 00:00:00"}, {"Tags": ["nomad", "Nomad 2012", "questions and answers", "Webinars"], "URL": "http://blogs.1e.com/2013/01/30/introducing-nomad-2012-version-5-webinar-q-and-a-part-2/", "Area": ["Nomad", "Webinars"], "Comments": [{"Comment": "I'd like to note that Nomad 2012 v5.0 now supports SCCM 2012 SP1 and has an updated reporting pack. Details to follow in a blog soon!", "Date": "2013-03-08 06:03:00", "Author": "March 8, 2013 at 6:03 pm"}], "Content": ["Nomad 2012 and Wireless", "PXE", "USMT / Peer Backup Assistance (PBA) Questions", "Compatibility and support questions (System Center Configuration Manager)", "Compatibility and support questions (Misc)", "We hope the two part series Q and A has answered many of the questions you may have had. If not, let us know and comment below or get in touch."], "Author": ["Henry Truong"], "Date": "2013-01-30 00:00:00"}, {"Tags": ["nomad", "Nomad 2012", "questions and answers", "Webinars"], "URL": "http://blogs.1e.com/2013/01/29/introducing-nomad-2012-version-5-webinar-q-and-a-part-1/", "Area": ["Nomad", "Webinars"], "Comments": [{"Comment": "Pingback: Introducing Nomad 2012 Version 5 Webinar Q and A: Part 2 | 1E Blogs  Insight and debate on IT Efficiency", "Author": "Introducing Nomad 2012 Version 5 Webinar Q and A: Part 2 | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["During the webinar we received a lot of questions. So many in fact that we've had to split this Q and A blog post into a two part series. We've categorized them and in part one, we'll be answering questions on:", "Webinar questions", "Nomad questions", "Nomad 2012 naming", "Single Site Download (SSD) questions", "FanOut Questions", "Stay tuned for Part 2 tomorrow."], "Author": ["Henry Truong"], "Date": "2013-01-29 00:00:00"}, {"Tags": ["Nomad 2012", "nomad 2012 v5", "teaser trail", "version 5", "video"], "URL": "http://blogs.1e.com/2013/01/28/nomad-2012-version-5-teaser-trail-released/", "Area": ["1E News", "Nomad"], "Comments": [{"Comment": "Pingback: Introducing Nomad 2012 Version 5 Webinar Q and A: Part 1 | 1E Blogs  Insight and debate on IT Efficiency", "Author": "Introducing Nomad 2012 Version 5 Webinar Q and A: Part 1 | 1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: System Center Unplugged | System Center Unplugged", "Author": "System Center Unplugged | System Center Unplugged"}], "Content": [], "Author": ["Henry Truong"], "Date": "2013-01-28 00:00:00"}, {"Tags": ["fanout", "Nomad 2012", "release", "single site download"], "URL": "http://blogs.1e.com/2013/01/23/1e-nomad-2012-version-5-0-is-nearly-here/", "Area": ["1E News", "Nomad"], "Comments": [{"Comment": "Pingback: Nomad 2012 version 5 teaser trail released | 1E Blogs  Insight and debate on IT Efficiency", "Author": "Nomad 2012 version 5 teaser trail released | 1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Introducing Nomad 2012 Version 5 Webinar Q and A: Part 1 | 1E Blogs  Insight and debate on IT Efficiency", "Author": "Introducing Nomad 2012 Version 5 Webinar Q and A: Part 1 | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["As we release to market in the coming weeks youll see new videos, webinars, documentation, whitepapers and information outlining these new features and how to follow best practice for implementation. We hope youre as excited as we are about this new release.", ""], "Author": ["Richard Threlkeld"], "Date": "2013-01-23 00:00:00"}, {"Tags": ["infrastructure product of the year", "nomad 2012. network computing awards 2013"], "URL": "http://blogs.1e.com/2013/01/16/nomad-2012-nominated-for-network-computing-awards-2013s-infrastructure-product-of-the-year/", "Area": ["1E News", "Awards", "IT Efficiency", "Nomad"], "Comments": [{"Comment": "Pingback: 1E Nomad 2012 Version 5.0 is nearly here | 1E Blogs  Insight and debate on IT Efficiency", "Author": "1E Nomad 2012 Version 5.0 is nearly here | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["", "Now in their seventh year, the Network Computing Awards were set up to recognise the solutions and the companies that have been most impressive in helping organisations function better through getting the most out of their networks.", "If your organization uses Nomad and you love it as much as we love improving it to make your infrastructure even more efficient, vote for it using this link:", "http://www.networkcomputing.co.uk/ncawards/index.php?page=vote2013", "Its the first category and you dont have to vote for anyone else in any other category if you dont want to. Its quick and free so get voting!", ""], "Author": ["Henry Truong"], "Date": "2013-01-16 00:00:00"}, {"Tags": ["announcements", "migration", "Nomad 2012", "Webinars", "windows 7"], "URL": "http://blogs.1e.com/2013/01/10/whats-new-in-january-2013-three-1e-webinars-this-month/", "Area": ["Webinars"], "Comments": "", "Content": ["Weve all made it into the first week of 2013 and we welcome a brand new year with brand new ideas. Here at 1E, weve also got some brand new webinars for you all so lets see in our new years treasure chest."], "Author": ["Henry Truong"], "Date": "2013-01-10 00:00:00"}, {"Tags": ["Server Work Assessment"], "URL": "http://blogs.1e.com/2012/12/14/innovative-ways-to-recover-stranded-it-assets-at-data-center-dynamics-dallas-tx/", "Area": ["1E Consulting", "1E Products", "ActiveEfficiency", "Data Center", "Events", "IT Asset Management", "IT Efficiency", "NightWatchman", "NightWatchman Server", "Server Efficiency", "Server Power Management"], "Comments": "", "Content": ["DLB Associates, representing ASHRAE TC9.9 continued its mission to socialize the expanded thermal operating guidelines for ICT, with the promise of dramatic energy savings by relaxing the environmental set points in the data center. In a similar vein, the Green Grid spoke about energy savings metrics, and the drive to recover unused capacity in the data center for energy savings.", "Several DCIM vendors and enterprises with recent DCIM implementation experience were there to drive home the point about the importance of efficient management of IT assets in order to maximize and extend the productive life of the data center. These players are addressing the task of identifying stranded IT assets by integrating their facility-level analytics with tools using traditional utilization-measurement methods. The shortcoming of this approach, as we know by now, is that server utilization does not equate to value returned to the enterprise.", "Data Center Practice Lead, Bob Landstrom, conducted a presentation covering this topic and how 1Es technology offers a unique solution that accelerates recovery of stranded IT assets with confidence. This is accomplished with 1Es Useful Work technology, which goes far beyond existing tools and techniques that rely on server utilization measurements to reveal where value is and is not being returned by the data center.", "With traditional utilization measurements, we can see that the server is alive, and maybe even that its doing something, but we cannot tell if it is doing anything useful. The server may be executing a stuck process or simple background administrative tasks, or operating system updates, but not returning value to the Business. The Business does not invest in servers and server software for the sole purpose of running an operating system. Utilization does not equate to value.", "Instead of treating the server as a black box, 1Es technology watches every process running on every server in the entire estate, and in real time categorizes each process as either useful or non-useful. What we then have is a clear view of where value is being returned, across the whole server estate. We have a complete accounting of our servers, and the degree to which they are doing useful data processing activity and returning value to the Business. Consequently, we automatically identify waste in real time, with the evidence allowing the operator to decommission servers with confidence."], "Author": ["Bob Landstrom"], "Date": "2012-12-14 00:00:00"}, {"Tags": ["Bandwidth Efficiency", "Bandwidth Throttling", "it system management", "nomad", "Nomad 2012"], "URL": "http://blogs.1e.com/2012/12/12/stop-software-upgrades-killing-the-network/", "Area": ["Nomad", "OS Deployment", "Windows 8"], "Comments": "", "Content": ["The need to support an ever increasing number of enterprise applications has always presented a challenge to network administrators. At no time is this more acute than when Operating Systems (OS) upgrades are rolled out. With the recent release of Windows 8, networking professionals will be once again wondering how to provision these important software upgrades without choking the network and, even more crucially, without negatively impacting business critical applications.", "The root of the problem lies with the fact that IT software content is continually growing larger, whether this relates to user applications, server applications, system and software updates or OS content. Indeed, typical OS content, which includes core images, boot images, driver packages and software packages, has multiplied in size in recent years, so while a base Windows XP image (after performing a system capture and including only the service pack) is around 800 MB in size, the equivalent Windows 7 Enterprise x64 image is approximately 26 GB.", "From a networking perspective the challenge is not just about the growing amount of data that needs to move from one location to another. It is complicated by the fact that both WAN and LAN speeds growing at a much slower rate than content is increasing, making it a mistake to try to push out all data as fast as possible across the network. This approach will only result in a situation where it takes a long time to deploy content and  if not managed correctly  congestion.", "Even if the event the network does have spare capacity, applications will still compete for any available bandwidth, so it is vital that business critical applications are given priority over IT usage. However, there are also many critical projects that IT needs to complete in order to enable the business not only to function but also to advance from an operational standpoint. Some of the highest priority IT projects are OS deployments, but all too often these are very costly and time consuming to perform, not only from an application compatibility perspective but also when trying to transfer content to remote locations or when automating the migration process. To avoid clogging up the network, it has become important not to shuffle user data across the network during the migration process, while it is also preferable to avoid having to deal with network configuration or traffic when doing Preboot eXecution Environment (PXE) requests for bare metal system builds.", "As it is inefficient to maintain a network with excess capacity, and impractical to add extra bandwidth to support ad hoc IT projects, many enterprises have opted to deploy application management solutions or bandwidth compression tools. While these can improve network efficiency, they are by no means perfect solutions, adding management complexity and merely addressing the symptoms  rather than the cause  of the problem. To truly alleviate the congestion caused by software upgrades, the roll out process itself must become more network-aware, automatically knowing when to deploy and, just as importantly, when to back off.", "Software configuration platforms that look at how data packets traverse the WAN and regulate bandwidth using techniques such as autonomic throttling solve the network congestion problem at source. In addition, by automatically holding local or branch office elections to determine a single desktop which will pull content across the WAN, they significantly reduce wide-area traffic, thus speeding up deployments and reducing the risk of network outages. Similar efficiencies can also be achieved in the LAN, with each branchs representative desktop only pushing out upgrades to other PCs when it knows no business critical applications can be impacted.", ""], "Author": ["Richard Threlkeld"], "Date": "2012-12-12 00:00:00"}, {"Tags": ["app store", "Consumerization of IT", "enterprise app store", "Self service software", "TechNet", "TechNet UK Blogs"], "URL": "http://blogs.1e.com/2012/12/06/guest-post-on-technet-uk-power-to-the-people-appstores-for-the-enterprise/", "Area": ["Shopping", "Software Asset Management"], "Comments": "", "Content": ["Consumerization of IT was one of the big topic of 2012  the empowerment of the consumers in IT. People have grown accustom to needing \"an app for that\" and then easily downloading it at will on thier smart phones with no lengthy or complex installation processes. With this comes the expectation that they should have the same experience in the workplace", "The consumerisation of IT has undoubtedly been one of the industrys favourite topics in 2012. While the majority of organisations will associate the term with the explosion of the Bring-Your-Own-Device (BYOD) phenomenon (and the associated task of tirelessly managing personal devices on the network), consumerisation has the potential to mean so much more to the enterprise. Its not just about organisations managing the use of employee smartphones and tablets in the workplace, but more importantly about adapting to the change in user and administrator expectations about how IT should be accessed and used in a work environment.", "As organisations continue to receive requests for more self-service orientated working environments  where employees can request the applications and services they need, when they need them  its clear users expect a greater level of control. After all, why shouldnt they be able to manage the business applications on their desktop in exactly the same way as the apps on their smartphone? A self-service portal that provides a unified AppStore, supporting both user- and machine-centric distribution, seeks to solve this dilemma giving organisations a level of business continuity as well as the flexibility to evolve as their business requirements change."], "Author": ["Henry Truong"], "Date": "2012-12-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/11/29/maximizing-data-center-roi-at-data-center-dynamics-toronto/", "Area": ["1E Consulting", "1E News", "1E Products", "Server Efficiency", "Software License Optimization"], "Comments": "", "Content": ["1E Data Center Practice Lead, Bob Landstrom, speaking at Data Center Dynamics in Toronto, Ontario", "It has been estimated that over one million new servers are introduced into enterprise data centers each year, in North America alone. Some of these are for modernization, some are for new applications. Have we removed one million servers last year? Have we removed half of a million?", "The fact of the matter is that the pace of the business and inadequacy of traditional governance methods combine to result in under-used or unused IT assets accumulating in the data center. Data center operators often consider it a luxury just to have the necessary time to install new servers coming into the environment. Rarely is sufficient time spent to identify and reclaim assets that are made obsolete by new additions or changes of the Business. Even when we try hard to recover underperforming capacity, the methods at hand are woefully inadequate to do so with the necessary certainty and pace needed in contemporary data center operations.", "The cost ramifications of these underperforming assets are what damages our IT Return on Investment. On servers that are underused, misused, or no longer used, software licenses and maintenance contracts represent an ongoing expense that is difficult for most operators to isolate. The energy costs of servers that are not returning value to the business, and the energy costs to maintain environmental set points for them can be exorbitant.", "Energy costs, operations costs, licensing costs, maintenance costs, facility costs are invested repeatedly in IT assets that are failing to return the value for which the Business invested in them in the first place.", "Most enterprises today use server utilization measurements as their method to determine whether a server is useful or not. If the server is showing utilization, the assumption is that its purposeful. This is unfortunate because utilization does not equate to value.", "With utilization measurements, we can see that the server is alive, and maybe even that its doing something, but we cannot tell if that something is useful. The server may be executing a stuck process or simple background administrative tasks, but not returning value to the Business.", "Instead of treating the server as a black box, what if we could see every process running on every server in the entire estate, and in real time categorize each process as either useful or non-useful? What we would then have, is a clear view of where value is being returned, across the whole server estate. We would have a complete accounting of our servers, and the degree to which they are doing useful data processing activity and returning value to the Business. We would automatically be identifying waste, in real time.", ""], "Author": ["Bob Landstrom"], "Date": "2012-11-29 00:00:00"}, {"Tags": ["Accelerated deployments", "application rationalization", "OS migration", "osd", "Supercharge", "windows 7"], "URL": "http://blogs.1e.com/2012/11/27/accelerated-windows-7-deployments-supercharging-os-migrations/", "Area": ["ActiveEfficiency", "AppClarity", "IT Efficiency", "NightWatchman", "Nomad", "OS Deployment", "SCCM", "Shopping", "Software Asset Management", "Software License Optimization", "WakeUp", "Windows 7", "Windows 7 Migration"], "Comments": "", "Content": ["1E are proud to release a white paper about Accelerated Windows 7 Deployments that covers the challenges of a Windows 7 migration. It talks about optimizing Windows 7 migrations from Application Rationalization, where youre faced with the issue of what applications are actually required to be migrated to the new OS, through to the varying methods of User State Migration.", "Heres a short excerpt from the beginning of the paper:", "There is no longer a one solution fits all approach for Operating Systems (OS) deployments as the provision of OS and the delivery of business applications need to be scalable and efficient as well as adapt to the changing ways in which people work. Today, large companies have to operate across a complex infrastructure that covers multiple locations and work environments to deliver an IT Platform that serves differing user needs and requirements.", "IT content is continually growing larger in size. Systems Management content includes user applications, server applications, system and software updates as well as OS content; all of which are increasingly becoming larger. Typical OS content includes core images, boot images, driver packages and software packages.", "To illustrate the nature of the problem, a base Windows XP image is around 800 MB in size after performing a system capture and including only the service pack. Comparatively, a base Windows 7 Enterprise x64 image including only the service pack is around 2.6 GB in size.", "You can download the whitepaper from here."], "Author": ["Henry Truong"], "Date": "2012-11-27 00:00:00"}, {"Tags": ["1e", "community", "thanksgiving"], "URL": "http://blogs.1e.com/2012/11/22/happy-thanksgiving-from-all-at-1e/", "Area": ["1E Community"], "Comments": "", "Content": ["Its that time of year where we remember those pilgrims from Plymouth, acknowledge all the things we have to be thankful for and, of course, gorge ourselves with delicious, delectable turkey.", "staging.1e.com/blogs"], "Author": ["Henry Truong"], "Date": "2012-11-22 00:00:00"}, {"Tags": ["Nomad 2012", "os deployment", "osd", "SCCM 2012", "Technical Deep Dive", "webinar"], "URL": "http://blogs.1e.com/2012/11/16/1e-osd-technical-deep-dive-questions-and-answers-from-the-webinar/", "Area": ["AppClarity", "ConfigMgr", "IT Efficiency", "Nomad", "OS Deployment", "SCCM", "Shopping", "Webinars", "Windows 7", "Windows 8"], "Comments": [{"Comment": "I see in this video the guys ae using a UDI task sequence with nomad. Could anyone point me in the right direction to integrating a udi task sequence with a Nomad TS. I have been unsuccessful in getting the udi to work in my task sequence and cannot figure out how the applications can be pre staged.", "Date": "2013-06-28 01:09:00", "Author": "June 28, 2013 at 1:09 pm"}, {"Comment": "Hi Emmet,", "Date": "2013-06-28 03:10:00", "Author": "June 28, 2013 at 3:10 pm"}], "Content": ["Our OSD technical deep dive session was a hit and wed like to thank again all those who attended. We got quite a few questions during the session and wed like to address them all so here we go:", "The task sequence integration is also available for ConfigMgr 07. You need to make sure you install the Admin UI extensions.", "Are Nomad 2012 and ConfigMgr 2007 compatible?", "Yes Nomad 2012 supports CM07", "All of the configurations youve shown have been in the SCCM console. Are there other consoles?", "No all of the operations for Nomad take place in the ConfigMgr console, we dont require separate consoles, databases or infrastructures which would compete with the existing ConfigMgr infrastructure and potentially cause failure points (or single points of failure).", "Im wondering how you would use peer backup assistant to back-up a site with, say 100 systems, and youre trying to rebuild them all at the same time. Do you need a dedicated system to handle the backups?", "With Peer Backup Assistant (PBA) you need to have a strategy around how to implement it. If you wanted to backup to peers and then rebuild them all simultaneously this couldnt be done just from a physical disk perspective. What our consultants have done is employ a strategy of having a specific subset of systems to be eligible at different times to serve as the PBA hosts. Systems can have this functionality turned on or off via registry settings very easily.", "So [is PBA] like a leap-frog strategy. Build 50 and let them backup to the other 50, then build the other 50?", "Additionally PBA can send data to a CIFS/NFS share; it doesnt only need to be a peer system. Therefore if you wanted to completely remove the data from 100% of the systems you could always have them backup to a NAS device or, for example, a DFS share. We would suggest you did that as part of your migration strategy. We do also plan on automating this more for our customers in the future.", "How do you get the WIM and other packages to be in the peer cache in a remote branch office ahead of time so it is ready for a build?", "We have a process which integrates into the task sequence engine. Just by setting a simple variable, you can pre-cache any content via Nomad automatically using the same targeting methods you would use today within SCCM. If youre interested we could schedule a follow-up session with a Solutions Engineer to demonstrate this and other Nomad functionality.", "Yes these reports exist for SCCM 2007. For Package conversion to use Nomad we have a simple utility that can automatically switch over your existing Packages to use Nomad as well as automatically set any newly created Packages to use Nomad, we just didnt demo that in this session.", "Are you able to restart the machine using the remote tools and have it boot from PXE anywhere?", "Yes  you could remote in, resolve the issue and then restart it so that the system could PXE boot off of a peer using PXE Everywhere and perform a successful migration", "I currently have that configured, however, after the initial boot, the remote service is not available after the OS is loaded. Should I just add another command to start that as an action after every restart in the TS?", "That could be due to several things such as boot image configuration or even the RDP port being blocked on your network. Without knowing more details its hard to give a concrete answer however the process needs to be running in order to connect to it and it is not persistent between reboots. This is something you would need to configure. The exe is in %windir%\\system32\\RemoteRecovery.exe. It can be launch manually (use the nomessage to skip the pop up) or put in a Run Command Line step with the following command line (but dont copy and paste due to special characters  like quotes and dashes):", "Cmd /c star %windir%\\system32\\RemoteRecovery.exe nomessage", "Is there a list of features that is not available for ConfigMgr2007? Does Nomad use BITS to copy data to the respective CACHE?", "[From a cool SMS Guy]:", "Very helpful thank for inviting me", "We hope youve all taken away some valuable information and well be holding more webinars soon. Watch this space.", ""], "Author": ["Henry Truong"], "Date": "2012-11-16 00:00:00"}, {"Tags": ["Nomad 2012", "osd", "SCCM", "SCCM 2012", "Webinars"], "URL": "http://blogs.1e.com/2012/11/13/osd-technical-deep-dive-webinar-so-whats-it-about/", "Area": ["Nomad", "OS Deployment", "Webinars"], "Comments": "", "Content": ["Richard Threlkeld, Technical Product Manager, and Mike Terrill, Systems Management Practice Lead, have delivered the first of the two part OSD technical deep dive training sessions. The sessions covered how Nomad 2012 integrates with SCCM 2012 and how easy it is to work with the integrated task sequence steps to create your own OS deployments."], "Author": ["Henry Truong"], "Date": "2012-11-13 00:00:00"}, {"Tags": ["pilots", "POC", "proof", "Proof of concept"], "URL": "http://blogs.1e.com/2012/11/12/does-a-proof-of-concept-poc-really-prove-anything/", "Area": ["1E Consulting", "IT Efficiency"], "Comments": [{"Comment": "Ambareesh, good topic. I agree that POC's can be a false indication of project success if chosen as the only evaluation path.\nI see POC and Pilot as complimentary layers though, improving a projects chances of success if both are well executed. Each has their own purpose and if you try to cover all bases with one or the other, your project can suffer.\nI'll attempt to clarify this assertion with three additional points of consideration; Budget, usability and visibility.\nBudget: Many POC's are launched prior to pricing discussions and the POC may be the bridge to obtaining committment for the project costs. Ideally a pilot would be a pre-purchase scenario where pricing and contracturalagreements have been made and funding is approved based on a setof desired pilot results. The challenge there is having an agreement that is flexible, yet limits risk for both parties.\nUsability: POC's can be used to reinforce the statement \"the vendor can do X\" with \"I know what it takes to do X and how that would map to our environment\". There are often implementation issues that a POC can highlight before you begin to discuss scale and complexity.\nVisibility: POC can be a teams way to introduce a new technology to managementand lobby for support. When you pilot a product, visibility is much broader and you need to address questions about what you are attempting to do, why, and who is chartering the activity. It can be a much more formal process and a difficult place to start when sharing a new vision\nI feel that you could skip POC and go straight to pilot if the situation is right. Going straight from POC to production is risky step and doing both will be a bit slower but offers the hightest proability of success.", "Date": "2012-12-21 07:57:00", "Author": "December 21, 2012 at 7:57 pm"}], "Content": ["It is common practice for enterprises to engage in lengthy and expensive POCs to test vendor products and technologies before making a purchase. This old and archaic method of evaluating products does little but waste precious time and energy. POCs are usually executed in a lab or test environments that are pristine and rarely ever mimic the chaos and complexities that exist in a real production environment. Most vendor products usually end up performing very well in POCs that are conducted in a lab or a test environment.", "Should one really make a major technical decision based on simple tests that have been run in a lab?", "A POC in a lab or test environment is only proving what the vendor has claimed all along. That their products work. The real questions that beg to be asked are:", "Rather than spend wasteful cycles in inconclusive POCs, consider a small pilot deployment in a production environment. If the vendor solution is proven, well tested and backed by successful deployments, they will have no objections to a pilot. If you sense hesitation on their part to deploy their solution straight into a production environment, then you know that they are not certain about their own product capabilities.", "Answers to the questions below will help you decide whether a POC is worth your time and effort:", "A pilot deployment in production not only helps you test the product rigorously, but also gives you a head-start on your project. If the pilot is successful you can just continue with deployment to the rest of the enterprise. Established vendors who are confident in their technologies (with proven deployments elsewhere) will give you the option to walk away from the contract in the unlikely event that the pilot is not successful.", "Once you have done your basic due diligence on the vendor and are ready to move forward, structure the contract such that you begin with a pilot and have the option to exit if the product does not meet your requirements.", "Gone are the days when one could spend endless cycles evaluating new technologies. Today organizations that are quick to respond to business needs, are innovative and leverage technologies that help them stay ahead of competition are the ones who will win.", "staging.1e.com/blogs"], "Author": ["Ambareesh Kulkarni"], "Date": "2012-11-12 00:00:00"}, {"Tags": ["charity", "community", "hurricane sandy", "Sunshine", "superstorm sandy"], "URL": "http://blogs.1e.com/2012/11/07/sunshine-after-the-storm-how-1e-is-helping-those-in-need-after-superstorm-sandy/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["The 1E New York office has not been the same recently, not since Superstorm Sandy came to visit.", "You just have to look around to see the extent of the damage and with people left without power, transport and even homes, something had to be done.", "After making several phone calls to local shelters and talking to people on the ground, it had been decided that the greatest impact helping those in need would be by delivering items like food, batteries and coats directly so we asked our amazing employees here at 1E to drop off donations in our office over the course of the week for express distribution to local shelters.", "For our small office even on our first day of reopening weve had a better response in donations than we had originally anticipated. Its great to see everyone wanting to help out those in need.", "Here at 1E, we also like to keep our employees happy and well fed with regular grocery deliveries to the office. In order to further the efforts of helping those in need, the NY office has agreed to take the funds that were allocated to groceries and donate them to the hurricane relief efforts. Well be doing this the entire month of November and possibly extend into December depending on how the efforts go. Just another example of the wonderful employees we have here at 1E who want to spread sunshine. Its heart-warming to know that everyone wants to do their bit here at 1E  forfeiting a little office luxury in order to better the lives of others.", "Some of our other super 1E individuals have even generously offered their time (and vehicles!) to assist with transporting donations to local shelters in Hoboken and the Rockaways. We want to thank Brian Gebert and Lauren Bermudez in particular for their efforts and contribution. We also like to thank all the other volunteers and contributors who did not want to be named and helped in their own way.", "Apurva Desai, North America Technical Lead at 1E, was one of these individuals that decided to spread some sunshine to those who were less fortunate in Hoboken, New Jersey. His quote shows the range of emotion that individuals were feeling in the aftermath of Sandy and is quite revealing.", "Experience started Saturday morning, as I went to City hall to offer help. The scene was a bit chaotic with a lot of volunteers and not enough leadership or direction. Eventually, we were broken up into teams of 8, and after a good hour of mulling around, sent out to distribute food, water and batteries to local residents. We were given a 4 block area in the north east part of town still without power. We basically had to go door to door to check on people, give them the military ration packs which the national guard had brought to town, and as many bottles of water they wanted. Along with that, we provided them a 1 page paper that city hall had written up which detailed where shelters were, emergency phone numbers, and info on where hot food was being distributed across town. So off we went in 2 cars filled with food water batteries and information. We went door to door for about 2 hours, and were met with a wide variety of emotions. Many were happy that others were thinking of them in these dire times, many were angry about power not being on and were taking it out on us via some unfocused anger, and many were indifferent, passing on what we were bringing to them, as they had already ventured out and gotten whatever they needed. By Saturday a decent part of town was already up and running in terms of businesses and restaurants. Many restaurants and food trucks were also giving out food for free, so those military rations were not exactly a very appetizing option for most. Some of the hard hit areas were a different story Im sure.", "It makes us proud that we have such incredible employees here at 1E who spread sunshine to others. If youre in New York or New Jersey, we hope you stay safe and that some sunshine is spread your way."], "Author": ["Erica Allen"], "Date": "2012-11-07 00:00:00"}, {"Tags": ["charity", "community", "hurricane sandy", "Sunshine", "superstorm sandy"], "URL": "http://blogs.1e.com/2012/11/05/adding-sunshine-after-hurricane-sandy/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": [], "Author": ["Erica Allen"], "Date": "2012-11-05 00:00:00"}, {"Tags": ["appclarity", "IAITAM", "IT Asset Management", "ITAM", "Palm Springs", "Software License Optimization"], "URL": "http://blogs.1e.com/2012/10/24/software-license-optimization-is-an-actual-thing/", "Area": ["AppClarity", "IT Asset Management", "IT Efficiency", "Software License Optimization"], "Comments": "", "Content": ["We came away from the event hugely excited. Software and IT Asset Managers absolutely get that they can be heroes within their organization by optimizing the purchasing, deployment and usage of software. Can they do this on their own though? No, this is a complex challenge.", "We've drifted far away from a simple world of device based licensing. These days even determining compliance requires knowledge of several desktop and server architectures and technologies. It also requires an ability to cope with seemingly arbitrary and vendor specific rules which change with the direction of the wind.", "That's a full time job, so how is anyone going to find the time to optimize?", "Andy Hawkins, Product Manager", "1E Blogs", "", "Photo Credit: Lisa Callagher Chambers"], "Author": ["Andy Hawkins"], "Date": "2012-10-24 00:00:00"}, {"Tags": ["Nomad 2012", "SCCM 2012", "Webinars", "Windows IT Pro"], "URL": "http://blogs.1e.com/2012/10/22/nomad-2012-recognition-in-windows-it-pro-and-upcoming-nomad-webinars/", "Area": ["1E News", "Nomad", "SCCM", "Webinars"], "Comments": "", "Content": [""], "Author": ["Henry Truong"], "Date": "2012-10-22 00:00:00"}, {"Tags": ["Useful Work Assessment"], "URL": "http://blogs.1e.com/2012/10/19/separating-server-value-from-waste-at-data-center-dynamics-chicago/", "Area": ["1E Consulting", "1E News", "1E Products", "Data Center", "IT Efficiency", "NightWatchman", "NightWatchman Server", "Server Efficiency"], "Comments": "", "Content": ["If one agrees that data is the Business most valuable asset, then the data center is the metaphorical treasure chestof the Business. The data center represents a major focal point of capital and expense for the Business, as the container and life support system for its IT assets. While data centers are conceived with a certain return on investment in mind, managing the delivery of this value is difficult once the data center is commissioned.", "As the months and years go by, applications come and go, the Business ebbs and flows, and the residuum of the path of the Business is underused or no longer used IT assets. Unfortunately, these resources carry costs that are not contributing positively to the mission of the Business.", "Hardware waste, in the form of unused or underused servers is prevalent but often undetected in the data center. Surveys suggest that even in well run shops, up to 15% of server assets are returning no value to the Business.", "On servers that are underused, misused, or no longer used, software licenses and maintenance contracts represent an expense that is unnecessary, but difficult to isolate.", "Then of course theres energy wasted with unused IT equipment. We waste energy to power systems that are doing little or nothing for us, and we waste energy on cooling those same boxes on cooling the data processing activity that is only spinning wheels.", "Technical operations staff, monitoring tools, and processes are invested in support of servers. This expense is wasted when invested in servers that are under used or comatose. Many a late-night bridge call are commenced to respond to an alert triggered by an event on a server that is not even serving a purposeful function for the Business.", "As painful as it may seem, we are aware that money is leaking down the drain every month and every year because of this aspect of data center operations.", "Most enterprises today use server utilization measurements as their method to determine whether a server is useful or not. If the server is showing utilization, the assumption is that its purposeful.", "With utilization measurements, we can see that the server is alive, and maybe even that its doing something, but we cannot tell if that something is useful. The server may be executing a stuck process or simple background administrative tasks, but not returning value to the Business.", "What if we could see every process running on every server in the entire estate? What if we were able to categorize each process as either useful or non-useful? What if we could do this for every server, whether physical or virtual?", "What we would then have, is a clear view of where value is being returned, across the whole server estate. We would have a complete accounting of our servers, and the degree to which they are doing useful data processing activity and returning value to the Business.", ""], "Author": ["Bob Landstrom"], "Date": "2012-10-19 00:00:00"}, {"Tags": ["Announcement", "events", "IP Expo 2012"], "URL": "http://blogs.1e.com/2012/10/17/come-visit-us-at-ip-expo-2012/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["", "", "", "", "", "", "", "", "Oh, and maybe pick up a few of our awesome goodies we are giving away whilst youre here  If youre about, swing by and say hello, its always nice to meet people passionate about efficient IT. Henry"], "Author": ["Henry Truong"], "Date": "2012-10-17 00:00:00"}, {"Tags": ["Migrate", "Nomad 2012", "osd", "SCCM 2012", "Supercharge", "System Center Configuration Manager 2012", "Verizon Wireless"], "URL": "http://blogs.1e.com/2012/10/05/1e-nomad-2012-supercharges-the-osd-process-with-verizon-wireless-to-migrate-more-than-30000-systems-in-one-month/", "Area": ["Nomad", "OS Deployment"], "Comments": [{"Comment": "Pingback: Time is ticking for Windows XP support | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Time is ticking for Windows XP support | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["With this revolutionary technology from 1E, Verizon Wireless was able to:", "Probably the biggest thing to note is that this was done with their existing staff and business as usual because Nomad 2012 doesnt require extra consoles, a competing infrastructure, network requirements or device drivers, all of which wouldve added more administrative overhead and risk to the systems.", "We recently saw another organization talk at a recent conference about migrating 90,000 systems  in 16 months  and they proudly boasted that this was a rapid deployment. When compared to what 1E and Verizon Wireless have done together you can see that the speed alone results in less project risk and less time which equates to less cost. In fact if you compare the four month period with a 16 month period this represents an 75% reduction in deployment time."], "Author": ["Henry Truong"], "Date": "2012-10-05 00:00:00"}, {"Tags": ["data center", "data center efficiency", "energy efficiency", "it efficiency"], "URL": "http://blogs.1e.com/2012/09/27/power-productivity-and-the-internet-part-2-all-hands-on-deck/", "Area": ["Data Center", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Power, Productivity and the Internet: Part 1  The core of the problem | 1E Blogs  Insight and debate on IT Efficiency", "Author": "Power, Productivity and the Internet: Part 1  The core of the problem | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["A data center exists to support the data processing within it. Data centers are rarely static and unchanging. Data centers are seldom homogeneous in applications and data within them, or in the type and vintage of data processing equipment they contain. As the business goes about its duty serving customers and earning money month after month, year after year, much changes in the server estate. Servers are introduced to host new applications. Servers are periodically swapped out with newer models. Application configurations change, which also drive changes in server configurations. Virtualization is applied to improve hardware utilization, but self-service provisioning and lack of good governance contributes to virtual sprawl. As this transpires, its impossible to track what each of these servers are really doing, and especially to what extent these servers are delivering value to the business.", "The result is that, at any point in time, we have a lot of investment in servers, some of which are very productive and returning value to the business, others somewhat productive, and some still that are not at all productive. Wed like to know how we can best use the resources that are returning value to the business (those productively used), and especially to remove the resources that are costing energy and money but returning no value at all to the business. As time goes on, a data center accumulates waste, and waste unnecessarily consumes energy.", "This is a problem recognized by data center managers across the industry. In a recent survey commissioned by 1E, it was discovered that 83% of data center managers want a better view of server utilization though most still rely on simple CPU utilization as their primary metric. Sixty five percent of those admit to migrating unused physical servers to virtual instances, thus simply propagating waste.", "The simple fact is that utilization-based approaches simply do not lend the fidelity of information necessary to effectively minimize waste and to offer energy management at the server level.", "On another level, if the data processing is ultimately driving the power drawn by the server, and if we know that certain data processing is productive and useful to the Business while others is background activity (or non-useful to the Business), then what if we could reduce the power drawn by the server during non-useful activity, and restore it to normal for the productive and useful times? This is an extension of the useful work technology and a feature that enables active power management of the server such that server power consumption is reduced when doing only non-useful work, and restored when doing useful data processing. This is different than powering down a server overnight (after all, what business is not 247 these days?). This is actively modulating power drawn based upon knowledge of the value of the data processing, with a view from inside the server itself. This capability helped 1E win Green IT Product of the Year in 2011.", "", ""], "Author": ["Bob Landstrom"], "Date": "2012-09-27 00:00:00"}, {"Tags": ["events", "Webinars"], "URL": "http://blogs.1e.com/2012/09/27/whats-happening-in-october-2012-1e-events-and-webinars/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["October is upon us and we have a whole load of new events and webinars that we are hosting or sponsoring. October 2012 is literally jam packed with activity so get out your calendar and bookmark these dates:", "Join 1E on October 2 for this exclusive IT Efficiency luncheon where you can network with leading IT professionals in New York and learn how to reduce the 80% of IT budgets designated for maintaining existing infrastructure, while \"beefing\" up the leftover portion for innovation.", "Key topics to be shared:", "Agenda:", "Tuesday, October 16, 2012", "Sessions to include", "Wednesday, October 17, 2012", "IP EXPO is the UKs Number ONE Enterprise IT event, bringing you everything you need to know about IT infrastructure under one roof. Join us for two fact-filled and fun days in October to see 240 industry-leading exhibitors and gain valuable insights with 260 stimulating seminar sessions across 18 content theatres featuring thought-provoking keynotes from high profile industry speakers.", "Discover new ways to advance the business", "Twelve months ago, Gartner urged CIOs and senior IT executives to re-imagine, rethink and reconsider what IT means and how it can be applied to the needs and goals of the enterprise. Today, the quest for IT re-imagination has escalated  reflecting a powerful nexus of forces that will require the business to think, work and connect in entirely new ways.", "Join 8,000 of your professional peers  including 2,000 CIOs  at Gartner Symposium/ITxpo 2012. There you will:", "1:30-1:45pm", "Welcome remarks & Sponsor Introductions", ""], "Author": ["Henry Truong"], "Date": "2012-09-27 00:00:00"}, {"Tags": ["data center", "data center efficiency", "energy efficiency", "it efficiency"], "URL": "http://blogs.1e.com/2012/09/26/power-productivity-and-the-internet-part-1-the-core-of-the-problem/", "Area": ["Data Center", "IT Efficiency"], "Comments": "", "Content": ["There are some out there that will claim the heart of the problem is our dependency or desire for more and more data processing. That is, we are a data processing driven society, hurtling toward the planets demise. Well leave that to another discussion and instead assume that the increase of data processing demand in our society is a reflection of progress, commerce, and democracy. If you grant me that assertion, the core of our energy demand problem here is that silicon semiconductor-based data processing systems require energy to operate and produce a good bit of heat as a byproduct of their activity. This is compounded exponentially by a matter of scale.", "Semiconductor devices have become increasingly dense (in terms of number of transistor gates per unit of area), with higher and higher clock speeds. As these increase, so does energy demand. As individual devices become increasingly dense, we correspondingly demand more and more of them. The result is computer rooms with massive quantities of data processing servers, each of which have massively dense semiconductor chips.", "We mentioned a moment ago that a byproduct of the power going to the server is heat. These very dense silicon chips operate at temperatures so high that one could not possibly touch them bare handed. Interestingly, this large amount of heat produced by the semiconductor chips is also a threat to their very health. Consequently, computer servers have lots of fans that pull cool air into the front of the server and blow hot exhaust air out of the back of the server. Yes, fans consume loads of energy too, but the bigger problem still is all this hot exhaust air from all the servers sharing the same space in the data center. For this reason, a large amount of mechanical equipment and resources are a part of data centers as well. These mechanical systems are in the form of air handlers, chillers, cooling towers, and plumbing that is in place simply to remove all this hot air from the data center for the purpose of maintaining a healthy ambient operating temperature for the servers.", "In an average run-of-the-mill data center today, approximately half of the electricity supplied by the utility to the data center makes it to the power cord of the IT (server) equipment. Why only half? Well, the mechanical equipment that cools the data center requires a large amount of it, and there are other losses along the way due to common inefficiencies in power distribution and mechanical and electrical technology (one never gets 100% of what one puts in). To make matters worse still, of the electricity which actually makes it to the IT power cord, much less than that actually goes toward actual data processing due to fan energy consumption, conversion losses, and other subsystems within the server itself.", "In summary, we need lots of data processing, and data processing technology consumes large amounts of energy.", "Once can go on about this, but suffice to say the evidence is clear that energy consumption by data processing facilities is a widely recognized problem, and much is being done in a coordinated and public way, to provide relief. Its improper to draw conclusions about a specific data center facility, based upon news of a high profile business with completely different data centers. Some energy efficiency techniques are available to everyone everywhere, and many are not. This is a complex subject with significant nuance, and generalizations can come with risk.", "In the end, the Business has invested quite a lot of money in its data center, and to acquire the servers and software within it. Over the years, the Business spends quite a lot of money maintaining and supporting these systems, and is also spending quite a lot of money on energy for power and cooling."], "Author": ["Bob Landstrom"], "Date": "2012-09-26 00:00:00"}, {"Tags": ["IT", "Tennis"], "URL": "http://blogs.1e.com/2012/09/24/what-can-it-learn-from-the-us-open-wimbledon-ball-boys-girls/", "Area": ["IT Efficiency"], "Comments": "", "Content": ["Heres a snippet of the article Ambareesh has published:", "Have you ever noticed the US Open or Wimbledon ball boys or girls during a tennis match? No?", "That is because one isn't meant to. These boys & girls work, train and practice extremely hard to stay unnoticed. If one doesn't notice these boys & girls, then they have done a fantastic job. These boys & girls have one aim, which is to keep the game going"], "Author": ["Henry Truong"], "Date": "2012-09-24 00:00:00"}, {"Tags": ["Competition", "Efficient ICT", "efficient it"], "URL": "http://blogs.1e.com/2012/09/21/efficient-ict-2012-competition-winners-1e-branded-x-mini-ii-speakers/", "Area": ["1E Community", "1E News", "Events"], "Comments": "", "Content": ["Well done again to the named and unnamed winners of our 1E prize draw and if you did not win, we hope youve taken away some useful information on how to make your IT more efficient.", ""], "Author": ["Henry Truong"], "Date": "2012-09-21 00:00:00"}, {"Tags": ["Operations Manager 2012", "Orchestrator 2012", "powershell"], "URL": "http://blogs.1e.com/2012/09/20/1e-contributes-to-authoritative-text-on-microsoft-system-center-2012-operations-manager/", "Area": ["1E Consulting", "1E News", "Awards", "Data Center", "IT Efficiency", "SCCM", "Server Efficiency"], "Comments": "", "Content": ["This soon to be released book, is the authoritative text for integrating OpsMgr 2012 to manage cloud and datacenter applications and services, and provides comprehensive coverage of all aspects of data center IT infrastructure management.", "Scott Moss is the author of Chapter 23, covering PowerShell, and joins an expert team of Operations Manager MVP authors contributing to this text. The book will be used globally by administrators, consultants and other IT professionals seeking guidance with this new data center infrastructure product."], "Author": ["Bob Landstrom"], "Date": "2012-09-20 00:00:00"}, {"Tags": ["data center", "data center efficiency", "useful work", "Useful Work Assessment"], "URL": "http://blogs.1e.com/2012/09/14/1e-introduces-useful-work-based-data-center-governance-at-data-center-dynamics-converged-2012-washington-dc/", "Area": ["1E Consulting", "1E News", "1E Products", "ActiveEfficiency", "Data Center", "Events", "IT Efficiency", "NightWatchman", "NightWatchman Server", "Software License Optimization"], "Comments": "", "Content": ["Data center performance metrics have struggled to accurately represent business value of IT assets invested in the enterprise data center. Data center metrics are either constrained to raw power usage data, or make vague approximations about business-relevant performance through assumptive percentages or abstract proxies.", "The legacy of data center metric activity over the past decade has been largely focused on energy efficiency. This is good because of the enormous quantities of energy consumed by contemporary data centers, and the significant resulting amounts of carbon emissions. The work done by the Green Grid and others toward the definition of PUE (Power Usage Effectiveness) enjoys the bulk of mindshare in this regard. However, metrics such as PUE and DCiE are essentially limited to the end of the power cord to the IT kit. Furthermore, these metrics give no insight into the value to the business of the data processing happening at the end of that power cord, nor to the costs implied by what that cord is powering.", "There have been attempts at including business relevance into data center metrics, and to make these metrics less exclusive to the facility side of the equation.", "1E Data Center Practice Lead, Bob Landstrom", "The Corporate Average Datacenter Efficiency (CADE) metric, developed by The Uptime Institute and the 451 Group is one such example. Within CADE there is the notion of facilities (the plant) and assets (IT), and also of efficiency modulated by utilization. Many have tossed darts at CADE for being difficult to understand, difficult to compute, and producing counter intuitive results. CADE though was one of the first metrics to hold a place for useful work. The ability to measure useful work was left by the way by CADE, ultimately suggesting a percentage value be used in its place.", "The Fixed to Variable Energy Ratio (FVER) was more recently released into the wild by authors at the British Computing Society (BCS). FVER does several novel things, most notably recognizing that some data center energy consumption is fixed and does not change, while another bit of energy consumption is variable and driven by the data processing taking place in the data center (this is the useful part). FVER goes on to suggest that we select a proxy for the data processing activity and use that to represent value of this investment to the business. A proxy can be something like file transfers, songs streamed, transactions, and so on.", "Still, whether with CADE or with FVER, inclusion of how our data center is delivering real business value by existing performance metrics is left to intuitive estimation or interpretation by abstraction.", "Traditionally, server activity is measured using basic utilization values gleaned from network and systems management tools. We gather CPU utilization, NIC activity, and so on. We see vital signs of the server, but it is essentially a black box to us. That is, if we see 30% server utilization for example, we are left with our own best guess whether that activity is purposeful or not. Because we lack the clarity of information about this utilization, we most often make the decision to maintain this server for fear we will interrupt a business process if we take steps to decommission it.", "We call this the Lights are on but nobodys home approach. That 30% utilization may be a stuck process. It may be due to backup or administrative routines. It may be a screen saver. It could be lots of things, but whether all or some of this 30% activity is purposeful to the business or not can only be determined by inference and assumption.", "What if we actually measured data processing activity inside the server? What if we had the ability to see each and every process running on the server and categorize it as useful or non-useful; critical or non-critical? What if we were able to collect this information and correlate it, graph it, trend it, for every server in the estate whether physical or virtual? This is, in fact, what the Useful Work Assessment offered by 1E does.", "", ""], "Author": ["Bob Landstrom"], "Date": "2012-09-14 00:00:00"}, {"Tags": ["microsoft", "nightwatchman server", "nightwatchman server edition", "Private Cloud"], "URL": "http://blogs.1e.com/2012/09/14/supercharging-private-cloud-efficiencies/", "Area": ["IT Efficiency", "NightWatchman", "NightWatchman Server"], "Comments": "", "Content": ["Andy Hawkins, Product Manager at 1E"], "Author": ["Andy Hawkins"], "Date": "2012-09-14 00:00:00"}, {"Tags": ["events", "Webinars"], "URL": "http://blogs.1e.com/2012/09/12/whats-happening-in-september-2012-1e-events-and-webinars/", "Area": ["1E News", "Events", "IT Efficiency", "Webinars"], "Comments": "", "Content": ["Here at 1E we love giving back to the community that gives us so much. We love helping our organizations make the most out of our products to maximize their savings and increase the efficiency of their IT. Technology keeps evolving with newer features constantly being released and manipulating these features becomes more complex. So in order to help you, the amazing IT community out there, were hosting a few webinars and sponsoring some events. Heres a short list of what we have planned in September for you:", "You'll hear from speakers on a variety of real-world topics that range from desktop to data center and into the cloud. We are very excited to have Wally Mead of Microsoft joining us, and he will be presenting three sessions at The Rally!", "Twenty-plus sessions, delivered by some of the industry's sharpest talents, discussing and demonstrating how to leverage Microsoft System Center and Windows Server 2012 to address challenges such as:", "September 27th at The Uptown Theater in Kansas City, Missouri.", "Join us Friday, September 28th for an action packed day of demos and deep dives featuring one of CTSMUG's finest  Wally Mead. The full agenda will be published the week of the event, but you can expect several topics specific to ConfigMgr SP1, such as managing Windows 8, enhancements to OS deployment, software distribution and more.", "Agenda:", "1E Blogs"], "Author": ["Su Kent"], "Date": "2012-09-12 00:00:00"}, {"Tags": ["451 Research", "Nomad 2012", "Research Note"], "URL": "http://blogs.1e.com/2012/09/07/451-research-note-for-nomad-2012/", "Area": ["1E News", "Nomad"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-09-07 00:00:00"}, {"Tags": ["migration", "osd", "SCCM OSD", "windows 7", "windows xp"], "URL": "http://blogs.1e.com/2012/09/03/so-why-are-people-still-on-xp/", "Area": ["Nomad", "OS Deployment", "Shopping", "Windows 7 Migration", "Windows XP"], "Comments": [{"Comment": "Its simple, people are still using Windows XP because they prefer, like, feel cosy / secure, don't want to spend money on a new OS not offering much more / isn't radically different enough to justify an upgrade. I recently upgraded from XP x86 to XP x64 and its just GREAT!!! With AHCI drivers, IE8, MP11 and a modern visual styleintegrated it is excellent. Windows XP was made too good for MS's own good, which isn't a bad thing, they could have continued support for it, kep't on selling it and still have made lots of money. MS could even have released an upgraded / improved \"second edition\" and it would have sold like hotcakes. I am sticking with XP until its absolutely impossible to anymore.", "Date": "2012-09-18 06:33:00", "Author": "September 18, 2012 at 6:33 am"}, {"Comment": "While I agree with the sentiments you've written Jennifer, I believe Windows 7 is better than XP. It's actually easier to navigate. It's faster and there are many enhancements and features for both usability (aero snap and jump lists are incredibly handy) and features (such as branch cache and bitlocker). It just takes a bit of time to get used to. Now when I got back to an XP machine as a productivity station, I find that the lack of these small features hinder my productivity. Windows 7 is easier to manage, deploy and troubleshoot because of the little changes they've made such as WinPE and the way Windows boots up. The abstraction from hardware makes them easier to image and rebuild machines.", "Date": "2012-09-18 11:51:00", "Author": "September 18, 2012 at 11:51 am"}, {"Comment": "It's not as easy to upgrade if Windows 7 doesn't work with home grown web applications and then the costs, upwards of hundreds of thousand to a million.\nWe are upgrading those job functions doesn't rely on those applications but the majority of our systems are in our call centers.\nBesides the technical aspects, if they keep the real Windows Classic start menu that would reduce any training or documentation needed for the non techusersin call centerswho freak with shortcuts appearing and now they have to change their \"work process\".\n\n", "Date": "2012-09-27 07:53:00", "Author": "September 27, 2012 at 7:53 pm"}, {"Comment": "Hi Harvey\nYou are absolutely correct. We've found with the majority of our customers that the biggest \"Application Compatability\" challenge with moving to Windows 7 has been in-house web applications that rely on Internet Explorer 6.\nWe at 1E don't have any products that can help with migrating or updating web applications, but there's a lot of good Microsoft Resources and links at http://www.ie6countdown.com/\n\n", "Date": "2012-09-28 12:09:00", "Author": "September 28, 2012 at 12:09 pm"}], "Content": ["There seems to be a consensus that the larger organizations are the ones that are having difficulty migrating due to line of business applications not being compatible for browser or the Windows 7 OS, they do not have the expertise or budget or time. They dont have the automation in place, they have a lot of user data and applications they need to migrate and they dont have the infrastructure to handle the migration. I could go on. They all say the same thing:", "The project is too complex, too lengthy and will be too costly. The cons simply outweigh the pros.", "1E Blogs"], "Author": ["Henry Truong"], "Date": "2012-09-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/08/22/1e-announces-new-customer-with-1000000-computers/", "Area": ["1E Community"], "Comments": "", "Content": [], "Author": ["Geoff Collins"], "Date": "2012-08-22 00:00:00"}, {"Tags": ["1E Ambassador Jackets", "Ambassador Program jackets", "appclarity"], "URL": "http://blogs.1e.com/2012/08/16/hey-can-i-have-a-jacket/", "Area": ["AppClarity", "IT Efficiency"], "Comments": "", "Content": [], "Author": ["Geoff Collins"], "Date": "2012-08-16 00:00:00"}, {"Tags": ["appclarity", "Arup", "Dan Richings", "Richard Barnes", "SCCM 2012"], "URL": "http://blogs.1e.com/2012/08/15/i-saved-arup-500000-on-software-licenses-with-1e-appclarity/", "Area": ["AppClarity", "ConfigMgr", "SCCM"], "Comments": [{"Comment": "Pingback: Hey! Can I have a jacket?1E Blogs  Insight and debate on IT Efficiency", "Author": "Hey! Can I have a jacket?1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["This is what Richard had to say about AppClarity:", "AppClarity looks to be another exciting product from 1E, a key feature of which gives a clear view of application compliance by detailing license count against install amount. This gives a much needed transparency so that additional unnecessary expenditure doesn`t occur, and which allows us to reallocate unused licenses around the global business,", "Another feature that stands out is the detection of installed but unused software. This is an administrative nightmare with software worth thousands sitting dormant on computers  an imbalance that is often hard to identify, let alone tackle. AppClarity will be tightly integrated into Microsoft Configuration Manager, enabling us to maximize our existing investment in the platform and reveal the information we need to improve our software efficiency levels,", "Richard Barnes, Associate, Global Automation Team Leader, Arup.", "Its not an easy life driving efficiency initiatives so as well giving them a tool that saves them time, money and effort in AppClarity, weve decided to send them each an AppClarity jacket to save them from the British summer:", "Dan has a particular love of vendor t-shirts, so I sent him a proper one to spread the word of his heroism internally:", "Geoff Collins"], "Author": ["Geoff Collins"], "Date": "2012-08-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/08/09/modifying-configmgr-2012-package-properties/", "Area": ["1E Consulting", "1E Products", "ConfigMgr", "Nomad", "SCCM"], "Comments": "", "Content": ["If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["John DeVito"], "Date": "2012-08-09 00:00:00"}, {"Tags": ["Curiosity", "Deployment", "Extreme OSD", "Mars", "os deployment", "osd", "Rover", "SCCM"], "URL": "http://blogs.1e.com/2012/08/07/extreme-osd-upgrading-the-os-of-the-curiosity-rover-on-mars/", "Area": ["IT Efficiency", "Nomad", "OS Deployment"], "Comments": [{"Comment": "What an example to illustrate the power of NOMAD! Like it. Completely agree, OSD on earth has to be easier than on Mars and with NOMAD am sure it is. I've seen it in action and cannot deny that NOMAD can make life of administrators and migration experts so much easier and stress free.", "Date": "2012-08-07 10:05:00", "Author": "Sushil Karwa"}], "Content": [], "Author": ["Andy Hawkins"], "Date": "2012-08-07 00:00:00"}, {"Tags": ["lnk", "Sharepoint 2010", "shortcut link", "uploading files"], "URL": "http://blogs.1e.com/2012/08/06/how-not-to-upload-files-to-sharepoint-using-sharepoint-workspace-2010/", "Area": ["Insidev1ew"], "Comments": "", "Content": ["Everything was working as expected so far. I saw the standard Add Files type dialog that we are all familiar with. I started at the C: drive and started working through the file system, looking for the file I wanted to upload. I double clicked to open a shortcut to a folder andBAM!", "", "I kept trying to pause the uploads with no success. So I rebooted (with the Wireless turned off). After I logged in I could see that the file uploads listed in Upload Center were now paused. I started trying to delete them. No love there, either.", "I went into SharePoint Workspace and deleted my connections to the SharePoint server and then I was able to delete files from Upload Center. So I deleted a few files and looked at my Work Files folder to make sure they were not deleted there. They were not. So now I was ready to delete all of the files in the Upload Center cache.", "Unfortunately, as I said a little earlier, you cannot multi-select files from Upload Center. You have to delete them one-by-one. With hundreds and hundreds of files to delete I decided that I would write a VBScript to cycle through them rather than spend a marathon session chippinger, clickingaway at the problem.", "Once all of the files were deleted I was able to reconnect SharePoint Workspace to all of the sites I had previously configured.", "I uploaded the file by navigating through Explorer and doing a Copy & Paste of the desired file into SharePoint Workspace.", "", "John DeVito | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["John DeVito"], "Date": "2012-08-06 00:00:00"}, {"Tags": ["nomad", "Nomad 2012", "Operating System Deployment", "osd", "SCCM", "SCCM OSD", "Win7", "windows 7"], "URL": "http://blogs.1e.com/2012/07/30/notes-from-the-field-%e2%80%93-how-1e-has-supercharged-osd-with-nomad-2012/", "Area": ["IT Efficiency", "Nomad", "OS Deployment", "Windows 7"], "Comments": [{"Comment": "Pingback: Extreme OSD - Upgrading the OS of the Curiosity Rover on Mars1E Blogs  Insight and debate on IT Efficiency", "Author": "Extreme OSD - Upgrading the OS of the Curiosity Rover on Mars1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: 1E Nomad 2012 supercharges the OSD process with Verizon Wireless to migrate more than 30,000 systems in one month | 1E Blogs  Insight and debate on IT Efficiency", "Author": "1E Nomad 2012 supercharges the OSD process with Verizon Wireless to migrate more than 30,000 systems in one month | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": [], "Author": ["Su Kent"], "Date": "2012-07-30 00:00:00"}, {"Tags": ["Bandwidth Efficiency", "Bandwidth Throttling", "nomad", "nomad enterprise", "Reverse QoS", "Reverse Quality of Service"], "URL": "http://blogs.1e.com/2012/07/06/how-does-nomad-enterprise-determine-network-bandwidth-and-protect-your-network-ping-nope-try-reverse-qos-tm-instead-2/", "Area": ["IT Efficiency", "Nomad"], "Comments": [{"Comment": "Pingback: Notes from the field  How 1E has supercharged OSD with Nomad 20121E Blogs  Insight and debate on IT Efficiency", "Author": "Notes from the field  How 1E has supercharged OSD with Nomad 20121E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Extreme OSD - Upgrading the OS of the Curiosity Rover on Mars1E Blogs  Insight and debate on IT Efficiency", "Author": "Extreme OSD - Upgrading the OS of the Curiosity Rover on Mars1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: 1E OSD Technical Deep Dive  Questions and Answers from the webinar | 1E Blogs  Insight and debate on IT Efficiency", "Author": "1E OSD Technical Deep Dive  Questions and Answers from the webinar | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": [], "Author": ["Su Kent"], "Date": "2012-07-06 00:00:00"}, {"Tags": ["Active Efficiency", "it efficiency"], "URL": "http://blogs.1e.com/2012/06/26/efficiency-triumphs-through-game-changing-technologies-at-le-mans/", "Area": ["ActiveEfficiency", "IT Efficiency"], "Comments": "", "Content": ["Audi came top by doing more with less  with half the weight, half the drag, half the power, all of which contributed to halve the fuel and tire consumption and outperform the competition.", "Looking at the automotive market, fuel economy sells but in reality consumers also want highly performant cars that meet their needs. To date, hybrid motor technology has been seen as simply eco-efficient, yet rather dull and slow. By coming first and second in this endurance race, perceptions are shifting. Its more than just eco-efficiency now  its about speed and agility as well.", "In developing its race car to be efficient, streamlined and agile, Audi advances its knowledge and technology for road car development. Using advanced carbon materials to build the vehicle has resulted in a stronger lighter car enabling greater agility.", "Audis engine is lower powered than before, hence the lightweight carbon chassis which keeps the power to weight ratio high. It manages to do more with less.", "After this first ever win by a hybrid race car at Le Mans there will be continued emphasis on efficiency.", "Sumir Karayi | CEO", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Sumir Karayi"], "Date": "2012-06-26 00:00:00"}, {"Tags": ["CM 2012", "ConfigMgr 2012", "SCCM 2012", "System Center Configuration Manager 2012"], "URL": "http://blogs.1e.com/2012/06/22/where-did-the-apps-go-in-configmgr-2012/", "Area": ["ConfigMgr", "SCCM"], "Comments": "", "Content": ["Object type", "Collection resources", "Deployment", "Application Catalog", "Software Center", "Application", "Users or groups", "Yes", "After installation is initiated successfully from the Application Catalog", "Users or groups", "Yes", "After the application is approved", "Users or groups", "Required deployment", "No", "Yes", "Computers", "Available or required deployment", "No", "Yes", "Package and program", "Users or groups", "Available deployment", "Yes", "After installation is initiated successfully from the Application Catalog", "Users or groups", "Required deployment", "No", "Yes", "Computers", "Available or required deployment", "No", "Yes", ""], "Author": ["Ed Aldrich"], "Date": "2012-06-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/06/20/getting-started-with-system-center-2012-sp1-ctp2-for-configuration-manager/", "Area": ["1E Consulting", "ConfigMgr", "SCCM", "TechEd", "Windows 8"], "Comments": "", "Content": ["System Center 2012 Service Pack 1 was announced at TechEd North and CTP2 was made publicly available on Friday of that week. There are number of features that have been added to this release, mostly importantly support for the upcoming Windows 8. There are a few prerequisites that are required and you can download them from the following links:", "Once you have downloaded the Service Pack, you will also need to download the prerequisite files. This can be done when installing the service pack if your system is Internet connected. However, if you are working in an isolated lab environment you can download the prerequisite files ahead of time using the setupdl.exe (found in SMSSETUP\\BIN\\X64) from an Internet connected machine. Only 16 files (roughly 248 MB) are downloaded, as opposed to 406 files (roughly 395 MB) for RTM.", "If you try installing the Service Pack before installing the Windows ADK, it will give you a Failed Status for the User State Migration Tool, Windows Deployment Tools and Windows Preinstallation Environment as seen below.", "So the first thing to do is to install the necessary Windows ADK features. Kick off the ADK Setup (adksetup.exe) from the download link above and select the following features to install:", "Once this is finished, then you are ready to begin the Service Pack 1 CTP Setup. The install is pretty straight forward, starting with the splash.hta welcome screen, click Install.", "Review the Before You Begin screen and click Next.", "On the Getting Started screen, choose Upgrade an existing Configuration Manager 2012 installation (which is the default) and click Next.", "On the Product Key screen enter your license key (unless you are using evaluation software).", "On the Microsoft Software License Terms screen, accept the license terms and click next.", "On the Prerequisite Licenses screen, accept the license terms and click Next.", "On the Prerequisite Downloads screen, either enter a path to download the prereqs or select a folder that contains the previously downloaded files.", "On the Settings Summary screen, verify the setup type and click Next.", "On the Prerequisite Check screen, once all of the prereq checks have passed, click Begin Install.", "Once the core setup is complete, the following screen will be displayed."], "Author": ["Mike Terrill"], "Date": "2012-06-20 00:00:00"}, {"Tags": ["microsoft", "Microsoft Mystery Event", "Microsoft Surface", "Microsoft Surface Tablet", "Microsoft Tablet", "Surface Tablet", "Windows 8", "Windows 8 Surface Tablet", "Windows 8 Tablet", "Windows 8 Tablet Surface", "Windows Surface"], "URL": "http://blogs.1e.com/2012/06/20/microsoft-announces-windows-8-tablet-called-surface-at-their-mystery-event-in-los-angeles/", "Area": ["1E News", "Windows 8"], "Comments": "", "Content": [], "Author": ["Henry Truong"], "Date": "2012-06-20 00:00:00"}, {"Tags": ["1E Nomad", "Microsoft System Center 2012", "SCCM", "TechEd"], "URL": "http://blogs.1e.com/2012/06/15/teched%e2%80%99s-announcment-of-sccm-2012-sp1-%e2%80%93-a-step-in-the-right-direction/", "Area": ["1E News", "ConfigMgr", "NightWatchman", "NightWatchman Server", "TechEd"], "Comments": "", "Content": [], "Author": ["Henry Truong"], "Date": "2012-06-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/06/14/idc-server-shipments-down/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman", "Nomad", "Server Efficiency"], "Comments": "", "Content": ["", ""], "Author": ["Andy Hawkins"], "Date": "2012-06-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/06/13/wally-mead-2-july-reading/", "Area": ["1E Community", "1E News", "ConfigMgr", "Events", "IT Efficiency", "SCCM", "TechEd"], "Comments": "", "Content": ["", "- Patch and Settings Management", "- Deep Application Management"], "Author": ["Karolina Shaw"], "Date": "2012-06-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/06/11/euro-2012/", "Area": ["1E Community", "1E News", "ConfigMgr", "Events", "TechEd"], "Comments": "", "Content": [], "Author": ["Karolina Shaw"], "Date": "2012-06-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/06/07/teched-europe-2012/", "Area": ["1E Community", "1E News", "ConfigMgr", "Events", "IT Efficiency", "SCCM", "TechEd"], "Comments": "", "Content": [], "Author": ["Karolina Shaw"], "Date": "2012-06-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/06/07/next-system-center-user-group-meeting-26th-june-new-york/", "Area": ["1E News", "1E Products", "AppClarity", "Events", "NightWatchman", "Nomad", "SCCM"], "Comments": "", "Content": [], "Author": ["Ed Aldrich"], "Date": "2012-06-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/25/what-does-driving-an-electric-car-have-in-common-with-pc-power-management/", "Area": ["1E Community", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": "", "Content": [], "Author": ["Mark Blackburn"], "Date": "2012-05-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/24/build-scalability-into-your-configmgr-2012-primary-site/", "Area": ["1E Consulting", "ConfigMgr", "SCCM"], "Comments": "", "Content": [""], "Author": ["Bruce Hethcote"], "Date": "2012-05-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/16/system-center-user-group-expands-to-new-york/", "Area": ["1E News", "1E Partners", "SCCM"], "Comments": "", "Content": [], "Author": ["Karolina Shaw"], "Date": "2012-05-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/15/parker-hannifin-efficient-it-saves-millions/", "Area": ["1E Customers", "1E News", "1E Products", "IT Efficiency"], "Comments": "", "Content": [], "Author": ["Karolina Shaw"], "Date": "2012-05-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/08/microsoft-management-summit-comes-to-europe-this-week/", "Area": ["MMS"], "Comments": "", "Content": [], "Author": ["Pauline Hagan"], "Date": "2012-05-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/03/nightwatchman-server-edition-2-9-is-here/", "Area": ["1E News", "1E Partners", "1E Products", "Data Center", "Green IT", "IT Efficiency", "NightWatchman", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Andy Hawkins"], "Date": "2012-05-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/01/new-features-for-shopping-4-5/", "Area": ["1E Products", "Shopping"], "Comments": "", "Content": ["Dave Harding | Senior Product Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Dave Harding"], "Date": "2012-05-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/05/01/latest-version-of-nightwatchman-enterprise-is-here/", "Area": ["NightWatchman"], "Comments": "", "Content": [], "Author": ["Mark Blackburn"], "Date": "2012-05-01 00:00:00"}, {"Tags": ["PC power management; sustainability; sustainable IT; awards; energy efficiency"], "URL": "http://blogs.1e.com/2012/04/25/2012-superstars-of-sustainable-it/", "Area": ["1E News", "1E Products", "Awards", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": "", "Content": [], "Author": ["Karolina Shaw"], "Date": "2012-04-25 00:00:00"}, {"Tags": ["innovation; iteration-free; Google 20 percent; 1E", "musings"], "URL": "http://blogs.1e.com/2012/04/24/iteration-free-innovation-the-1e-way/", "Area": ["1E Community"], "Comments": "", "Content": [], "Author": ["Karolina Shaw"], "Date": "2012-04-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/24/we-ve-made-a-few-changes-to-appclarity-and-shopping/", "Area": ["1E News", "1E Products", "AppClarity", "Shopping", "Windows 7"], "Comments": "", "Content": ["Why did we do this? Well, two reasons really:", "", "Dave Harding | Senior Product Manager", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Dave Harding"], "Date": "2012-04-24 00:00:00"}, {"Tags": ["patch management"], "URL": "http://blogs.1e.com/2012/04/23/1e-is-green-it-company-of-2012-its-official/", "Area": ["1E Community", "1E News", "1E Products", "Awards", "NightWatchman", "NightWatchman Server", "Nomad", "PC Power Management", "Server Efficiency", "Server Power Management", "Shopping", "WakeUp"], "Comments": "", "Content": ["A big thanks to our customers from ERM, Alliance Boots and Balfour Beatty WorkPlace who joined our celebrations last night. An equally big shout out toBrian Wall, editor of Green IT magazine; Josh Boulton, publisher and all of our friends at BTC for a very enjoyable evening at the Zoo.", "Well be watering our Lily with pride and look forward to the fourth Green IT awards in 2013!"], "Author": ["Karolina Shaw"], "Date": "2012-04-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/22/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-10-client-configuration/", "Area": ["1E News", "Events", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/22/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-9-client-health-and-efficiency/", "Area": ["1E News", "Events", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/19/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-8-user-in-control/", "Area": ["1E News", "Events", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/18/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-7-distribution-points/", "Area": ["1E News", "Events", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/18/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-6-scalability/", "Area": ["1E News", "Events", "MMS"], "Comments": [{"Comment": "I'm interested in your source for the 100 distribution point limit in ConfgMgr 2007. I can see where the documented limit for ConfigMgr 2012 is at 250 (http://technet.microsoft.com/en-us/library/gg682077), but had never heard of the limit for ConfigMgr 2007. I am running a ConfigMgr Primary site with over 300 distribution points (mostly branch DP's) and have relatively few issues.", "Date": "2012-06-20 06:36:00", "Author": "June 20, 2012 at 6:36 pm"}, {"Comment": "Hi Dave. The information on recommended DP limits is at http://technet.microsoft.com/en-us/library/bb680869.aspx. The article indicates that 100 DPs is the maximum supported number of DPs. Of course, as your experience shows, \"mileage\" may vary based on several factors, also mentioned in the article.", "Date": "2012-06-26 01:46:00", "Author": "John DeVito"}], "Content": [], "Author": ["Su Kent"], "Date": "2012-04-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/18/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-5-managing-clients-over-the-internet/", "Area": ["1E News", "Events", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/17/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-4-administration/", "Area": ["1E News", "Events", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/17/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-3-site-to-site-replication/", "Area": ["1E News", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-17 00:00:00"}]