[{"Tags": [], "URL": "http://blogs.1e.com/2011/07/08/ta-da-1e-nightwatchman-and-cisco-energywise-cl11/", "Area": ["1E News", "1E Partners", "1E Products", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Ta-da! 1E NightWatchman and Cisco #EnergyWise #cl11 - 1E Blog", "Author": "Ta-da! 1E NightWatchman and Cisco #EnergyWise #cl11 - 1E Blog"}], "Content": ["Waste is endemic in IT. Independent research has revealed that 15 percent of servers do nothing useful and 50 percent of PCs are left on overnight. This waste results in billions of dollars of wasted energy across campus IT and data center facilities each year.", "Organizations are struggling to address this inefficiency, because they lack a standardized way to measure, report, and control energy use across the corporate infrastructure. Significant cost is being spent on disparate attempts to measure and control energy use."], "Author": ["Rod Trent"], "Date": "2011-07-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/08/download-the-cisco-live-mobile-app-and-start-playing-for-a-chance-to-meet-william-shatner-cl11/", "Area": ["1E News", "Data Center", "Events", "Green IT", "IT Efficiency", "NightWatchman Server", "Nomad", "Server Power Management"], "Comments": [{"Comment": "Pingback: Download the Cisco Live mobile app and start playing for a chance to meet William Shatner! #cl11 - 1E Blog", "Author": "Download the Cisco Live mobile app and start playing for a chance to meet William Shatner! #cl11 - 1E Blog"}, {"Comment": "The app isnt working on my iPhone 3G.  It keeps crashing  That really sucks cause Id like the chance to meet Mr. Shatner  ", "Date": "2011-07-11 09:02:00", "Author": "July 11, 2011 at 9:02 pm"}], "Content": ["Download the Cisco Events app for free and start earning points and prizes by checking into different Cisco activities and websites. View program highlights and reference materials and link to peers, Cisco experts, and partners all from one application!", "Read about the contest, download the app, and get the full information at this link:"], "Author": ["Rod Trent"], "Date": "2011-07-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/08/pre-arrange-a-11-meeting-with-1e-at-cisco-live-cl11/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Pre-Arrange a 1:1 Meeting with 1E at Cisco Live #cl11 - 1E Blog", "Author": "Pre-Arrange a 1:1 Meeting with 1E at Cisco Live #cl11 - 1E Blog"}], "Content": ["Heres the link:", "http://staging.1e.com/mailers/requestmeetingform.aspx", "See you next week!"], "Author": ["Rod Trent"], "Date": "2011-07-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/07/more-useful-cisco-live-collateral-from-1ecab-fee-guide-cl11/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: More useful Cisco Live collateral from 1E", "Author": "More useful Cisco Live collateral from 1E"}, {"Comment": "Pingback: More useful Cisco Live collateral from 1Ecab fee guide #cl11 - 1E Blog", "Author": "More useful Cisco Live collateral from 1Ecab fee guide #cl11 - 1E Blog"}], "Content": ["The cab lines move quickly outside the airport, the trip is short, and the cost is nominal. Some cabs do not accept credit cards in Vegas, so its always good to carry a $20 bill with you even though the cost of the cab ride will be much less.", "Keep in mind you can also share a cab ride. While you are walking through the roped-off cab maze outside the baggage claim area, you can usually find a couple people who dont mind sharing the cost of the ride. Dont be bashful. Most of the folks in the cab line are Cisco geeks, just like you.", "Heres a cab fee guide weve prepared that you can look through, or download and keep on your mobile device. It gives you a pretty accurate guess as to how much the trip will cost."], "Author": ["Rod Trent"], "Date": "2011-07-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/07/what-1e-is-bringing-to-cisco-live-and-why-you-should-care-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "Green IT", "NightWatchman Server", "Nomad", "Server Power Management"], "Comments": [{"Comment": "Pingback: What 1E is bringing to Cisco Live (and why you should care) #cl11 - 1E Blog", "Author": "What 1E is bringing to Cisco Live (and why you should care) #cl11 - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-07-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/07/1e-expands-into-germany/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1E expands into Germany! - 1E Blog", "Author": "1E expands into Germany! - 1E Blog"}], "Content": ["Gheorghievici-Pohl joins 1E with 30 years experience in the enterprise software industry, having worked for organizations including VMware, Amdocs and Microstrategy. His expertise with physical and virtual infrastructures puts him at the forefront of efficient IT practices, making him ideally positioned to grow 1Es customer base and lead the companys sales and marketing activities in the DACH region. Gheorghievici-Pohl and his team will serve customers of all sizes in Germany, Austria and Switzerland and will initially be based in Frankfurt.", "Germany has a national commitment to reduce national carbon emissions by 40% by 2020 and the government has allocated 25m to IT Goes Green initiatives. I am energized by the challenge to bring our expertise to the DACH region. The time is now, he concludes.", "In 2010, 1E experienced record 60% growth, adding four million licenses of 1E software to its existing customer base. The EMEA operation of 1E holds key customer accounts including CSC, Dell, HSBC, Nestl and Syngenta."], "Author": ["Rod Trent"], "Date": "2011-07-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/06/1e-appoints-dr-steve-garnett-as-non-executive-director/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1E appoints Dr. Steve Garnett as Non-Executive Director - 1E Blog", "Author": "1E appoints Dr. Steve Garnett as Non-Executive Director - 1E Blog"}], "Content": ["Dr. Garnett has previously held executive management positions at three software organizations, which grew to become recognized among the most successful software companies in history. He joined Oracle Corporation prior to its IPO in 1986, where he spent 12 years and saw it grow to become the worlds second largest software company. At Oracle, he held a variety of sales and technical roles including Director of UK sales, Vice President European Marketing & Alliances and was the youngest member of the European management team.", "He then joined Siebel Systems in 1996 as Vice President of Europe and was a member of the founders circle. Within eight years, the company became the worlds fifth largest software company. In 2003, together with former Oracle colleague Marc Benioff, Dr. Garnett became part of the executive team at salesforce.com, helping take the company public in 2004 and seeing it receive a Top 100 Most Innovative Companies nomination from BusinessWeek.", "Of his new role, Dr. Garnett says: This is a very exciting time for 1E. I am passionate about joining a company that has saved its customers over $1bn simply by driving out IT waste  thats game-changing innovation. The executive leadership team has established a solid platform for growth with its Efficient IT strategy and solution set. I am energised and ready to deliver.", "Dr. Garnett will work alongside existing non-executive board members David Carman and Barbara Karayi, to advise the 1E Executive Leadership team.", "The Executive Leadership team at 1E includes Sumir Karayi, Chief Executive Officer; Nick MilneHome, President, 1E Inc.; Richard Lowe, Chief Commercial Officer; David Tiplin, Chief Financial Officer; and Sophie Chang, VP of Software.", ""], "Author": ["Rod Trent"], "Date": "2011-07-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/05/cisco-livemandalay-bay-and-vegas-collateral-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: Cisco Live", "Author": "Cisco Live"}, {"Comment": "Pingback: Cisco LiveMandalay Bay and Vegas Collateral #cl11 - 1E Blog", "Author": "Cisco LiveMandalay Bay and Vegas Collateral #cl11 - 1E Blog"}], "Content": ["If youve attended even a couple events in Las Vegas, you know how valuable it is to know your way around  not just Vegas, but the conference center the event it hosted in, as well.", "These are in PDF format so you can utilize them on a mobile device in additional to your laptop."], "Author": ["Rod Trent"], "Date": "2011-07-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/05/william-shatner-and-1e-at-cisco-live-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "Green IT", "IT Efficiency", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: William Shatner and 1E at Cisco Live #cl11 - 1E Blog", "Author": "William Shatner and 1E at Cisco Live #cl11 - 1E Blog"}], "Content": ["Check it out when you get a chance:", "http://staging.1e.com/softwareproducts/nightwatchmanserver/index.aspx", "And, make sure to stop by 1E booth 2140 to hear all about it."], "Author": ["Rod Trent"], "Date": "2011-07-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/05/the-cisco-live-session-catalog-and-scheduler-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "Green IT", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: The Cisco Live Session Catalog and Scheduler #cl11 - 1E Blog", "Author": "The Cisco Live Session Catalog and Scheduler #cl11 - 1E Blog"}], "Content": ["Heres the link to the online Cisco Live session scheduler. This is a great link to tuck away as a handy reference.", "https://www.ciscolive2011.com/scheduler/catalog/catalog.jsp"], "Author": ["Rod Trent"], "Date": "2011-07-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/05/a-glimpse-of-the-1e-booth-at-cisco-live-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "IT Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: A glimpse of the 1E booth at Cisco Live #cl11 - 1E Blog", "Author": "A glimpse of the 1E booth at Cisco Live #cl11 - 1E Blog"}], "Content": ["", "", "Previous related posts", "Comedy/Magic duo, Brian Campbell and the Amazing Allison, at Cisco Live"], "Author": ["Rod Trent"], "Date": "2011-07-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/01/new-1e-product-fan-pages-on-facebook/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: New 1E product fan pages on Facebook - 1E Blog", "Author": "New 1E product fan pages on Facebook - 1E Blog"}], "Content": ["1E AppClarity", "1E NightWatchman Enterprise", "1E NightWatchman Server Edition", "1E Nomad Enterprise", "1E Shopping", "1E Wakeup", "", "and of course, join our 1E Global page:", "1E Community", ""], "Author": ["Rod Trent"], "Date": "2011-07-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/30/comedymagic-duo-brian-campbell-and-the-amazing-allison-at-cisco-live-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "Green IT", "NightWatchman Server", "Nomad", "Server Power Management"], "Comments": [{"Comment": "Pingback: Comedy/Magic duo, Brian Campbell and the Amazing Allison, at Cisco Live #cl11 - 1E Blog", "Author": "Comedy/Magic duo, Brian Campbell and the Amazing Allison, at Cisco Live #cl11 - 1E Blog"}], "Content": ["But, theres one more tidbit of sweet goodness we can share, and yet another reason why stopping the 1E booth will be a worthwhile event and memorable time in your life. The famous comedy/magic team of Brian Campbell and Allison Jenkins will be on hand all week long to help turn the Cisco Expo into a real Vegas experience.", "", "", "Brians and Allisons talents are truly amazing!"], "Author": ["Rod Trent"], "Date": "2011-06-30 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/30/1e-theater-presentations-at-cisco-live-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "Green IT", "NightWatchman Server", "Nomad", "Server Power Management"], "Comments": "", "Content": ["Heres the topic schedule:", "", "1E Booth 2140, Cisco Live, Mandalay Bay Resort, Las Vegas, USA", ""], "Author": ["Rod Trent"], "Date": "2011-06-30 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/30/how-to-find-1e-at-cisco-live-cl11/", "Area": ["1E News", "Data Center", "Events", "Green IT", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: How to find 1E at Cisco Live #cl11 - 1E Blog", "Author": "How to find 1E at Cisco Live #cl11 - 1E Blog"}], "Content": ["Heres how to find us"], "Author": ["Rod Trent"], "Date": "2011-06-30 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/29/cisco-live-abbreviated-schedule-cl11/", "Area": ["1E News", "1E Products", "Data Center", "Events", "IT Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Cisco Live Abbreviated Schedule #cl11 - 1E Blog", "Author": "Cisco Live Abbreviated Schedule #cl11 - 1E Blog"}, {"Comment": "Pingback: 1E Theater Presentations at Cisco Live #cl11 | 1E Blogs  Insight and debate on IT Efficiency", "Author": "1E Theater Presentations at Cisco Live #cl11 | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["We put this together for our own use on our laptops and mobile devices, and thought it useful enough to share with those attending Cisco Live July 11-14, 2011."], "Author": ["Rod Trent"], "Date": "2011-06-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/28/1e-adds-two-leading-channel-partners-to-help-deliver-it-efficiency-solutions-across-the-united-states-and-canada/", "Area": ["1E News", "1E Partners", "PC Power Management"], "Comments": [{"Comment": "Pingback: 1E Adds Two Leading Channel Partners to Help Deliver IT Efficiency Solutions Across the United States and Canada - 1E Blog", "Author": "1E Adds Two Leading Channel Partners to Help Deliver IT Efficiency Solutions Across the United States and Canada - 1E Blog"}], "Content": ["Company Intensifies North American Channel Program Expansion; Joins Forces With MCPc and TriCon Technical Services Inc.", "As MCPc continues to increase its enterprise footprint, we are partnering with smart technologies and innovative organizations that can help us achieve our growth objectives while bringing continuous value to our customers", "In early 2011, 1E established a new, indirect channel model, appointing Paul Szemerenyi as Vice President, North American Channels and making a significant investment in building a channel team, while allotting additional technical and sales resources to be placed in key regional territories across North America. Currently focused on strategic partnerships with service providers and reseller organizations, the 1E channel program is gaining rapid momentum and is poised for continued growth in 2011.", "As MCPc continues to increase its enterprise footprint, we are partnering with smart technologies and innovative organizations that can help us achieve our growth objectives while bringing continuous value to our customers, said Andy Jones, group president of MCPcs Advanced Technology Group, Presales Division. 1Es IT efficiency solutions provide a new, uncharted growth area for our organization, and the partnership with 1E is critical to MCPcs rapidly growing Microsoft practice for the enterprise.", "As a proven leader in IT infrastructure optimization, TriCon has set an aggressive strategy for continued growth, with the ultimate goal of doubling our entire business by next year, said Dave Kawula, chief executive officer and co-founder of TriCon Technical Services Inc. 1Es comprehensive suite of IT efficiency products is the perfect extension of our current solution offerings, and will play an integral part in our organizations growth plan. We look forward to a long-lasting, mutually beneficial partnership.", "The 1E channel program is designed to provide its partners with highly customized tools and resources to help them gain market traction. The program provides partner resellers with comprehensive sales training, technical education and certification through 1E University, a program specifically designed for partner organizations, as well as dedicated technical support and sales enablement and marketing tools. Additionally, 1Es online partner portal, which will be launched later this year, will provide a comprehensive, intuitive framework for working with 1E and serve as a central navigation point for access to a wide variety of partner resources and tools.", "1E is empowering the reseller community to capitalize on growth opportunities in the IT efficiency arena by providing a best-in-class support network, said Paul Szemerenyi, Vice President, North American Channels. As we continue to build out our channel infrastructure and expand market awareness, we welcome MCPc and TriCon to our partner program and look forward to collaborating closely with them to provide our joint customers with the best IT efficiency solutions, while helping them reduce their carbon footprints and enhance environmental stewardship.", "About 1E"], "Author": ["Rod Trent"], "Date": "2011-06-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/28/winner-of-the-greenest-hospital-award-newham-nhs-trust-reduced-its-carbon-emissions-while-making-significant-cost-savings-and-securing-the-computers/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: Winner of the Greenest Hospital Award, Newham NHS Trust reduced its carbon emissions while making significant cost savings and securing the computers - 1E Blog", "Author": "Winner of the Greenest Hospital Award, Newham NHS Trust reduced its carbon emissions while making significant cost savings and securing the computers - 1E Blog"}], "Content": ["The Trust chose a combined power and patch management solution from 1E  NightWatchman and WakeUp  after a standard procurement process, which was integrated with the Trusts software distribution platform, Microsoft System Center Configuration Manager", "There has also been a side benefit, he remarks. If we have any software updates that we want to push out whilst people are working but not during the working day, we turn the computer on again at 2am remotely through a policy, install that software update and then shut the computers down again.", "The Trust is now considering further products to deploy, given the success of the current solution. We are now looking at deployment of the server edition of the same technology which aims to reduce the power consumed by servers in the data centre, says Jeffery.", "Read the full article:", "http://www.publictechnology.net/sector/nhs-health/best-practice-using-ict-save-money-and-energy-newham"], "Author": ["Rod Trent"], "Date": "2011-06-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/28/kiwibank-expects-to-save-up-to-24570-with-pc-power-management/", "Area": ["1E News", "1E Products", "NightWatchman", "PC Power Management", "WakeUp"], "Comments": [{"Comment": "Pingback: Kiwibank expects to save up to $24,570 with PC Power Management - 1E Blog", "Author": "Kiwibank expects to save up to $24,570 with PC Power Management - 1E Blog"}], "Content": ["In a move that shows sustainable IT can also be affordable, Kiwibank has implemented an automatic shut-down service on all of its computers, a change forecast to save the bank thousands of dollars a year on power bills and up to 32 tonnes off its carbon footprint.", "Read the full article:"], "Author": ["Rod Trent"], "Date": "2011-06-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/24/gearing-up-for-an-exciting-cisco-live-cl11/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Gearing up for an exciting Cisco Live #cl11 - 1E Blog", "Author": "Gearing up for an exciting Cisco Live #cl11 - 1E Blog"}], "Content": ["Cisco Live attracts thousands of IT professional and technical innovators from all over North America, as well as a growing global audience. These loyal Cisco customers play key roles in purchasing decisions at their company or organization. Cisco Live is Ciscos single largest educational and training event of the year, giving you the opportunity to interact with over 12,000 attendees, all in one location: the World of Solutions Expo.", "Save up to $100 if you register before July 8th!", "", "While Cisco Live is still a couple weeks away, theres still a few notable things you can do now to prepare for the event  one of which is a geeks dream (can you guess which one?).", ""], "Author": ["Rod Trent"], "Date": "2011-06-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/23/from-pilot-to-savings-cscs-blog-series-on-nightwatchman-server-in-the-cloud-datacenter/", "Area": ["1E Customers", "1E News", "1E Products", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: From pilot to savings: CSC", "Author": "From pilot to savings: CSC"}, {"Comment": "Pingback: From pilot to savings: CSCs blog series on NightWatchman Server in the cloud datacenter - 1E Blog", "Author": "From pilot to savings: CSCs blog series on NightWatchman Server in the cloud datacenter - 1E Blog"}], "Content": ["1E Video Case Study: Candace LaBelle, Program Director, CSC", "", "http://blogs.1e.com/index.php/tag/csc/"], "Author": ["Rod Trent"], "Date": "2011-06-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/23/eu-presents-new-law-to-meet-2020-energy-efficiency-target/", "Area": ["1E News", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: EU presents new law to meet 2020 energy efficiency target - 1E Blog", "Author": "EU presents new law to meet 2020 energy efficiency target - 1E Blog"}], "Content": ["We welcome the news that the European Commission is pushing public administrations and private companies to reduce energy consumption by 20% by 2020. One of the fastest ways in which organisations can become energy efficient is to look at their IT infrastructure.", "The proposal is half-hearted. The European Commission did not fulfil its commitment to replace binding targets with binding measures and has missed out a huge opportunity to save significant amounts of energy and money  at a time when we need both the most. In the next months, we will support the European Parliament and the most progressive members of the European Council in their effort to strengthen its provisions in terms of targets and concrete measures  the technologies exist, business is asking for regulation and they are ready to invest; its a policy makers dream. I cannot understand why the EU continues to keep Energy Efficiency in the sidelines of European policy, she concluded.", "Frassoni is right about the fact that energy efficiency technologies exist today  not only that; they generate fast returns."], "Author": ["Rod Trent"], "Date": "2011-06-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/22/1e-is-sponsoring-green-monday-at-bank-of-america-in-london-on-the-evening-of-july-4th/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1E is sponsoring Green Monday at Bank of America in London on the evening of July 4th - 1E Blog", "Author": "1E is sponsoring Green Monday at Bank of America in London on the evening of July 4th - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-06-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/22/1e-video-case-study-candace-labelle-program-director-csc/", "Area": ["1E Customers", "1E News", "1E Products", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: 1E Video Case Study: Candace LaBelle, Program Director, CSC - 1E Blog", "Author": "1E Video Case Study: Candace LaBelle, Program Director, CSC - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-06-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/22/benefits-firm-gets-new-shopping-portal/", "Area": ["1E Customers", "1E News", "Shopping"], "Comments": [{"Comment": "Pingback: Benefits firm gets new shopping portal - 1E Blog", "Author": "Benefits firm gets new shopping portal - 1E Blog"}], "Content": ["Read the full article:", "http://www.computing.co.uk/ctg/news/2080543/benefits-firm-shopping-portal"], "Author": ["Rod Trent"], "Date": "2011-06-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/22/find-1e-at-teched-2011/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["Wowthis seems like a late blog post. But its not.", "http://youtu.be/UtwwfkwcT54", "Heres a hint:"], "Author": ["Rod Trent"], "Date": "2011-06-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/21/1es-1st-ever-partner-training-session-in-the-us-underway/", "Area": ["1E News", "1E Partners", "1E Products"], "Comments": [{"Comment": "Pingback: 1E", "Author": "1E"}, {"Comment": "Pingback: 1Es 1st-ever Partner Training session in the US underway! - 1E Blog", "Author": "1Es 1st-ever Partner Training session in the US underway! - 1E Blog"}, {"Comment": "Pingback: Training  Three Thoughts in Thinking Through Your Training | Call Center Cafe", "Author": "Training  Three Thoughts in Thinking Through Your Training | Call Center Cafe"}, {"Comment": "Pingback: Training with PIZZAZZ! | CallCenterBestPractices.com", "Author": "Training with PIZZAZZ! | CallCenterBestPractices.com"}], "Content": ["The training program has gotten off to an extremely smooth start. It has taken a lot of hard work and an amazing team to put the entire training program together. A big thank you to:", "Below are some pictures of the class in progress and a welcome party that was arranged for the partners.", ""], "Author": ["Rod Trent"], "Date": "2011-06-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/21/ovum-report-on-green-it-deployments-in-key-global-markets/", "Area": ["1E News", "Data Center", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["Ovum recently published a report called Green IT Deployments Across Key Global Markets. Here, we look at why CIOs should consider themselves Chief Efficiency Officers in order to help their organisations become truly efficient."], "Author": ["Rod Trent"], "Date": "2011-06-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/21/nein-to-nuclear-germanys-volte-face-could-come-with-hefty-cost-and-energy-penalties-if-energy-efficiencies-are-not-made-now/", "Area": ["1E News", "IT Efficiency"], "Comments": "", "Content": ["After the Fukushima disaster in Japan, the German chancellor Angela Merkel suspended the countrys nuclear energy policy and unplugged seven of Germanys 17 reactors off the electricity grid. She also confirmed a decision to shut down all 17 nuclear reactors by 2022.", "German businesses must act now to implement energy efficiency technologies and strategies to reduce their emissions contributions. The impetus is clear and there are simple steps that can be taken today. Why wait?"], "Author": ["Rod Trent"], "Date": "2011-06-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/20/youre-invited-to-a-1e-happy-hour/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: You", "Author": "You"}, {"Comment": "Pingback: Youre invited to a 1E Happy Hour! - 1E Blog", "Author": "Youre invited to a 1E Happy Hour! - 1E Blog"}], "Content": ["Network congested? Software licensing audits costing you time and money? Servers wheezing? Software updates and patches being crammed down your throat? Using more power than you need? Were all tired of wasting money and resources, but figuring out a fix is a daunting challenge.", "Join 1E for Happy Hour and an interactive session with technology executives from some of the countrys leading organizations. Learn how you can save millions by effectively deploying IT efficiency solutions and addressing energy efficiency challenges.", "Register Today"], "Author": ["Rod Trent"], "Date": "2011-06-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/20/csc-partners-with-1e-to-monitor-energy-use/", "Area": ["1E Customers", "1E News", "1E Products", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: CSC Partners With 1E to Monitor Energy Use - 1E Blog", "Author": "CSC Partners With 1E to Monitor Energy Use - 1E Blog"}], "Content": ["When we learned of 1Es new NightWatchman Server Edition in 2010, we wanted to be on the front line with their latest innovation", "Read the full post"], "Author": ["Rod Trent"], "Date": "2011-06-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/17/shutting-pcs-off-automatically-saves-thousands/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: Shutting PCs off automatically saves $thousands - 1E Blog", "Author": "Shutting PCs off automatically saves $thousands - 1E Blog"}], "Content": ["It seems like such a simple way to save energy and money: just remember to turn off your computer when leaving the office at the end of the day.", "Simple, yes. But its still anything but a habit with many people."], "Author": ["Rod Trent"], "Date": "2011-06-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/17/kiwibank-switches-power-off-cuts-costs-will-save-up-to-24570-within-the-first-year-of-deploying-1es-pc-power-management-solution/", "Area": ["1E Customers", "1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman"], "Comments": "", "Content": ["Read the full article:", "http://cio.co.nz/cio.nsf/spot/980FF6768E5E82C2CC2578B0000BA932"], "Author": ["Rod Trent"], "Date": "2011-06-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/17/kiwibank-deploys-nightwatchman-and-stands-to-save-thousands-in-pc-energy-costs/", "Area": ["1E News", "1E Products", "NightWatchman"], "Comments": "", "Content": ["Shutting down computers at night will save Kiwibank up to NZ$24,570 in energy costs, reduce energy use by 163,800 kWh and reduce CO2 emissions by 32 tonnes in the first year!"], "Author": ["Rod Trent"], "Date": "2011-06-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/17/deploy-windows-7-from-the-enterprise-app-store/", "Area": ["1E News", "1E Products", "Shopping", "Windows 7"], "Comments": "", "Content": ["This whitepaper outlines the challenges of a Windows 7 migration project and how these can be mitigated by involving the end users themselves in the migration process."], "Author": ["Rod Trent"], "Date": "2011-06-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/17/unum-deploys-shopping-from-1e-to-prevent-14000-help-desk-calls-a-year-saving-560000-a-year/", "Area": ["1E Customers", "1E News", "1E Products", "IT Efficiency", "Shopping"], "Comments": "", "Content": ["A Fortune 500 company, Unum is a market leader in disability, group, life, long term care and voluntary benefits,supporting more than 25 million policy holders worldwide. With revenues of more than $10 billion, Unum employs 10,000 people across three major business operations, based in Chattanooga, Tennessee and Columbia, South Carolina in the United States and in Dorking, Surrey in the United Kingdom. Unum operates more than 40 other office locations worldwide."], "Author": ["Rod Trent"], "Date": "2011-06-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/17/if-you-missed-the-appclarity-webinar-eventheres-the-replay/", "Area": ["1E News", "1E Products", "AppClarity", "Events", "Green IT", "IT Efficiency"], "Comments": "", "Content": ["Find out how to save your organization from the software overlords!"], "Author": ["Rod Trent"], "Date": "2011-06-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/17/1e-shopping-video-case-study-andrew-king-enterprise-software-administrator-cdm/", "Area": ["1E Customers", "1E News", "1E Products", "Shopping"], "Comments": [{"Comment": "Pingback: 1E Shopping Video Case Study: Andrew King, Enterprise Software Administrator, CDM - 1E Blog", "Author": "1E Shopping Video Case Study: Andrew King, Enterprise Software Administrator, CDM - 1E Blog"}], "Content": ["With hundreds of types of software available throughout its organization, global engineering firm CDM wanted to streamline help desk support, increase customer satisfaction and increase business efficiency. Andrew King, enterprise software administrator at CDM, shares how his organization is simplifying enterprise software deployment and realizing dramatic cost savings by deploying 1Es Shopping.", ""], "Author": ["Rod Trent"], "Date": "2011-06-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/06/09/shopping-and-windows-7-migration/", "Area": ["1E News", "1E Products", "IT Efficiency", "Shopping"], "Comments": "", "Content": ["Is the possibility of business users migrating their own operating system a reality? I think so. Shopping empowers users to request the software and services they need, when they need them and makes the process of requesting software as simple as buying a book on Amazon or an app on the app store.", "But why stop there? Our next release of Shopping will enable users to request and control their operating system migration as well as software and other resources. The user is presented with a wizard that takes them through the process of their OS migration one step at a time. The user can also select the applications to have installed once the deployment is complete. These might be apps theyve shopped for in the past or even those that have been installed by some other means. Im really excited about this new functionality and so are our customers. I believe that letting the users manage the process themselves could remove much of the pain of the scheduling and application installation elements of Windows migration projects. Watch out for Shopping v4 this summer!"], "Author": ["Richard Cudd"], "Date": "2011-06-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/31/save-up-to-400-on-every-pc-in-your-organization/", "Area": ["1E News", "1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Save up to $400 on every PC in your organization - 1E Blog", "Author": "Save up to $400 on every PC in your organization - 1E Blog"}], "Content": ["Recent research highlights that every PC in your organization could have as much as $400 worth of unused software licenses.", "Developed to empower organizations to only use  and pay for  the software and licenses they need, AppClarity is a new solution from 1E designed to help organizations combat the problem of software waste. Watch this short video to see how 1E can help you make radical cost savings:", ""], "Author": ["Rod Trent"], "Date": "2011-05-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/31/clare-grogan-launches-new-uk-wide-search-for-more-adoption-champions-for-vulnerable-children/", "Area": ["1E Community", "1E News", "Charity"], "Comments": [{"Comment": "Pingback: Clare Grogan launches new UK wide search for more Adoption Champions for vulnerable children - 1E Blog", "Author": "Clare Grogan launches new UK wide search for more Adoption Champions for vulnerable children - 1E Blog"}], "Content": ["Actress and adoptive mum Clare Grogan is leading the call for more people to join the army of volunteers who have become Adoption Champions to help find more permanent families for children in care awaiting adoption.", "Since its inaugural launch in 2010, the Adoption Champions initiative, run by the British Association for Adoption & Fostering (BAAF), has recruited nearly 200 adoption experienced people. These Champions have successfully promoted adoption throughout their local communities  but more Champions are needed. With around 4,000 children waiting for adoption every year across the UK, it is more important than ever for more potential adopters to come forward.", "Therefore, as part of National Family Week, BAAF  with support from leading IT Efficiency software company, 1E  is asking for more people to become Adoption Champions. From adoptive parents to those who have been adopted, people can make a real contribution by inspiring others to take that first step to giving a child a loving, secure, permanent home.", "Anyone over 18 with experience of adoption can become an Adoption Champion. And with activities ranging from putting up a poster to organising a talk at a local community centre, there is something for everyone. BAAF has developed a dedicated area on the National Adoption Week website for Adoption Champions which has loads of ideas and advice together with resources that can be downloaded.", ""], "Author": ["Rod Trent"], "Date": "2011-05-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/27/lowering-the-risk-of-windows-7-migration/", "Area": ["1E News", "1E Products", "Windows 7"], "Comments": [{"Comment": "Pingback: Lowering the Risk of Windows 7 Migration - 1E Blog", "Author": "Lowering the Risk of Windows 7 Migration - 1E Blog"}], "Content": ["This webinar is designed to educate you on how 1Es experienced consulting specialists can help you automate your entire migration process, delivering zero-touch installations, for the fastest and lowest cost migrations, no matter how challenging the environment. It draws on real case studies to deliver a set of common deployment challenges and solutions."], "Author": ["Rod Trent"], "Date": "2011-05-27 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/27/1es-japanese-tsunami-appeal-is-a-success/", "Area": ["1E Community", "1E News", "Charity"], "Comments": [{"Comment": "Pingback: 1E", "Author": "1E"}, {"Comment": "Pingback: 1Es Japanese Tsunami Appeal is a success! - 1E Blog", "Author": "1Es Japanese Tsunami Appeal is a success! - 1E Blog"}], "Content": ["Our Appeal for the Japanese Tsunami has raised $16,000! Our target was $10,000!", "For those who like statistics:", "The link to the American and British Red Cross remains open for anyone who would still like to make a donation.", "http://staging.1e.com/it-efficiency/about-1e/crisis-appeal/"], "Author": ["Rod Trent"], "Date": "2011-05-27 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/27/1e-will-be-at-smartgov-live-on-stand-g37-on-14-15-june-2011/", "Area": ["1E News", "Events", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: 1E will be at SmartGov Live on stand G37 on 14-15 June 2011 - 1E Blog", "Author": "1E will be at SmartGov Live on stand G37 on 14-15 June 2011 - 1E Blog"}], "Content": ["If youre there, drop by our stand and say, Hi!"], "Author": ["Rod Trent"], "Date": "2011-05-27 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/25/software-efficiency-report-uk-2011/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-05-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/25/software-efficiency-report-us-2011/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-05-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/25/how-dynamically-controlling-your-license-estate-leads-to-a-software-balance-and-protects-your-organization/", "Area": ["1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: How dynamically controlling your license estate leads to a software balance and protects your organization - 1E Blog", "Author": "How dynamically controlling your license estate leads to a software balance and protects your organization - 1E Blog"}], "Content": ["This whitepaper sets out the 1E view of software governance and compliance, highlighting that the correct approach is not to overspend and overprovision, but nor is it to wait for your chosen software vendors to audit your enterprise.  The answer is to get the balance just right."], "Author": ["Rod Trent"], "Date": "2011-05-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/25/how-removing-and-reallocating-unused-software-can-dramatically-cut-costs-and-reduce-waste/", "Area": ["1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-05-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/24/1e-invites-you-to-a-geeky-golf-outing-in-prior-lake-mn-wednesday-june-8th-2011/", "Area": ["1E Community", "1E News"], "Comments": [{"Comment": "Pingback: 1E invites you to a geeky golf outing in Prior Lake, MN ", "Author": "1E invites you to a geeky golf outing in Prior Lake, MN "}, {"Comment": "Pingback: 1E invites you to a geeky golf outing in Prior Lake, MN  Wednesday, June 8th, 2011 - 1E Blog", "Author": "1E invites you to a geeky golf outing in Prior Lake, MN  Wednesday, June 8th, 2011 - 1E Blog"}], "Content": ["", "Extra info:", "Shotgun start following lunch", "Prizes & Appetizers: 5:00PM", "", "For contact info and more information, leave a comment here and well get back with you.", ""], "Author": ["Rod Trent"], "Date": "2011-05-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/24/3-new-ways-to-get-1e-product-support-information/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: 3 New Ways to Get 1E Product Support Information - 1E Blog", "Author": "3 New Ways to Get 1E Product Support Information - 1E Blog"}], "Content": ["Today, were unveiling a couple important options where our customers will be able to monitor and hear about products updates, hotfixes, etc.", "http://twitter.com/1ETechNews", "", "Alternatively, if you dont want to keep checking the forum constantly, you can also subscribe to the forums RSS feed to be notified using your favorite RSS feed reader:", ""], "Author": ["Rod Trent"], "Date": "2011-05-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/23/microsoft-takes-the-wraps-off-its-new-system-center-marketplace/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: Microsoft takes the wraps off its new System Center Marketplace - 1E Blog", "Author": "Microsoft takes the wraps off its new System Center Marketplace - 1E Blog"}], "Content": ["Once labeled Microsoft Pinpoint, Microsoft has revamped the web-based catalog and rereleased it as the System Center Marketplace.", "Our services here:", "http://systemcenter.pinpoint.microsoft.com/en-US/services/search?q=1e", "And, our Marketplace company information here:", "http://systemcenter.pinpoint.microsoft.com/en-US/companies/search?q=1e"], "Author": ["Rod Trent"], "Date": "2011-05-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/23/improve-software-license-efficiency-with-1e-shopping/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "Shopping"], "Comments": "", "Content": ["", "Shopping from 1E can improve license efficiency by enabling users to rent software and have it installed only while they need it.", ""], "Author": ["Rod Trent"], "Date": "2011-05-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/23/round-the-clock-pc-power-management-with-1e-nightwatchman/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": "", "Content": ["1E NightWatchman in the Real World: How NightWatchman might be used in your environment."], "Author": ["Rod Trent"], "Date": "2011-05-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/23/bringing-home-the-product-of-the-year-at-the-green-it-2011-awards/", "Area": ["1E Community", "1E News", "1E Products", "Awards", "Green IT", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: Bringing home the Product of the Year at the Green IT 2011 Awards! - 1E Blog", "Author": "Bringing home the Product of the Year at the Green IT 2011 Awards! - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-05-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/23/unmanaged-software-licenses-costs-one-company-over-400000-they-hadnt-budgeted-for-msteched/", "Area": ["1E News", "1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Unmanaged software licenses costs one company over $400,000 they hadn", "Author": "Unmanaged software licenses costs one company over $400,000 they hadn"}, {"Comment": "Pingback: Unmanaged software licenses costs one company over $400,000 they hadnt budgeted for #msteched - 1E Blog", "Author": "Unmanaged software licenses costs one company over $400,000 they hadnt budgeted for #msteched - 1E Blog"}], "Content": ["As a presenter, it was great to see light bulbs go off in attendees eyes as we described our solutions effectively. We had a booth session for each and every product that we produce and the positive responses were enormously valuable.", "Heres a few:", "Software Assurance: How Microsoft gambles with your money", "For one software vendor (the one who handed out the $400,000 bill), it seems that true-ups are being used to generate revenue when revenue is down. I guess, yeah, thats one way to make money.", "But, you cant blame that software vendor. And, frankly, its really tough to blame the company with the mismanaged software licenses? Why?", "Managing and reporting on software licenses has ALWAYS been an almost impossible task. Ask anyone who has had to deal with this situation  software licensing management is a back-burner task because there have not been any real solutions to such an enormous problem. Until now", "Keeping with our companys vision to help customers save money, energy and time, we developed AppClarity. AppClarity is a license management and reclamation solution. Not only can you report on used, unused, and unneeded software licenses, but you can reclaim and redistribute/repurpose software licenses to where they are actually needed within the organization. And, the bigger value is that it puts YOU in control over the licensing process. So, the next time a software vendor singles you out for a true-up, or tries to sell you licenses you really dont need, YOU have the upper hand  YOU control the licensing negotiations because you know exactly what exists in your organization.", "Watch the video:", "With the true-up engines revving up (can you hear the noise?), can you be unprepared?"], "Author": ["Rod Trent"], "Date": "2011-05-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/21/1e-bringing-the-sunshine-to-the-cloud-y-teched-2011-with-value-and-giveaways-msteched/", "Area": ["1E Community", "1E News", "1E Products", "Events", "TechEd"], "Comments": "", "Content": ["", ""], "Author": ["Rod Trent"], "Date": "2011-05-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/21/nightwatchman-server-edition-qa-at-teched-2011-msteched/", "Area": ["1E News", "1E Products", "Events", "NightWatchman Server", "Server Power Management", "TechEd"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2011-05-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/20/nightwatchman-server-edition-wins-product-of-the-year-at-the-green-it-2011-awards/", "Area": ["1E News", "1E Products", "Awards", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: NightWatchman Server Edition Wins Product of the Year at the Green IT 2011 Awards - 1E Blog", "Author": "NightWatchman Server Edition Wins Product of the Year at the Green IT 2011 Awards - 1E Blog"}], "Content": ["NightWatchman Server Edition wins Product of the Year at the Green IT 2011 awards. NightWatchman Server Edition was launched to target the $24.7 billion [15 billion] of IT spend wasted each year on the 4.7 million servers that are not doing any useful work. It allocates energy consumption to servers on a workload basis to give organizations a clearer idea of the value of every kilowatt (kW) of energy consumed and therefore, the business value they stand to get from each server.", "", "London and New York (PRWEB) May 20, 2011", "NightWatchman Server Edition was launched to target the $24.7 billion [15 billion] of IT spend wasted each year on the 4.7 million servers that are not doing any useful work. It allocates energy consumption to servers on a workload basis to give organizations a clearer idea of the value of every kilowatt (kW) of energy consumed and therefore, the business value they stand to get from each server.", "Now in their second year, the Green IT Awards showcase and reward the technology, tools and solutions as well as the companies and organisations that have made a significant contribution to improving the IT industrys environmental performance, says Josh Boulton, Publisher, Green IT Magazine. Over 400 companies and products were nominated for this years awards, and the winners are a great testament to the innovation and commitment that businesses are making to reduce C02 emissions, save money and make more efficient use of their IT.", "Speaking about the award win Sumir Karayi, CEO, 1E, says: We help our customers reduce C02 emissions, save money and make more efficient use of their IT every day. To date, we have saved our customers over $1 billion in efficiency savings, $550 million in energy savings alone. We are proud to deliver on our promise of driving these savings and honoured to have our contribution to the data center infrastructure management space recognized with a fourth win for NightWatchman Server Edition. We see this as further affirmation of our vision to empower greater IT efficiencies and environmental responsibility in organisations around the world.", "Catalina McGregor, recently named one of the most significant drivers of Green ICT in the western world, presented the awards. Speaking of the winners, she says: I cannot walk away from the Green IT awards without feeling inspired and humbled by the quality of the winners. The passion and determination to do good with ICT is contagious and incredibly rewarding.", "NightWatchman Server Edition is a multiple award-winning innovation, having previously been named as Green IT Minister of Energy 2010, Greenbang Best IT Technology 2010 and Microsoft ISV Software Solution Partner of the Year 2010."], "Author": ["Rod Trent"], "Date": "2011-05-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/18/the-1e-booth-at-techedalways-busy-always-fun-msteched/", "Area": ["1E News", "Events", "TechEd"], "Comments": [{"Comment": "Pingback: The 1E booth at TechEd", "Author": "The 1E booth at TechEd"}, {"Comment": "Pingback: The 1E booth at TechEdalways busy, always fun #msteched - 1E Blog", "Author": "The 1E booth at TechEdalways busy, always fun #msteched - 1E Blog"}], "Content": ["Our booth at TechEd 2011 is always full of folks that want to hear about our intelligent, comprehensive solutions for saving companies money. Our primary goal for being 1E is to develop total solutions for ensuring that your IT organization is efficient in power, time, and savings.", "People love this message, but they love it most because its easy to prove. So, its easy to understand why our presence at TechEd 2011 this year is so welcome.", "WellyeahAND were giving cool stuff. Heres our Tuesday afternoon giveaway of a Cisco Flip camera. Congratulations to our Tuesday winner, Jim Snyder!", ""], "Author": ["Rod Trent"], "Date": "2011-05-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/17/the-1e-booth-is-the-most-exciting-at-teched-2011-msteched/", "Area": ["1E News", "Events", "TechEd"], "Comments": [{"Comment": "Pingback: The 1E booth is the most exciting at TechEd 2011 #msteched - 1E Blog", "Author": "The 1E booth is the most exciting at TechEd 2011 #msteched - 1E Blog"}], "Content": ["Our magicians are providing some awesome excitement at TechEd 2011 this week. Our booth is constantly filled with TechEd attendees wanting to save money for their organization. Theres nothing like attending an event like this and being able to take something truly valuable back with you.", ""], "Author": ["Rod Trent"], "Date": "2011-05-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/13/read-the-software-efficiency-report-to-prepare-for-teched-2011-msteched/", "Area": ["1E News", "AppClarity", "Events", "Software Asset Management", "Software License Optimization", "TechEd"], "Comments": "", "Content": ["In the U.S. alone, there is more than $12.3 billion worth of preventable costs associated with unused software/shelfware.", "", "US Version", "UK Version"], "Author": ["Rod Trent"], "Date": "2011-05-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/13/teched-will-be-cloudy-so-1e-will-bring-the-sunshine-msteched/", "Area": ["1E News", "Events", "TechEd"], "Comments": [{"Comment": "Pingback: TechEd will be ", "Author": "TechEd will be "}, {"Comment": "Pingback: TechEd will be cloudy so 1E will bring the sunshine #msteched - 1E Blog", "Author": "TechEd will be cloudy so 1E will bring the sunshine #msteched - 1E Blog"}], "Content": ["If youve looked through the session catalog, you see right away that the major focus of TechEd 2011 is about The Cloud. This is a common theme at a number of conferences, and has been a major push in the industry for the last couple years.", "The cloud makes sense in a lot of scenarios as a cost and time savings mechanism. But, with all the cloud talk over the last couple years, the cloud has become somewhat  cloudy. New types of clouds and new acronyms can make it confusing. The majority of people attending TechEd this year will actually be attending to try and understand how the cloud can benefit them.", "Unfortunately, due to how the cloud is being marketed, it sometimes seems the cloud is perfect and works great in all situations. But, the cloud should come with some kind of warning label. The cloud is not applicable in all situations or for all scenarios. If the IT organization is inefficient prior to migrating to the cloud, theres a good chance the IT organization will continue to be inefficient long afterward. The cloud, in most cases, is just a Band-Aid that hides a bigger problem.", "So, before looking to the cloud as a solution to your IT pains, you might want to take a look at what 1E has to offer.", "At a conference so intent on The Cloud, wouldnt you like to know if cloud migrations are actually going to save your company money? Wouldnt your CIO like to know that you could save a stack of money for your company without outsourcing your technologies?", "Visit us in booth #1728."], "Author": ["Rod Trent"], "Date": "2011-05-13 00:00:00"}, {"Tags": ["energy efficiency"], "URL": "http://blogs.1e.com/2011/05/12/europes-energy-efficiency-economy-2/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Europes Energy Efficiency Economy - 1E Blog", "Author": "Europes Energy Efficiency Economy - 1E Blog"}], "Content": [], "Author": ["Michelle Hazelton"], "Date": "2011-05-12 00:00:00"}, {"Tags": ["energy efficiency"], "URL": "http://blogs.1e.com/2011/05/12/europes-energy-efficiency-economy/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Europe", "Author": "Europe"}], "Content": [], "Author": ["Michelle Hazelton"], "Date": "2011-05-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/11/downtime-at-uptime/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Downtime at Uptime - 1E Blog", "Author": "Downtime at Uptime - 1E Blog"}], "Content": [""], "Author": ["Rod Trent"], "Date": "2011-05-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/11/appclarity-webinar-tomorrow-may-12-201111am-pst2pm-est/", "Area": ["1E News", "1E Products", "AppClarity", "Events", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: AppClarity Webinar tomorrow! May 12, 2011", "Author": "AppClarity Webinar tomorrow! May 12, 2011"}, {"Comment": "Pingback: AppClarity Webinar tomorrow! May 12, 201111am PST/2pm EST - 1E Blog", "Author": "AppClarity Webinar tomorrow! May 12, 201111am PST/2pm EST - 1E Blog"}], "Content": ["Did you know that more than $12.3 billion is spent to maintain unused software and shelfware each year in the United States? Thats more than $400 spent per PC on unused software and an additional $150 spent on shelfware per user per year.", "Please join us for an interactive discussion with 1E experts, who will share the results of the 2011 Software Efficiency Report and examine the underlying factors driving the endemic of software waste in U.S. organizations. Together we will explore:", "", "Sign up for the webinar"], "Author": ["Rod Trent"], "Date": "2011-05-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/10/1e-helps-customers-hsbc-and-west-virginia-office-of-technology-achieve-computerworld-honors-program-for-2011/", "Area": ["1E Customers", "1E News", "1E Products"], "Comments": [{"Comment": "Pingback: 1E helps customers HSBC and West Virginia Office of Technology achieve 2011 Computerworld Honors Program for the environment - 1E Blog", "Author": "1E helps customers HSBC and West Virginia Office of Technology achieve 2011 Computerworld Honors Program for the environment - 1E Blog"}], "Content": ["The Computerworld Honors Program brings together the men, women, organizations and institutions around the world whose visionary applications of information technology promote positive social, economic and educational change. This year, 1E customers HSBC and West Virginia Office of Technology were honored as 2011 laureates!", "Read the full post"], "Author": ["Rod Trent"], "Date": "2011-05-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/09/how-to-find-1e-at-teched-2011-msteched/", "Area": ["1E News", "1E Products", "Events", "TechEd"], "Comments": [{"Comment": "Pingback: How to find 1E at TechEd 2011 #msteched - 1E Blog", "Author": "How to find 1E at TechEd 2011 #msteched - 1E Blog"}], "Content": ["There will be a huge number of vendors at TechEd 2011. And, while we know were not the only vendor there, we may have the most important booth at TechEd this year.", "Why?", "Well, at a conference so intent on The Cloud, wouldnt you like to know if cloud migrations are actually going to save your company money? Wouldnt your CIO like to know that you could save a stack of money for your company without outsourcing your technologies?", "Use the floor plan below to find us quickly in booth #1728.", "", "Incidentally, you can also download the full expo floor plan here:"], "Author": ["Rod Trent"], "Date": "2011-05-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/09/smart-software-marketing-likes-1e/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Smart Software Marketing likes 1E! - 1E Blog", "Author": "Smart Software Marketing likes 1E! - 1E Blog"}, {"Comment": "Nice to heard about software marketing likes. Thanks for sharing.", "Date": "2012-07-07 07:53:00", "Author": "Regiograph"}], "Content": [""], "Author": ["Rod Trent"], "Date": "2011-05-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/09/1e-shopping-the-app-store-for-the-enterprise/", "Area": ["1E News", "1E Products", "IT Efficiency", "Shopping"], "Comments": [{"Comment": "Pingback: 1E Shopping ", "Author": "1E Shopping "}, {"Comment": "Pingback: 1E Shopping  The app store for the enterprise - 1E Blog", "Author": "1E Shopping  The app store for the enterprise - 1E Blog"}], "Content": ["Shopping empowers users to get the software and services they need when they need them. This video demonstrates the simplicity and power of Shopping by showing how users can search for and request software without helpdesk intervention."], "Author": ["Rod Trent"], "Date": "2011-05-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/09/federation-against-software-theft-fast-has-taken-notice-of-1es-appclarity/", "Area": ["1E News", "1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["1E and AppClarity"], "Author": ["Rod Trent"], "Date": "2011-05-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/09/appclarity-product-sheet/", "Area": ["1E News", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: AppClarity Product Sheet - 1E Blog", "Author": "AppClarity Product Sheet - 1E Blog"}], "Content": ["AppClarity enables you to make immediate reductions in soware costs, analyzing all your applications and providing you with actionable results. AppClarity financially quantifies all software waste and initiates user centric software reclaims. It leverages Microsoft System Center Configuration Manager to help you reclaim, recycle and reuse your software assets. Compliance is achieved at a much lower cost."], "Author": ["Rod Trent"], "Date": "2011-05-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/06/1e-customers-fairfax-county-and-west-virginia-office-of-technology-win-in-the-infoworld-green-15-awards/", "Area": ["1E Customers", "1E News"], "Comments": [{"Comment": "Pingback: 1E customers Fairfax County and West Virginia Office of Technology win in the InfoWorld Green 15 Awards - 1E Blog", "Author": "1E customers Fairfax County and West Virginia Office of Technology win in the InfoWorld Green 15 Awards - 1E Blog"}], "Content": ["http://www.infoworld.com/d/data-center/the-green-it-stars-2011-549", "", "The county has realized $300,000 in savings from its PC power management initiative alone. Further, the countys IT staff can spend more time working on IT duties  and less time wasting fuel and visiting end-users to tinker with their machines.", "", "On the back end, the WVOT launched a consolidation and virtualization effort, migrating 17,000 of the 20,000 state agency employees from a variety of disparate email systems to a central email environment, resulting in a significant reduction of legacy servers."], "Author": ["Rod Trent"], "Date": "2011-05-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/06/1e-teched-booth-1728register-now-and-reserve-a-meeting-with-1e-msteched/", "Area": ["1E News", "Events", "TechEd"], "Comments": [{"Comment": "Pingback: 1E TechEd booth 1728", "Author": "1E TechEd booth 1728"}, {"Comment": "Pingback: 1E TechEd booth 1728register now and reserve a meeting with 1E #msteched - 1E Blog", "Author": "1E TechEd booth 1728register now and reserve a meeting with 1E #msteched - 1E Blog"}], "Content": ["Click the image below to reserve a 1-on-1 meeting with us!"], "Author": ["Rod Trent"], "Date": "2011-05-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/05/visit-1e-at-teched-north-america-2011-may-16-19-msteched/", "Area": ["1E News", "1E Products", "AppClarity", "Events", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "Nomad", "OS Deployment", "Server Power Management", "Shopping", "Software Asset Management", "Software License Optimization", "TechEd", "Windows 7"], "Comments": [{"Comment": "Pingback: Visit 1E at TechEd North America 2011 ", "Author": "Visit 1E at TechEd North America 2011 "}, {"Comment": "Pingback: Visit 1E at TechEd North America 2011  May 16-19 #msteched - 1E Blog", "Author": "Visit 1E at TechEd North America 2011  May 16-19 #msteched - 1E Blog"}], "Content": ["Visit booth 1728 to receive prizes during presentations covering how to", "", "Why not use the time to book a 1:1 meeting with 1E to discuss how our solutions can empower you with efficient IT.", "We look forward to seeing you in Atlanta."], "Author": ["Rod Trent"], "Date": "2011-05-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/05/iphoneipad-wakeup-app-updated-to-version-1-7/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: iPhone/iPad WakeUp app updated to version 1.7 - 1E Blog", "Author": "iPhone/iPad WakeUp app updated to version 1.7 - 1E Blog"}], "Content": ["", "This neat little utility from 1E combines with Web WakeUp to let you wake up any computer on your network using an iPhone or iPad. Handy when youve just got to finish that last minute piece of work but youve already left the office, or when you want to get a head start on the day by waking up your PC before you get to your desk. Once your computer is awake you can connect to it remotely using any third party Remote Desktop Protocol (RDP) app.", "You can download the updated version through iTunes, or take a look at the full app here:", ""], "Author": ["Rod Trent"], "Date": "2011-05-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/04/1e-video-case-study-angie-stahl-systems-engineer-systems-management-dell/", "Area": ["1E News", "1E Partners", "1E Products", "NightWatchman", "Nomad", "PC Power Management", "Shopping"], "Comments": [{"Comment": "Pingback: 1E Video Case Study: Angie Stahl, Systems Engineer, Systems Management, Dell - 1E Blog", "Author": "1E Video Case Study: Angie Stahl, Systems Engineer, Systems Management, Dell - 1E Blog"}], "Content": ["", "", "Angie Stahl, Systems Engineer, Systems Management for Dell talks about the Dell and 1E partnership and how they have adopted the full suite of 1E solutions. They find the deep integration with Systems Center Configuration Manager especially useful because it enables them to extend the value of their existing environment. They have been particularly pleased with the deployment and adoption of 1E Shopping. Shopping has helped drive virtual application acceptance, while drastically reducing application deployment times from hours to minutes. They have also managed to cut overall application costs with the rental feature."], "Author": ["Rod Trent"], "Date": "2011-05-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/03/making-your-pc-fleet-green/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman"], "Comments": [{"Comment": "Pingback: Making your PC fleet green - 1E Blog", "Author": "Making your PC fleet green - 1E Blog"}], "Content": ["When Potter joined the City of Melbourne, he had a heterogeneous fleet of systems and no central management. By using an app called NightWatchman, from 1E, the network is scanned for PCs that have been left on overnight. They are powered them down remotely. Potter and his team have developed scripts that check the PC for open files and ensure that any work is saved before the computer is switched off. That simple act alone saves tens of thousands of dollars from the electricity bill each year.", "NightWatchman can also be used to turn systems on so systems can be powered off in the evening, powered up later at night and patched with the latest security and antivirus updates and then powered down again."], "Author": ["Rod Trent"], "Date": "2011-05-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/03/yes-to-virtualization-projects-but-dont-virtualize-waste/", "Area": ["1E News", "1E Products", "Data Center", "Green IT", "IT Efficiency"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2011-05-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/03/webinar-new-research-finds-12-3bn-software-waste/", "Area": ["1E News", "1E Products", "AppClarity", "Events", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Webinar: New research finds $12.3bn software waste", "Author": "Webinar: New research finds $12.3bn software waste"}, {"Comment": "Pingback: Webinar: New research finds $12.3bn software wasteMay 12th, 2011 - 1E Blog", "Author": "Webinar: New research finds $12.3bn software wasteMay 12th, 2011 - 1E Blog"}], "Content": ["Did you know that more than $12.3 billion is spent to maintain unused software and shelfware each year in the United States? Thats more than $400 spent per PC on unused software and an additional $150 spent on shelfware per user per year.", "Register:", "https://www119.livemeeting.com/lrs/8000180417/Registration.aspx?pageName=gw3g5gz0bnrhdsbp"], "Author": ["Rod Trent"], "Date": "2011-05-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/03/1e-appclarity-why-is-it/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: 1E AppClarity ", "Author": "1E AppClarity "}, {"Comment": "Pingback: 1E AppClarity  \"Why is it?\" - 1E Blog", "Author": "1E AppClarity  \"Why is it?\" - 1E Blog"}], "Content": ["", ""], "Author": ["Rod Trent"], "Date": "2011-05-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/05/02/what-appclarity-does/", "Area": ["1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: What AppClarity does - 1E Blog", "Author": "What AppClarity does - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-05-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/29/software-developer-1e-uses-culture-killer-case-studies-to-sell-savings/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Software Developer 1E Uses Culture, Killer Case Studies to Sell Savings - 1E Blog", "Author": "Software Developer 1E Uses Culture, Killer Case Studies to Sell Savings - 1E Blog"}], "Content": ["But, says 1E founder and CEO Sumir Karayi, money and growth shouldnt be the primary drivers for a successful software company; his focus is on having fun.", "When we spoke with him recently, Karayi emphasized the importance of fun, and offered some great tips for software entrepreneurs (while owning up to his past mistakes).", "Read the full article"], "Author": ["Rod Trent"], "Date": "2011-04-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/28/plugging-it-budget-holes/", "Area": ["1E News", "1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Plugging IT budget holes - 1E Blog", "Author": "Plugging IT budget holes - 1E Blog"}], "Content": ["Its often the job of finance folks to try and plug the holes in departmental budgets where the money leaks out. With the IT budget, that can be tough. Hows it possible to stay on the cutting edge of technology without spending on the things that make it work?", "Companies trying to squeeze more out of their tech budgets should look for one big wasteful item:", "Software theyve paid for but arent using."], "Author": ["Rod Trent"], "Date": "2011-04-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/26/1es-nick-milne-home-on-smart-grid-technology/", "Area": ["1E News", "Green IT"], "Comments": "", "Content": ["", "1E President, Nick Milne-Home, discusses the companys innovative platform technology"], "Author": ["Rod Trent"], "Date": "2011-04-26 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/26/1e-welcomes-paul-thomsen-to-the-family/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1E Welcomes Paul Thomsen to the Family! - 1E Blog", "Author": "1E Welcomes Paul Thomsen to the Family! - 1E Blog"}, {"Comment": "Congrats Paul", "Date": "2011-04-27 11:57:00", "Author": "April 27, 2011 at 11:57 am"}], "Content": ["My first day at 1E!"], "Author": ["Rod Trent"], "Date": "2011-04-26 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/26/1es-nightwatchman-is-1-of-the-top-5-things-cios-can-utilize-to-green-their-computer-fleet/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: 1E", "Author": "1E"}, {"Comment": "Pingback: 1Es NightWatchman is 1 of the top 5 things CIOs can utilize to green their computer fleet - 1E Blog", "Author": "1Es NightWatchman is 1 of the top 5 things CIOs can utilize to green their computer fleet - 1E Blog"}, {"Comment": "A Green PC is especially designed to minimize power consumption which is one of its advantages. It draw less power than normal PCs and support sleep modes, in which the computer powers down all unnecessary components when it is inactive.", "Date": "2011-08-08 03:57:00", "Author": "remote computer support"}], "Content": ["Theres plenty of greenwashing in the IT business. Almost every vendor is offering some sort of green angle in their sales pitch with products boasting lower power consumption, improved manufacturing processes and recyclable materials. But does all of this stack up within the procurement cycle? Can the CIO provide a robust and flexible computing environment that ticks the green boxes?", "Read the full article"], "Author": ["Rod Trent"], "Date": "2011-04-26 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/22/1es-geoff-collins-on-how-appclarity-solves-the-software-efficiency-problem/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["1E Product Manager, Geoff Collins, discusses research findings on Software Efficiency"], "Author": ["Rod Trent"], "Date": "2011-04-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/22/1e-helps-2-of-the-top-15-winners-of-the-2011-green-15-awards/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management"], "Comments": [{"Comment": "Pingback: 1E helps 2 of the top 15 winners of the 2011 Green 15 Awards - 1E Blog", "Author": "1E helps 2 of the top 15 winners of the 2011 Green 15 Awards - 1E Blog"}], "Content": ["Its an extreme honor to be involved in helping our customers become recognized for their cost and environment saving activities. It means so much us that our solutions are being utilized in such significant ways.", "", "Read the full story"], "Author": ["Rod Trent"], "Date": "2011-04-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/21/mms-2011-post-interview-brian-tucker-solutions-engineer-and-booth-presenter-mms2011-msteched/", "Area": ["1E News", "1E Products", "AppClarity", "Events", "MMS", "Software Asset Management", "Software License Optimization", "TechEd"], "Comments": [{"Comment": "Pingback: MMS 2011 Post-Interview: Brian Tucker, Solutions Engineer and Booth Presenter #mms2011 #msteched - 1E Blog", "Author": "MMS 2011 Post-Interview: Brian Tucker, Solutions Engineer and Booth Presenter #mms2011 #msteched - 1E Blog"}], "Content": ["Our interview today is with Brian Tucker from the Solutions group at 1E.", ""], "Author": ["Rod Trent"], "Date": "2011-04-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/21/new-whitepaper-pragmatic-software-governance/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: New Whitepaper: Pragmatic Software Governance - 1E Blog", "Author": "New Whitepaper: Pragmatic Software Governance - 1E Blog"}], "Content": ["This whitepaper sets out the 1E view of software governance and compliance, highlighting that the correct approach is not to overspend and overprovision, but nor is it to wait for your chosen software vendors to audit your enterprise. The answer is to get the balance just right.", "Download the whitepaper"], "Author": ["Rod Trent"], "Date": "2011-04-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/21/new-whitepaper-save-millions-of-dollars-just-by-managing-software-licenses-more-efficiently/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["This whitepaper sets out why 1E believes that organizations could save millions of dollars by managing their software licenses more efficiently, reallocating them across the business to reduce waste and dramatically cutting costs by removing licenses they dont need altogether.", "Download the paper"], "Author": ["Rod Trent"], "Date": "2011-04-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/21/12-3-billion-spent-on-unused-software-in-u-s-organizations-business-news/", "Area": ["1E News", "1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: $12.3 billion spent on unused software in U.S. organizations. ", "Author": "$12.3 billion spent on unused software in U.S. organizations. "}, {"Comment": "Pingback: $12.3 billion spent on unused software in U.S. organizations.  Business news - 1E Blog", "Author": "$12.3 billion spent on unused software in U.S. organizations.  Business news - 1E Blog"}], "Content": ["Bangalore: Organizations annually spend a lot of money on the maintenance of unused software which eventually become a shelfware product for the companies. The money that is shelled out by organizations sums up to a huge amount. In U.S. and U. K., the amount comes up to $15.3 billion, where U.S. alone is $12.3 billion.", "Read the full article:", "$12.3 billion spent on unused software in U.S. organizations.  Business news"], "Author": ["Rod Trent"], "Date": "2011-04-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/21/appclarity-and-nightwatchman-in-mms-2011-product-roundup-mms2011/", "Area": ["1E News", "AppClarity", "Events", "MMS"], "Comments": "", "Content": ["Read the full list of noted products and companies:", "http://www.windowsitpro.com/blogs/windows-os-and-deployment/entryid/76333/mms-2011-product-roundup"], "Author": ["Rod Trent"], "Date": "2011-04-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/20/hanging-out-at-the-green-it-summit-april-20th-and-21st/", "Area": ["1E News", "Events", "Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Hanging out at the Green IT Summit, April 20th and 21st - 1E Blog", "Author": "Hanging out at the Green IT Summit, April 20th and 21st - 1E Blog"}], "Content": ["The 2011 Green IT Summit, held at the Ritz Carlton Tysons Corner in McLean, VA, serves as a follow-up to the 2010 GreenGov Symposium on sustainable IT and the performance goals set by President Obamas Executive Order 13514 on Federal Leadership in Energy, Environmental, and Economic Performance. This two-day conference draws leaders and innovators from both the private and public sectors to collaborate on building actionable plans around energy efficiency, power management, cloud computing, virtualization and green IT.", "1E is proud to be a key sponsor at this event with several of our customers presenting over the two days."], "Author": ["Rod Trent"], "Date": "2011-04-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/20/worried-about-skynet/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Worried about Skynet? - 1E Blog", "Author": "Worried about Skynet? - 1E Blog"}], "Content": ["A quick way to help is by running a decommissioning report in NightWatchman Server Edition. This lists your servers which arent doing anything useful and only takes a few seconds to run. Next step is to turn them off before they get used for nefarious purposes. There, job done.", "Plus youll have fewer servers to update with the Skynet security patch next Tuesday, and youll have saved energy too.", ""], "Author": ["Andy Hawkins"], "Date": "2011-04-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/19/hear-noble-drillings-windows-7-migration-story-join-1e-webinar-on-april-21-at-1230pm-et930am-pt/", "Area": ["1E News", "Events", "Nomad", "Windows 7"], "Comments": [{"Comment": "Pingback: Hear Noble Drilling", "Author": "Hear Noble Drilling"}, {"Comment": "Pingback: Hear Noble Drillings Windows 7 Migration Story  Join 1E Webinar on April 21 at 12:30pm ET/9:30am PT - 1E Blog", "Author": "Hear Noble Drillings Windows 7 Migration Story  Join 1E Webinar on April 21 at 12:30pm ET/9:30am PT - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-04-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/19/1es-appclarity-can-help-you-secure-better-software-deals-even-with-the-likes-of-oracle/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: 1E", "Author": "1E"}, {"Comment": "Pingback: 1Es AppClarity can help you secure better software deals, even with the likes of Oracle - 1E Blog", "Author": "1Es AppClarity can help you secure better software deals, even with the likes of Oracle - 1E Blog"}], "Content": ["The question to weigh is whether such a move makes financial sense in the longer term, since annual maintenance fees may kick in on some products before a customer is actually prepared to start using them, Jones added. Oracles discounting policy can lure you into buying excess products and capacity and then you are doomed to pay maintenance on this shelfware forever, he wrote.", "Shelfware, unused software, remains a pervasive problem in the IT industry, according to a new survey commissioned by 1E, maker of AppClarity, an application that looks for software waste in an organisations IT environment. More than 80 percent of roughly 500 respondents to the study in the US and UK said they had shelfware.", "Maintenance fees over time add up to far more than the initial cost of licences, which are commonly discounted substantially off list price. Vendors prize maintenance fees, since they provide steady revenue even when new licence sales are hard to find. This makes it difficult for customers to get vendors like Oracle to budge.", "Read the full article"], "Author": ["Rod Trent"], "Date": "2011-04-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/19/businesses-waste-more-than-400-on-software-per-pc-computerworlduk-com/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Software managers seem to concentrate more on licence compliance than on what is actually needed.", "Read full article"], "Author": ["Rod Trent"], "Date": "2011-04-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/04/19/good-gear-guide-how-much-money-are-you-wasting-in-unused-software-licenses/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Good Gear Guide: How much money are you wasting in unused software licenses? - 1E Blog", "Author": "Good Gear Guide: How much money are you wasting in unused software licenses? - 1E Blog"}], "Content": ["One of the most common ways businesses waste money is buying software that will never be used, but how much money exactly is being thrown down the drain in this manner?", "Read the full article"], "Author": ["Rod Trent"], "Date": "2011-04-19 00:00:00"}]