[{"Tags": ["nightwatchman", "ports", "power management", "wakeup"], "URL": "http://blogs.1e.com/2010/04/28/port-usage-for-nightwatchman-mgmt-ctr-power-management-products/", "Area": ["1E Products"], "Comments": [{"Comment": "you are truly a excellent webmaster. The web site loading speed is incredible. It kind of feels that youre doing any distinctive trick. Moreover, The contents are masterwork. youve done a excellent task in this topic!", "Date": "2011-10-18 05:15:00", "Author": "capital asset management software"}], "Content": [], "Author": ["Ed Aldrich"], "Date": "2010-04-28 00:00:00"}, {"Tags": ["case study", "csc", "customer", "drowsy server", "green it", "nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/04/28/part-1-csc-embarks-on-the-nightwatchman-server-edition-journey-with-1e/", "Area": ["1E Customers", "1E News", "1E Products", "Green IT", "Server Power Management"], "Comments": [{"Comment": "Pingback: Are You Ready for Datacenter Efficiency? | 1E Blogs", "Author": "Are You Ready for Datacenter Efficiency? | 1E Blogs"}, {"Comment": "Pingback: PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 2: The Data Center | 1E Blogs", "Author": "PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 2: The Data Center | 1E Blogs"}], "Content": ["CSC has been exploring many different energy saving initiatives in its data centers, Upon viewing a demonstration of 1Es newest power management tool designed to revolutionize data center efficiency and server power management, saw an opportunity to reduce power consumption without increasing hardware or considering server room expansions. CSC and 1E decided to team up and create this online pilot, delivering a case study at the end of the project.", "Throughout this blog, we invite our partners and customers to walk with us through our journey of installing and using NightWatchman Server Edition from 1E on a test group of servers within CSC to reduce our energy consumption.", "The first step on our pilot was to engage CSC data center teams, application owners, server administrators, Service Delivery Managers (SDMs) and create the project team. To kick off and get everyone onboard, we set up a web conference where the 1E team did a demo for CSC of the product and briefed the team on the features.", "One of the lessons learned through this initial process was that a server system administrator was not always the person to ask whether a new tool can be installed! Thankfully, CSC has a very strong change management process, where we discovered we needed to widen our circle of stakeholders for the project, and invited the application owners to join our teams."], "Author": ["customer spotlight bloggers"], "Date": "2010-04-28 00:00:00"}, {"Tags": ["drowsy server", "nightwatchman", "nightwatchman server edition", "pc power management", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/04/21/mms2010-it-takes-more-than-a-volcano-to-stop-1e/", "Area": ["1E News", "1E Products", "Green IT", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Congratulations to 1E founder, Phil Wilcock, for a Vegas wedding at MMS 2011! #mms2011 | 1E Blogs", "Author": "Congratulations to 1E founder, Phil Wilcock, for a Vegas wedding at MMS 2011! #mms2011 | 1E Blogs"}], "Content": ["So disappointed that 1E CEO Sumir Karayi, Mark Blackburn and myself didn't make it to Vegas for MMS2010! Seems there wasa bit ofdust around or something", "If you are there however, do NOT miss the exciting stuff that our guys who did make it out there will be showing off (not jealous at all Ed) here's the Press thingy", "For System Center customers, NightWatchman provides increased return on investment (ROI) through genuine power savings and enhanced computer health, reporting and remediation. For example, 1Es Nomad Enterprise allows branch office server consolidation and zero touch Windows 7 deployment. In addition, Configuration Manager customers using 1Es Shopping software will benefit from self service through a highly customizable work flow-based Web portal.1E solutions have been maximizing efficiencies to the System Center Configuration Manager infrastructures for more than a decade."], "Author": ["Phil Wilcock"], "Date": "2010-04-21 00:00:00"}, {"Tags": ["microsoft management summit", "mms2010", "nightwatchman", "nightwatchman server edition", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2010/04/15/1e-founders-reunited-for-mms2010/", "Area": ["Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["Before I decided to take up the farming life, I attended this event from 1999 to 2005. So it may come as a surprise to some to learn that my old friend and 1E CEO Sumir Karayi has managed to coax me out of my rural idyll here at Hillside Farm for a few days to attend the 2010 event! Fellow co-founder Mark Blackburn will be there too, and I think this may be the first conference that we've all attended in around 10 years. Excited? You bet.", "see you in Vegas", ""], "Author": ["Phil Wilcock"], "Date": "2010-04-15 00:00:00"}, {"Tags": ["hillside farm"], "URL": "http://blogs.1e.com/2010/04/13/hillside-farm-spring-update/", "Area": ["1E Community", "The Green Room"], "Comments": "", "Content": ["Yes thats right. No energy efficiency, and not a Data Center in sight! Now that the long cold winter seems to be finally (and very gradually) fading into memory, I though I would share an update from my other job as custodian of the family farm .", "So for the last few weeks I and my neighboring farmers have been collectively willing the ground to warm up sufficiently for the grass to start growing. It took a real hammering in the Winter months and this time of year always makes us slightly nervous as you see your stocks of Winter forage dwindle while waiting for the first green shoots of Spring. We managed to plant 275 Cider Apple trees between frosts too, so Ive been keeping a particularly close eye on them as they didnt go into the ground in the best conditions. This week finally saw some buds appearing from the bravest little trees however, and within a few days they were all stretching up to the warm sun and bursting out all over.", "We had thousands of Pinkfoot Geese invading over the Winter in search of food. Flocks of 5000+ were not uncommon, and as they mostly eat grass Im glad to see the back of them as they return to Iceland for the Summer. We seem to have a stray pair that has decided to stick around this year however, having taken up residence on one of our ponds. Maybe well see some goslings in a few weeks!", "Around the farmyard itself, Spring is a busy time. Machinery maintenance and preparation, roof and water pipe repairs all taking priority this year. The grassland needs lots of attention this year due to the hard frosts, so today Ill be dusting off the grass harrow and scarifying the pastures in order to stimulate growth. Pulling out all of the old, dead grass makes way for new shoots and helps to get sunlight onto the cold soil. I will also be spreading some lovely composted pig manure onto the meadows which is a bit like rocket fuel for grass..", ""], "Author": ["Phil Wilcock"], "Date": "2010-04-13 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "pue", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/04/07/global-data-center-efficiency-standard-agreed-almost/", "Area": ["1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["What is more relevantand also very imporant to us folks here at 1E is a standard for measuring Data Center Efficiency, which is just one of the things we're about. Fortuitously enough then, that news reaches me today via the global telegraph, that good sense has prevailed in the world of Data Center metrics in the form of an agreed global standard in this field. Almost.", "This is important so that Data Centers of all shapes, sizes and nationality can be measured with the same set of rules, and it will also help to quantify the effectiveness of so called 'Green IT' initiatives with a recognised standard. In plain English, that means the CFO's may be a little happier about paying for it!", "One important entry in the agreement, which I feel has been a tad unreported, is in the following paragraph of the document.", "So, as you can see I've highlighted the bit that excites me  just in case you missed it. This is what we've been trying to get over to people here at 1E for years, and that is the fact that it's all very well measuring the amount of energy that comes into the data center, and you can even measure things at the individual rack or UPSlevel, but to achieve true efficiency you need to monitor individual servers to see just what they are doing. Just because a server is on, well, it don't mean a thing.", "In the next paragraph of the agreement, it states:", "In summary, I think that this agreement signifies a great leap forward in Data Center efficiency measurement. China and India have yet to get involved but I'm sure it's just a matter of time, and then we will at least have a chance to implement true global energy savings.", ""], "Author": ["Phil Wilcock"], "Date": "2010-04-07 00:00:00"}, {"Tags": ["carbon offsetting", "carbon retirement", "carbon trading", "emissions trading scheme"], "URL": "http://blogs.1e.com/2010/04/06/give-your-carbon-emissions-early-retirement/", "Area": ["Green IT"], "Comments": "", "Content": ["Planting trees will only result in carbon absorption for the life of the tree. At some point it will die off and release the carbon back into the atmosphere. So tree planting simply cannot offset sustained overproduction.", "Carbon credits have also come under fire for funding projects that would have gone ahead anyway. Companies in the developing world are being paid retrospectively for energy efficiency projects that just made good business sense and have already been deployed. Not quite what we had in mind?", "Overall, I would say that there's just too much scope for cheating with offsetting, so I set off in search of an alternative and didn't have to look too hard.", "So, a company may decide to reduce its emissions by using a cleaner but more expensive type of fuel. Under the EU ETS this may save them money, as they will now need to buy fewer allowances to cover their emissions. If the fuel is so clean that it reduces the company's emissions below their allocation, they can sell the extra allowances to other companies that haven't been able to reduce their emissions enough.", ""], "Author": ["Phil Wilcock"], "Date": "2010-04-06 00:00:00"}, {"Tags": ["climate change", "copenhagen", "economist intelligence unit report"], "URL": "http://blogs.1e.com/2010/03/31/post-copenhagen-2009-where-are-we-now/", "Area": ["1E News", "Green IT"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-03-31 00:00:00"}, {"Tags": ["1e", "carbon reduction", "data center", "energy efficiency", "green buildings", "green it", "nightwatchman server", "nightwatchman server edition", "nwse", "reduce costs", "virtual sprawl"], "URL": "http://blogs.1e.com/2010/03/26/the-20-million-server/", "Area": ["1E Products", "Data Center", "Green IT", "IT Efficiency", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: Tweets that mention The $20 Million Server | 1E Blogs -- Topsy.com", "Author": "Tweets that mention The $20 Million Server | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: 1Es 2010 Blog Year in Review | 1E Blogs", "Author": "1Es 2010 Blog Year in Review | 1E Blogs"}], "Content": ["Space is becoming more of a valuable commodity in data centers. With the lack of affordable ground space, over-stretched power grids and tightening efficiency legislation, building a new data center is often not an option. Consider the New York area where I live. Clearly there is a huge demand for high-tech and this means servers and data centers, however, whilst there is the infrastructure to build a data center on the banks of the Hudson, the area lacks both the physical space and the grid capacity to support one. In fact, the New York city metro area is significantly over capacity at present which has caused a noticeable impact on service, most severe on August 14th in 2003 when the already strained power grid was brought to its knees by a suspected system failure somewhere in Ontario, Canada. Generators from the North-East United States; including New York, tried in vain to shunt power westward to the affected areas causing a widespread blackout of Ontario, the North-East US, and parts of Michigan and Ohio.", "To further confirm the observation that the New York metro grid is strained, it was reported that in the summer of 2004 New York Citys peak energy load was 11,150MW whilst the physical capacity on the grid was a mere 8,940MW and in addition, it is known, that due to constraints with the transmission lines, the vast majority of power for New York City must be generated within the city limits during peak times which does not provide a great deal of slack. Worst of all, the New York City and Long Island zones electricity generating infrastructure has the highest average age of generating units in the state and is still highly dependent on an aging fleet of combustion and gas turbine plants bringing its long-term reliability into question.", "These factors all combine to produce the $20 million server effect or the one server that simply cannot fit in a full-to-capacity facility and therefore is the catalyst for building a new data center. A large number of companies are very reactive in terms of their capacity and often, due to a combination of cost, complexity and sometimes Im sure, an element of denial, new facilities are built on-demand rather than in advance. Instead of allocating budget, sourcing planning permission, carrying out the design work and breaking ground on a new data center before the extra capacity is needed, often projects that require new infrastructure tip the balance of capacity over the edge and the building of a new data center becomes a knee-jerk reaction instead of a proactive exercise. The $20 million server becomes a reality.", "So how can this be avoided? Considering the challenges of actually locating and building a datacenter, making more efficient use of what you have is, in many cases, a much better and more cost effective option. Technologies such as virtualization and cloud computing can help to relieve the burden on over stressed facilities. In addition, gaining visibility into the consumption and efficiency of servers is an important component is building up a picture of wasted resources. Knowing whether or not a server is useful enables the business to make more informed decisions about reallocation of hardware to reclaim precious space and capacity in the data center."], "Author": ["Andy Dominey"], "Date": "2010-03-26 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/03/26/interesting-thoughts-from-our-ceo/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-03-26 00:00:00"}, {"Tags": ["1e wakeup", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2010/03/25/helping-ford-save-a-million-and-more/", "Area": ["1E News", "Green IT", "PC Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-03-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/03/16/are-tradable-energy-quotas-a-viable-alternative-to-carbon-trading/", "Area": ["1E Community", "The Green Room"], "Comments": "", "Content": ["Whats wrong with good old Carbon Trading?", "So Give us an Alternative Then!", ""], "Author": ["Phil Wilcock"], "Date": "2010-03-16 00:00:00"}, {"Tags": ["nightwatchman server", "reduce costs", "systems management", "virtualization"], "URL": "http://blogs.1e.com/2010/03/15/the-bad-kind-of-sprawl/", "Area": ["1E Products", "OS Deployment"], "Comments": [{"Comment": "Pingback: Tweets that mention The Bad Kind of Sprawl | 1E Blogs -- Topsy.com", "Author": "Tweets that mention The Bad Kind of Sprawl | 1E Blogs -- Topsy.com"}], "Content": ["When I hear the word sprawl, I always think of stretching out by the pool on a lazy day in the sun, clutching a mojito or lying in bed late on a Saturday. That is the good kind of sprawl. However, there is an altogether more sinister use of the word. I am referring to the emerging issue of virtual machine sprawl.", "In recent years, a number of new technologies have emerged in an effort to slow the growth in the number of servers and to make server provisioning, management and monitoring easier and more efficient. The most prevalent of these new technologies is Virtualization.", "In simple terms, virtualization is the concept of containing many servers within a single physical box. Imagine putting shoeboxes within a single, larger box. Anything you place in the shoebox will be inherently contained within the large box but will be separate from something located in another shoebox. This idea is effectively how virtualization works. Each virtual server is allocated a portion of the physical machine and is separated from both the physical hardware, the operating system running on the hardware and other virtual machines by a layer called a Hypervisor. The basic concept of virtualization is shown in the image below:", "Virtualization was designed with the intention of reducing cost and complexity of provisioning and maintaining servers in the datacenter. Firstly, you can have many servers running on a single piece of hardware, and since space is a valuable commodity in the datacenter and cooling is expensive, it reduces the demand on floor space and infrastructure. Secondly, since there is no need to provision hardware every time a server is needed, the process for building a new server is greatly simplified and accelerated. Also, management of these virtual machines is made easier using proprietary tools that are often provided with the virtualization solution such as VMWares vCenter and Microsofts System Center Virtual Machine Manager.", "However, with any new technology comes challenges, and whilst virtualization has been hailed by some as the silver bullet to resolve power and space concerns in the datacenter, it brings with it its own inherent problems; one of which is virtual machine sprawl.", "Virtual machine sprawl refers to the result of poor provisioning and management of a virtual environment where many virtual machines are created and configured, and then are simply forgotten about. The environment sprawls out of control and the snowball effect takes over. The more virtual machines that exist, the more difficult it is to manage and find unused virtual machines. Instead of re-using machines, another is created and the cycle perpetuates. This is virtual machine sprawl.", "Of course, this doesnt happen overnight but the biggest concern is not that it is happening, but that many users of virtualization are simply not aware of it. So the next question is How does it happen?", "Virtual machines are quick to provision and often at seemingly no cost to the application owner and end user. This mindset leads to virtual machine sprawl. If we compare the process for provisioning a physical server with that of creating a new virtual machine, the situation becomes clearer. Provisioning a new physical server is often laborious and time consuming and can look similar to the following:", "As you can see, there are a lot of steps here and this is by no means an exhaustive list. In addition, some of these steps can take a considerable amount of time to complete, often resulting in the process taking several months. Not to mention the added complexity of finding space and power in datacenters that in some cases are nearing capacity.", "Now lets compare that to the process for building a virtual machine:", "Of course, this list is being somewhat flippant but at the same time, this idea that virtual machines can be created quickly and at little or no cost often leads to virtual machines being created for testing, application development and expanding production applications and not being repurposed or deleted when no longer used. This, in turn, leads to an increase in management overhead, increased hardware demands on the physical hosts and unnecessary licensing costs for machines that are not in use."], "Author": ["Andy Dominey"], "Date": "2010-03-15 00:00:00"}, {"Tags": ["data center", "green buildings", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/03/09/smart-buildings-and-smart-it-can-they-work-together/", "Area": ["Data Center", "Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["We often used to come up against a brick wall of an objection to computerpower management in the form of an IT boss who would usually resort to something along the lines of 'We don't pay the power bill so why should we care about saving electricity in this department?' Good Point! Recently however I've been catching snippets of stories that seem to indicate that things are finally changing. The question that still remains for me however is 'cancompany wide energy management programs everwork'?", "Recent announcement by some fairly large players seem to suggest that some people think that is can.", "What's also important too is the overall emissions reporting. It's no use implementing all of this smart energy saving kit is you can't quantify the savings, so IBM and Johnson Controls are working to include carbon reporting into the whole solution.", "We think that this is an interesting space to watch in 2010, as more players realise the potential for partnering with other best of breed energy management providers in order to create solutions that are ultimately more attractive to corporates who are looking to save energy whether it be for financial, legislative or even moral reasons. And while I am not usually a proponent of bigger is better, I think that the sooner energy management is taken seriously on a huge scale by the likes of IBM, CISCO, Power Companies and governments the better.", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-03-09 00:00:00"}, {"Tags": ["crc energy efficiency scheme", "nightwatchman", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2010/03/04/whitepaper-the-crc-energy-efficiency-scheme/", "Area": ["Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["Yet another quality whitepaper drops of the production line here at 1E central! Hot off the press, here's the scoop.", "As ever this is a really useful document regardless of whether your company will be part of the scheme or not. If you are at all interested (and you should be!) in saving energy in your PC and server populations, take half an hour out and read this.", ""], "Author": ["Phil Wilcock"], "Date": "2010-03-04 00:00:00"}, {"Tags": ["green it", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2010/02/23/power-management-design-guide-from-climate-savers-computing/", "Area": ["1E Products", "Green IT", "PC Power Management"], "Comments": "", "Content": ["It explains the S3 power state, the user experience (very important!), how to test your machines etc. in a structured easy to follow way. I would thoroughly recommend that you download this guide  and of course our 1E whitepapers such as Why Power Schemes Are Not Enough. With hundreds of thousands of unmanaged desktops still out there, there's no excuse not to get started and save energy (and money) right away..", "Downloads"], "Author": ["Phil Wilcock"], "Date": "2010-02-23 00:00:00"}, {"Tags": ["anaerobic digestion", "renewable energy"], "URL": "http://blogs.1e.com/2010/02/22/one-mans-cow-poo/", "Area": ["The Green Room"], "Comments": "", "Content": ["I attended a funeral recently, of a farming neighbour who passed away at the ripe old age of 82. The local Vicar was a great friend of Bills and Bill used to mow the grass around the church. One day Bill was cycling past the vicarage and the vicar was sweeping leaves outside. Look at me Bill, with all my ecclesiastical training and here I am, a road sweeper. To which Bill replied Dont worry Vicar, Ive been a toilet attendant to a bunch of cows for the last 60 years! He will be missed"], "Author": ["Phil Wilcock"], "Date": "2010-02-22 00:00:00"}, {"Tags": ["carbon reduction", "climate change", "climate change levy", "energy efficiency", "green it", "greening it"], "URL": "http://blogs.1e.com/2010/02/11/the-great-green-hope/", "Area": ["Green IT"], "Comments": "", "Content": ["For many of you, the issue of climate change and global warming will not be new. It is widely accepted by scientists and leading minds around the world, that our climate is radically changing and that we, humans, are primarily to blame.Greenhouse gasses and CO2 emissions are damaging our atmosphere, choking plants and animals and slowly raising the temperature of our planet. In addition, we have a finite amount of resources which we seem intent on consuming as if they were limitless.", "However,despite painting a stark picture of the situation we find ourselves in, all is not lost. Governments around the world are becoming more and more aware of the plight of the planet and making difficult decisions today to preserve the world for future generations. Companies are becoming increasingly aware and concerned with their Green Footprint; how much impact their existence has on the planet. Oil giants are investing more and more time and money into looking forways we can overcome our insatiable hunger for fossil fuels which are set to run out in our childrens lifetime.", "The UN held climate change talks in Copenhagen (COP15), in December 09, which was attended by a number of world leaders including US President Obama. The goal was to unite developing and developed countries in their quest for climate change,specifically by discussing and agreeing carbon emissions reductions targets."], "Author": ["Andy Dominey"], "Date": "2010-02-11 00:00:00"}, {"Tags": ["dsuw", "patch management", "secupdates"], "URL": "http://blogs.1e.com/2010/02/05/how-to-make-security-patch-deployments-in-3-easy-steps/", "Area": ["ConfigMgr"], "Comments": "", "Content": ["Heres a step-by-step recap of a very simple process to do security patching, in 3 simple steps!", "", "", "This also assumes having first created a Deployment Template where no Collection was specified when created (Im using Lab SW Deployment here; there is nothing fancy in its configuration at all):", "", "1.       Select desired updates for deployment (this example uses a 3 month period of updates) in CfgMgr MMC Console using a SEARCH folder", "a.       SW Updates > Update Repository > Search Folders", "b.       R-click > New Search Folder", "c.       In the wizard, select Date Released > Date Released=Last 3 months; Vendor= Microsoft; and Search All Folders Under This Feature (and give the folder a name)", "e.       Select all Required updates; r-click and select Update List to create a new Update List (Lab SW Update List in my example)", "f.       Launch the Update List Wizard to Create a new update list", "", "g.      Next, next, next, Finish  very simple and straightforward", "2.       Navigatein the Consle to the Update List > Lab SW Update List and select your new Update List", "a.       Dont forget to refresh console to display the new list!", "", "", ""], "Author": ["Ed Aldrich"], "Date": "2010-02-05 00:00:00"}, {"Tags": ["ict energy use", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2010/02/04/its-not-easy-being-green/", "Area": ["Green IT"], "Comments": [{"Comment": "Pingback: Is it Getting Easier to be Green? | 1E Blogs  Insight and debate on IT Efficiency", "Author": "Is it Getting Easier to be Green? | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Its not easy being green  is the name of a popular TV series here in the UK. Its also an increasingly popular mantra around these parts. Having just returned from a trip to my local recycling depot, Im feeling a little ashamed, and before you even think it, no, I didnt deliberately put my green bottles in the brown bin. Nor is it related to the amount of empty beer cans deposited (I just buy kegs now to save the embarrassment)."], "Author": ["Phil Wilcock"], "Date": "2010-02-04 00:00:00"}, {"Tags": ["climate change", "green it", "greening it"], "URL": "http://blogs.1e.com/2010/02/01/free-greening-it-book-update/", "Area": ["Green IT"], "Comments": "", "Content": ["The concept is a good one  get lots of writers together who are passionate and knowledgeable about the many and varied aspect of Green IT, get them to write about their individual area of expertise, and then release it. For Free.", "The idea is to invite contributing authors in a collaborative effort to cover as many areas of Green IT as possible, as opposed to one guy sitting in a room for months, doing tons of research, then emerging in his Metallica t-shirt smelling slightly of cheesy puffs holding a piece of work that is already out of date..", "Each release of the work contains more and more interesting chapters. Here is the latest list.", "Now check out that last chapter title! If that doesn't stimulate your curiosity then nothing will, and a great, thought provoking piece it is too. in it, Flavia talks about the less obvious ways in which IT is already helping many causes in the fight against climate change and injustice.", "Download the book, it's in PDF format and at just under 200 pages an easy and pleasant read. And if you think you could, why not contribute?"], "Author": ["Phil Wilcock"], "Date": "2010-02-01 00:00:00"}, {"Tags": ["drowsy", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/01/28/whitepaper-nightwatchman-server-edition-drowsy-state-explained/", "Area": ["1E Products", "Green IT", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-01-28 00:00:00"}, {"Tags": ["afcom", "data center", "green it", "server power management"], "URL": "http://blogs.1e.com/2010/01/21/afcom-datacenter-report-highlights-need-to-do-more-with-less/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [""], "Author": ["Phil Wilcock"], "Date": "2010-01-21 00:00:00"}, {"Tags": ["energy efficiency", "green it"], "URL": "http://blogs.1e.com/2010/01/18/beating-the-energy-efficiency-paradox/", "Area": ["Green IT"], "Comments": [{"Comment": "Pingback: Tweets that mention Beating the Energy Efficiency Paradox | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Beating the Energy Efficiency Paradox | 1E Blogs -- Topsy.com"}], "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-01-18 00:00:00"}, {"Tags": ["climate change", "el nino"], "URL": "http://blogs.1e.com/2010/01/13/so-just-why-is-it-so-cold-then/", "Area": ["The Green Room"], "Comments": "", "Content": ["Anyway, as is often the case on these matters, help arrived in the form of Pete Smith, our 1E Environment Strategist. He had obviously been experiencing the same inane and tedious climate change denial rumblings and had put together an email with excellent information as to just where all of this chilly weather was coming from. So I felt that I must share it with the world, in the hope that anybody out there who is plagued by questions of this nature will be armed with the finest information to hand. Take it away Pete"], "Author": ["Phil Wilcock"], "Date": "2010-01-13 00:00:00"}, {"Tags": ["nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2009/12/16/useful-work-whitepaper/", "Area": ["1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["What more could you ask for?"], "Author": ["Phil Wilcock"], "Date": "2009-12-16 00:00:00"}, {"Tags": ["1e wakeup", "green it", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2009/12/01/1enewsmicrosoft-technology-centers-add-1e-solutions-to-sustainable-it-briefings/", "Area": ["1E News", "1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["", "Microsoft Technology Centers provide the resources that the modern enterprise needs  from technology experts to an exceptional technology environment  to envision, plan, build, deploy, operate, and optimize a secure, customized solution, based on Microsoft and partner technologies. Microsoft is joined by industry leaders such as 1E in hardware, software and services, who work together to create and drive joint technology initiatives and solutions. By augmenting Microsofts capabilities, companies like 1E help Microsoft deliver a more complete customer solution.", "\"The MTC offers a range of executive briefings and earlier this year, we decided to create a new briefing, focused, on sustainable IT to address the very real environmental challenges facing modern business,\" comments Chuck McCann, MTC Alliances Program Director. \"In order to fully showcase the best technologies available, we needed to collaborate with specialists in the field. 1E was the natural choice as it offers power management solutions with excellent technology and fully featured solutions.\"", "1E NightWatchman is the worlds leading PC power management solution with four million licensed users worldwide. Since it was launched a decade ago, 1E has saved customers USD$360 million in energy costs alone. In the year 2009, 1E will save 1 million US Tons of CO2 from entering the atmosphere, the equivalent of the amount of CO2 emitted from burning 2.4 million barrels of oil.", "Shopping from 1E automates the request, approve, license and delivery cycle of end-user software distributions to significantly reduce operational cost and software spend while allowing IT helpdesk staff to focus on more strategic tasks. This self-service solution dramatically increases user satisfaction, is implemented rapidly and easily integrates with in-house applications. The result is a more agile IT infrastructure which puts users in control of the IT resources available to them.", "Now installed in over 5 million seats worldwide and at several 200,000+ seat organizations, 1E WakeUp is proven and scalable technology for securely powering on PCs for successful software updates. By working in synchronization with Microsoft System Center Configuration Manager 2007, 1E WakeUp increases delivery success and visibility of PC health.", "Sumir Karayi, CEO, 1E, comments: \"We are delighted to be part of the MTC experience, helping business professionals discover the best technologies to help their organisations thrive through real world demonstrations.\"", ""], "Author": ["Phil Wilcock"], "Date": "2009-12-01 00:00:00"}, {"Tags": ["nightwatchman", "reduce costs", "server power management"], "URL": "http://blogs.1e.com/2009/11/13/1e-podcast-episode-4-nightwatchman-server-edition-2/", "Area": ["1E Products"], "Comments": "", "Content": ["After the successful release of NightWatchman Server Edition in late October, Andy Hawkins (Product Manager), Richard Cudd (Lead Developer), Steve Newby (Solutions Engineer) and Andy Dominey (OpsMgr Practice Lead) take time out to chat to Dan Kregor about the capabilities of NightWatchman Server, and the cost savings that can be achieved in the data center.", "Heres where you can get the podcast:", "Stream live from 1E.com", "Download Episode 4 from iTunes", "Subscribe the the 1E Podcast Network on iTunes", "We at 1E are dedicated to bringing you real world scenarios to help solve some of the most challenging problems faced by IT professionals. If you are wrestling with an issue, would like some advice or have a topic you would like to see covered, please feel free to send me an email outlining your issue or idea. If selected for inclusion in the 1E Podcast, well make sure to get you invloved and have you contribute to the podcast."], "Author": ["Dan Kregor"], "Date": "2009-11-13 00:00:00"}, {"Tags": ["nightwatchman", "reduce costs", "server power management"], "URL": "http://blogs.1e.com/2009/11/13/1e-podcast-episode-4-nightwatchman-server-edition/", "Area": ["1E Products"], "Comments": "", "Content": ["After the successful release of NightWatchman Server Edition in late October, Andy Hawkins (Product Manager), Richard Cudd (Lead Developer), Steve Newby (Solutions Engineer) and Andy Dominey (OpsMgr Practice Lead) take time out to chat to Dan Kregor about the capabilities of NightWatchman Server, and the cost savings that can be achieved in the data center.", "Heres where you can get the podcast:", "Stream live from 1E.com", "Download Episode 4 from iTunes", "We at 1E are dedicated to bringing you real world scenarios to help solve some of the most challenging problems faced by IT professionals. If you are wrestling with an issue, would like some advice or have a topic you would like to see covered, please feel free to send me an email outlining your issue or idea. If selected for inclusion in the 1E Podcast, well make sure to get you invloved and have you contribute to the podcast"], "Author": ["Dan Kregor"], "Date": "2009-11-13 00:00:00"}, {"Tags": ["nomad enterprise", "os deployment", "windows 7"], "URL": "http://blogs.1e.com/2009/11/09/1e-nomad-enterprise-the-key-to-simple-win-7-deployments/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: Tweets that mention 1E Nomad Enterprise the key to simple Win 7 deployments | 1E Blogs -- Topsy.com", "Author": "Tweets that mention 1E Nomad Enterprise the key to simple Win 7 deployments | 1E Blogs -- Topsy.com"}], "Content": [], "Author": ["Phil Wilcock"], "Date": "2009-11-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2009/11/05/energy-cost-will-drive-it-energy-efficiency/", "Area": ["Data Center", "Green IT"], "Comments": "", "Content": ["This is already having an effect in the IT sector, specifically in the data center world. Central Washington, which has a large Hydro-electric capability from dams on the Columbia River, has already seen VMWare and Yahoo build new data centers locally, as hydro electricity is not only renewable but also relatively cheap.", "But whatever energy efficiency methods you choose to go for, one thing is for sure, energy is not going to get any cheaper. At the recent Data Center Energy Efficiency Summit hosted by the Silicon Valley Leadership Group (SVLG), there was much talk of energy efficiency initiatives, but as Mark Thiele of VMWare stated, We look at this potential for regulation as opportunity rather than a harbinger of doom, Carbon right now is at the top of the hype cycle. The reality is about efficiency, and saving our companies money. Those of us who care about the environment now have a stick to wield.", "With only 30ish days to go to Copenhagen, and with President Obama's recent visit to MIT and a Florida solar facility, it's likely that focus on the high energy consumption of IT in general and data centers in particular will remain high for some time to come.", ""], "Author": ["Rod Trent"], "Date": "2009-11-05 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2009/11/02/why-server-power-management/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["", "With PC Power Management it is easy to categorize largegroups of PCs and the workingrequirements of their users.A PC is either: on  for the user, on  for maintenance or off  because it is not required for either of the two previous requirements. Of course you can be a little more sophisticated in terms for monitor standby when the user is temporarily away from the PCetc but these are the main opportunities to save energy.", "Servers exist for very different reasons to PCs. A server exists to provide a service to someone or something. The type of service, and the availability required for those services is almost limitless. What is quite fundamental however is the following.", "Of course a server that is not providing a useful service is not only consuming energy. It still requires backup, maintenance, upgrade and also contributes to the cooling requirements of the data center.", "Here's a real world example of how we could use the above criteria.", "So you can see that Server Power Management is a complex task. Defining the policies that enable you to save energy and cost would be an enormous project if it were undertaken manually. It would take months to even get to a point where you could start to make some changes, and by that time it is quite possible that your results would be out of date! Such is the complex and fast moving environment that we inhabit today.", "", ""], "Author": ["Phil Wilcock"], "Date": "2009-11-02 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2009/10/28/podcast-how-to-save-energy-in-the-it-industry/", "Area": ["1E News", "Data Center", "Green IT"], "Comments": "", "Content": ["Just a quick update. 1E CEO Sumir Karayi is included in this interesting podcast on FT.com.", "It's well worth a listen, and includes comment from John Swainson (chief exec. at CA) as well as our own Mr Karayi."], "Author": ["Phil Wilcock"], "Date": "2009-10-28 00:00:00"}, {"Tags": ["nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2009/10/20/why-so-many-useless-servers-out-there/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["Well, here at 1E central we did a quick poll around our experienced consultants (and CEO!)- and here's what we came up with. These are all real reasons, as encountered by us out in the field..", "Anyway, these are just a few of the many and varied reasons that we found for servers beoming neglected, unused, and ultimately an expensive piece of furniture.", "So with NightWatchman Server Editionwe includecontinual analysis for physical and virtualized environments and answers tothe question, Are these servers being used for useful and productive work?. We also wanted to present this data in a meaningful way, so you can look at a simple report and instantly highlight which servers need further investigation."], "Author": ["Phil Wilcock"], "Date": "2009-10-20 00:00:00"}, {"Tags": ["data center", "nightwatchman", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2009/10/19/nightwatchman-forges-its-way-into-the-data-center-2/", "Area": ["1E Products"], "Comments": "", "Content": ["1E has industry leading experience in IT cost reduction and power management with 1100 client organizations that have saved over $300m in power costs alone. This experience provides 1E with the insight to help server managers make confident decisions regarding server decommissioning, virtual sprawl control, consolidation and power management, ultimately enabling organizations to save money and reduce their carbon footprint.", "\"The number of unused servers in the world today is staggering. A recent study we commissioned showed that 4.7 million servers in the world are not actively being used. Today, organizations are paying for energy, hardware, maintenance and software licensing, even when servers are not providing any business value. Given the economic and environmental issues we face today, there has never been a greater need for efficiency, especially in servers and data centers\" says Sumir Karayi, CEO and founder of 1E.", "", "", "1E also announced today that Bovis Lend Lease, one of the worlds leading project management and construction companies is working with 1E to deploy its solution across its servers. Dr Paul Toyne, Head of Sustainability, Bovis Lend Lease adds, \"Sustainability is a guiding principle at Bovis Lend Lease. We are always looking for innovations like 1Es NightWatchman Server Edition that could bring our carbon base load to a lower level.\"", "CSC, a global leader in providing technology enabled business solutions and services, is undertaking a case study to measure the benefits of NightWatchman Server Edition. John Glowacki, Corporate Vice President, Chief Technology Officer says, \"CSC is pleased to partner with 1E in a case study designed to measure the benefits of NightWatchman Server Edition and help CSC meet our sustainability objectives.\"", "Deploying NightWatchman Server Edition makes servers more efficient, enables consolidation of redundant infrastructure, and eliminates costs associated with unnecessary hardware and energy usage. Easy to install, there are no hardware changes required, eliminating the risk of server downtime.", "Availability", "Webinar for Existing & Prospective Customers"], "Author": ["Phil Wilcock"], "Date": "2009-10-19 00:00:00"}, {"Tags": ["data center", "green it", "nightwatchman", "server power management"], "URL": "http://blogs.1e.com/2009/10/19/new-study-shows-4-7-million-servers-globally-are-doing-nothing-useful-2/", "Area": ["1E Products"], "Comments": "", "Content": ["\"Contrary to popular belief, one of the largest causes of energy and IT operational waste in data centers are servers that are simply not being used. The savings from decommissioning non-productive servers cannot be ignored. Organisations need better information on server efficiency and more effective ongoing server energy management.\" comments Sumir Karayi, CEO, 1E.", "The key findings from the 1E/Alliance to Save Energy study are:", "? 15% or more servers are not doing anything useful according to 72% of server managers", "? Over eight in ten (83%) admit that they do not have an adequate grasp of server utilization", "? 72% of server managers polled admitted that they rely on CPU utilization as their measure of server efficiency. (Note: a CPU is busy whether the server is providing a service to the business or doing routine maintenance tasks which provide no business value)", "? 63% rely on manual checks, trial and error or wait until something is broken to find unused servers", "? 65% have virtualized unused servers and almost one in three (32%) state that they are actively seeking a solution to virtual server sprawl", "? 41% are concerned about and a further 43% are using change control procedures or software to manage virtual server sprawl, a phenomenon where a disproportionate number of virtual servers have low or zero utilization", "? 75% admit that their company's mandate to deliver high levels of IT service internally get in the way of measuring and improving server efficiency", "\"With U.S. data center energy consumption at an all time high, it's only logical that we reconsider how we are using IT resources. An unnecessary amount of data servers are 'plugged in' 24/7 in an age when power-saving tools are available to businesses. Faced with a fast-moving regulatory environment  including the U.S. climate bill, pending EPA data center initiatives and the upcoming climate talks in Copenhagen  the U.S. IT sector may soon be under greater scrutiny for its power consumption. We'll want to say ahead of the curve and make smart, energy-efficient changes where we can,\" says Kateri Callahan, president of the Alliance to Save Energy.", "The study of global server managers was conducted by Kelton Research in September 2009i."], "Author": ["Phil Wilcock"], "Date": "2009-10-19 00:00:00"}, {"Tags": ["data center", "green it", "nightwatchman", "server power management"], "URL": "http://blogs.1e.com/2009/10/19/new-study-shows-4-7-million-servers-globally-are-doing-nothing-useful/", "Area": ["1E News", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["", "\"Contrary to popular belief, one of the largest causes of energy and IT operational waste in data centers are servers that are simply not being used. The savings from decommissioning non-productive servers cannot be ignored. Organisations need better information on server efficiency and more effective ongoing server energy management.\" comments Sumir Karayi, CEO, 1E.", "The key findings from the 1E/Alliance to Save Energy study are:", "? 15% or more servers are not doing anything useful according to 72% of server managers", "? Over eight in ten (83%) admit that they do not have an adequate grasp of server utilization", "? 72% of server managers polled admitted that they rely on CPU utilization as their measure of server efficiency. (Note: a CPU is busy whether the server is providing a service to the business or doing routine maintenance tasks which provide no business value)", "? 63% rely on manual checks, trial and error or wait until something is broken to find unused servers", "? 65% have virtualized unused servers and almost one in three (32%) state that they are actively seeking a solution to virtual server sprawl", "? 41% are concerned about and a further 43% are using change control procedures or software to manage virtual server sprawl, a phenomenon where a disproportionate number of virtual servers have low or zero utilization", "? 75% admit that their company's mandate to deliver high levels of IT service internally get in the way of measuring and improving server efficiency", "\"With U.S. data center energy consumption at an all time high, it's only logical that we reconsider how we are using IT resources. An unnecessary amount of data servers are 'plugged in' 24/7 in an age when power-saving tools are available to businesses. Faced with a fast-moving regulatory environment  including the U.S. climate bill, pending EPA data center initiatives and the upcoming climate talks in Copenhagen  the U.S. IT sector may soon be under greater scrutiny for its power consumption. We'll want to say ahead of the curve and make smart, energy-efficient changes where we can,\" says Kateri Callahan, president of the Alliance to Save Energy.", "The study of global server managers was conducted by Kelton Research in September 2009i."], "Author": ["Phil Wilcock"], "Date": "2009-10-19 00:00:00"}, {"Tags": ["data center", "nightwatchman", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2009/10/16/nightwatchman-forges-its-way-into-the-data-center/", "Area": ["1E News", "1E Products", "Data Center", "Server Power Management"], "Comments": "", "Content": ["1E has industry leading experience in IT cost reduction and power management with 1100 client organizations that have saved over $300m in power costs alone. This experience provides 1E with the insight to help server managers make confident decisions regarding server decommissioning, virtual sprawl control, consolidation and power management, ultimately enabling organizations to save money and reduce their carbon footprint.", "\"The number of unused servers in the world today is staggering. A recent study we commissioned showed that 4.7 million servers in the world are not actively being used. Today, organizations are paying for energy, hardware, maintenance and software licensing, even when servers are not providing any business value. Given the economic and environmental issues we face today, there has never been a greater need for efficiency, especially in servers and data centers\" says Sumir Karayi, CEO and founder of 1E.", "", "", "1E also announced today that Bovis Lend Lease, one of the worlds leading project management and construction companies is working with 1E to deploy its solution across its servers. Dr Paul Toyne, Head of Sustainability, Bovis Lend Lease adds, \"Sustainability is a guiding principle at Bovis Lend Lease. We are always looking for innovations like 1Es NightWatchman Server Edition that could bring our carbon base load to a lower level.\"", "CSC, a global leader in providing technology enabled business solutions and services, is undertaking a case study to measure the benefits of NightWatchman Server Edition. John Glowacki, Corporate Vice President, Chief Technology Officer says, \"CSC is pleased to partner with 1E in a case study designed to measure the benefits of NightWatchman Server Edition and help CSC meet our sustainability objectives.\"", "Deploying NightWatchman Server Edition makes servers more efficient, enables consolidation of redundant infrastructure, and eliminates costs associated with unnecessary hardware and energy usage. Easy to install, there are no hardware changes required, eliminating the risk of server downtime.", "Availability", "Webinar for Existing & Prospective Customers"], "Author": ["Phil Wilcock"], "Date": "2009-10-16 00:00:00"}, {"Tags": ["application compatability", "os deployment", "osd", "podcast", "reduce costs", "windows 7"], "URL": "http://blogs.1e.com/2009/10/07/podcast-episode-3-windows-7/", "Area": ["1E Products"], "Comments": "", "Content": [], "Author": ["Dan Kregor"], "Date": "2009-10-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2009/09/23/wmic-aliaswmi-class-mapping/", "Area": ["ConfigMgr"], "Comments": [{"Comment": "Very good article!! it saves a lot of pointless research!\nThank you!!  ", "Date": "2012-04-06 11:15:00", "Author": "April 6, 2012 at 11:15 am"}, {"Comment": "Pingback: USEFULL QUERYs WQL | Joo Sanches", "Author": "USEFULL QUERYs WQL | Joo Sanches"}], "Content": [], "Author": ["Mike Terrill"], "Date": "2009-09-23 00:00:00"}, {"Tags": ["1e wakeup", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2009/09/23/news-ets-deploys-1es-nightwatchman-pc-edition/", "Area": ["1E News", "Green IT", "PC Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2009-09-23 00:00:00"}, {"Tags": ["green it", "nightwatchman server", "nwse", "server power management"], "URL": "http://blogs.1e.com/2009/09/08/nightwatchman-server-and-the-epas-three-levels-of-greatness/", "Area": ["1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Andy Dominey"], "Date": "2009-09-08 00:00:00"}, {"Tags": ["Carbon Tax", "Green Data Center", "1E News", "Green IT", "cap and trade", "climate change levy", "green it"], "URL": "http://blogs.1e.com/2009/09/07/green-it-good-for-business-good-for-the-environment/", "Area": ["Green IT"], "Comments": "", "Content": ["So what is the main driver for developing a Green IT strategy? Is it for the green image? Is it driven by the green advocate from within? Or is it because the organization genuinely cares about the ever-increasing carbon footprint generated from the use of IT?", "The truth is, something has to be done before we run out of power. By 2011 data centers will consume 3% of electrical energy, three times what it was in 2000. In Ken Brills words It's time that the nation's business and government leaders publicly commit their organizations to make enterprise IT and data center energy efficiency a strategic-level priority and set aggressive and quantitative goals for rapid improvement.", "So now that its been recognized and proven that green is good for your business and for your bottom line, its time to stop talking about it and start doing it."], "Author": ["Michelle Hazelton"], "Date": "2009-09-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2009/09/04/energy-star-for-churches/", "Area": ["The Green Room"], "Comments": "", "Content": ["All this is quite amusing until you read on..", "By improving energy usage at the 300,000+ U.S. places of worship by 10 percent each, a total of 2 million tons of greenhouse gas emissions couldsaved each year. This equates to 5.4 Billion Kwh of electricity..", "Doing this would make nearly $200 million available annually for other worthy projects. Amazing stuff eh?", "This leads me to thinking that we have still only scratched the surface of energy (and therefore carbon) reduction. Churches are simply a great example of how we need to integrate energy saving into every aspect of our lives, not just business and home.", "Amen! (sorry couldnt resist that one)", "Have a great weekend", "Phil Wilcock"], "Author": ["Phil Wilcock"], "Date": "2009-09-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2009/08/26/understanding-us-government-carbon-tax-cap-and-trade/", "Area": ["Data Center", "Green IT"], "Comments": [{"Comment": "Pingback: Some US States act Locally on Carbon Emissions | 1E Blogs", "Author": "Some US States act Locally on Carbon Emissions | 1E Blogs"}], "Content": ["The goal of Cap and Trade is to reduce greenhouse gas emissions including carbon dioxide throughout the economy using cost effective methods. The program is yet to be finalized.", "Large emitting companies will have a limit on the amount greenhouse gases they can emit. Each ton of GHG emitted by the company must be covered by a permit. The number of permits will be reduced over time allowing less pollution until the crucial reduction goal is met.", "A set number of permits are issued per year ensuring that the overall reduction of greenhouse gases is achieved. Efficient companies who successfully emit less than their target can then trade their remaining permits to companies who are not able to reduce their emissions, acting as a reward for the efficient companies.", "The program is initially estimated to generate in the region of $50 billion rising to $300 billion. Revenues are expected to be used to help offset costs to businesses and shareholders of affected industries and to help low to middle income Americans cover the cost of energy price increases which may occur as a result of the switch to renewable energy sources. It will also be used in the development of green technologies and trading.", "Employ the use of a reporting tool for measuring and monitoring energy use and sever efficiency. This will aid decisions such as decommissioning underutilized servers and the reallocation of workloads to use servers more efficiently, all of which will decrease energy consumption including cooling costs, reducing your overall carbon emissions."], "Author": ["Michelle Hazelton"], "Date": "2009-08-26 00:00:00"}, {"Tags": ["Green Data Center", "NightWatchman Server", "Green IT", "Server Power Management"], "URL": "http://blogs.1e.com/2009/08/26/the-uk-tax-implications-of-high-energy-usage-in-data-centres/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["The following is a summary of UK Government legislation for energy and climate change.", "Introduced on 1st April 2001 the CCL is a tax on the use of energy in industry, commerce and the public sector. The levy applies to industrial and commercial energy supplies in the following sectors: industry, commerce, agriculture; and public and service sectors.", "Electricity", "0.00456 per kWh", "Gas supplied by a gas utility", "0.00159 per kWh", "Any petroleum gas, or other gaseous hydrocarbon, supplied in a liquid state", "0.01018 per kilogram", "Any other taxable commodity", "0.01242 per kilogram", "The DECC was created to bring together energy policy with climate change mitigation policy. Climate change and energy policies are inextricably linked  two thirds of our emissions come from the energy we use. Decisions in one field cannot be made without considering the impacts in the other.", "Starting in 2010 CRC is for all businesses not covered by a climate change agreement (see below) and the EU Emissions Trading System (See below). The policy has been developed with DECC, Energy Act 2008 and the Climate Change Act 2008. An estimated 20,000 organizations will be affected by the scheme and failure to comply will result in penalties.", "CRC will cover organizations with an annual energy bill of > 500k", "All energy other than transport fuels is included in the figure", "Carbon allowances will be allocated by auction", "Annual allowances will reduce over time", "Participants may be able to buy EU ETS credits to comply with emissions cap (see below)", "League tables published outlining best and worst performers in terms of carbon emission and reductions", "Self certification of monitoring, reporting and verification of emission", "Backed by independent risk based audit regime", "The rationale behind emission trading is to ensure that the emission reductions take place where the cost of the reduction is lowest thus lowering the overall costs of combating climate change.", "Emissions trading gives companies the flexibility to meet emission reduction targets according to their own strategy; for example by reducing emissions on site or by buying allowances from other companies who have excess allowances. The environmental outcome is not affected because the total amount of allowances allocated is fixed.", "Energy intensive sectors are a wide range of industrial sectors, from major energy intensive processes such as steel, chemicals and cement, to agricultural sectors, such as intensive pig and poultry rearing.", "Climate Change Agreements (CCAs) allow eligible energy intensive business users to receive up to an 80% discount from the CCL in return for meeting energy efficiency or carbon saving targets set by the Government.", "CCAs have a two-tier structure:", "A sector-level agreement between Defra and the sector or trade association (known as an umbrella agreement)", "Individual agreements between Defra and the operator of the facility (known as underlying agreements).", "Targets are set on a company by company basis and must be met in order to receive the discount.", "Employ the use of a reporting tool for measuring and monitoring energy use and sever efficiency. This will aid decisions such as decommissioning underutilized servers and the reallocation of workloads to use servers more efficiently, all of which will reduce overall energy consumption including cooling costs.", "", ""], "Author": ["Michelle Hazelton"], "Date": "2009-08-26 00:00:00"}, {"Tags": ["troubleshooting", "wakeup"], "URL": "http://blogs.1e.com/2009/08/25/troubleshooting-failed-wakeups/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: Tweets that mention Troubleshooting Failed Wakeups | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Troubleshooting Failed Wakeups | 1E Blogs -- Topsy.com"}, {"Comment": "Car Interior Hi to All!! UK Car Tuning Styling Carbon Dash trim, Aluminium dash trim.", "Date": "2011-05-06 12:14:00", "Author": "skosstas"}], "Content": [], "Author": ["Ed Aldrich"], "Date": "2009-08-25 00:00:00"}, {"Tags": ["nightwatchman", "power management"], "URL": "http://blogs.1e.com/2009/08/18/identifying-which-ip-subnets-to-import-for-nightwatchman-management-console-location-groups-using-the-import-wizard/", "Area": ["1E Products"], "Comments": "", "Content": ["Once youre ready to create/import the necessary location groups and assign the NightWatchman clients to them, you can use the query below to quickly learn the IP Subnet(s) connected to by the clients.", "The query results can then be used as the basis for identifying all the subnets that need to be defined in the .csv import-file.", ""], "Author": ["Troy Martin"], "Date": "2009-08-18 00:00:00"}, {"Tags": ["wakeup"], "URL": "http://blogs.1e.com/2009/08/18/1ewakeup-console-subnet-and-agent-registration-process/", "Area": ["1E Products"], "Comments": "", "Content": [], "Author": ["Ed Aldrich"], "Date": "2009-08-18 00:00:00"}, {"Tags": ["data center", "nightwatchman", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2009/08/18/webcast-proven-pc-and-server-power-management/", "Area": ["1E Products", "Data Center", "Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2009-08-18 00:00:00"}, {"Tags": ["data center", "nightwatchman", "server power management"], "URL": "http://blogs.1e.com/2009/08/12/introducing-myself-and-nightwatchman-server/", "Area": ["1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Andy Hawkins"], "Date": "2009-08-12 00:00:00"}, {"Tags": ["1e wakeup", "green it", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2009/08/12/news-1e-helping-dell-save-5-8-million-per-year/", "Area": ["1E News"], "Comments": "", "Content": ["Here's a great example of a Green IT strategy in action. Dell saves $5.8m annually, and as you can see, most of these measures are easy to implement."], "Author": ["Phil Wilcock"], "Date": "2009-08-12 00:00:00"}, {"Tags": ["nightwatchman", "power management"], "URL": "http://blogs.1e.com/2009/08/11/nightwatchman-management-centre-query-to-export-machines-by-group/", "Area": ["1E Products"], "Comments": [{"Comment": "Thanks Ed.  You just saved me a ton of time during our migration to SCCM 2012 and a newer version of Nightwatchman on a new server.", "Date": "2013-10-11 02:38:00", "Author": "October 11, 2013 at 2:38 pm"}, {"Comment": "Really glad you found this useful! Id be interested in knowing just how you plan on using this data on the CM12 and new NWMMgmtCtr side use the source data as grist for an import process? Im sure others may benefit as well.", "Date": "2013-10-14 03:00:00", "Author": "October 14, 2013 at 3:00 pm"}], "Content": ["Who knows? Maybe this will end up as a native report in the Next Great Version???"], "Author": ["Ed Aldrich"], "Date": "2009-08-11 00:00:00"}, {"Tags": ["green it", "pc power management"], "URL": "http://blogs.1e.com/2009/08/11/news-1e-reports-48-growth-in-first-half-of-2009/", "Area": ["1E News"], "Comments": "", "Content": ["Now I'm not usually a big fan of stuffy press releases as it goes  I find them a bit dry and formal. The content of this one however, is worth a look.", "In times of economic stress, it's not only great to see a company achieving pretty amazing growth, it's also an indicator that companies are taking their responsibilities around power management and 'Green IT' seriously. With 15 million users over 1,100 organisations, that adds up to huge carbon and cost savings globally.", "Read the full press release:", ""], "Author": ["Phil Wilcock"], "Date": "2009-08-11 00:00:00"}, {"Tags": ["application compatability", "med-v", "os deployment"], "URL": "http://blogs.1e.com/2009/08/11/the-difference-between-med-v-and-xp-mode/", "Area": ["OS Deployment", "Windows 7"], "Comments": "", "Content": ["Application compatibility is one of the most time consuming aspects to a Windows deployment project.You basically have to test every install and every application executionon your new OS before you can roll it out. For many companies, that can be as many as a couple of thousand applications. Often much of the cost is hidden because it is the businessuser community who have done much of the acceptance testing. 1E will be doing more on this topic coming soon", "The burning question is what do you do after you have found an application which is not compatible with your new environment? The best answer is to decommission it, butthe life of an IT administrator is never that simple.", "I have just found this excellent article on the Microsoft Windows Team Blog site. It explains the differences between MED-V and XP Mode on Win 7, which are two possible options for managing these incompatible applications. Basically, you can run the applications within the context of Windows XP but on a Windows 7 machine andthe user experience is virtually seamless.", "Definately worth a look.", ""], "Author": ["Sophie Chang"], "Date": "2009-08-11 00:00:00"}, {"Tags": ["1e wakeup"], "URL": "http://blogs.1e.com/2009/08/11/product-overview-1e-wakeup/", "Area": ["1E Products"], "Comments": "", "Content": ["[youtube:http://www.youtube.com/v/OiHox8f59Ys]"], "Author": ["Phil Wilcock"], "Date": "2009-08-11 00:00:00"}, {"Tags": ["install", "nightwatchman", "orca", "transform"], "URL": "http://blogs.1e.com/2009/08/05/transforming-nightwatchman/", "Area": ["1E Products"], "Comments": "", "Content": [], "Author": ["Steve Newby"], "Date": "2009-08-05 00:00:00"}, {"Tags": ["1e", "configmgr", "mof", "wake-on-lan", "wakeup"], "URL": "http://blogs.1e.com/2009/07/29/mof-object-queries-for-wired-and-wireless-network-adapters/", "Area": ["ConfigMgr"], "Comments": "", "Content": ["Planning to deploy script which will enable Wake-On-Lan for all target computers. Before doing so, I wanted to get a list models for each. Creating a query for something like this is applicable to just about any ConfigMgr environment and the admins would find valuable.", "Well, here they areI hope you find them useful!!", "PS  If you have additional models that are NOT listed in the query, just shoot me an email and I will keep the MOF's updated."], "Author": ["Troy Martin"], "Date": "2009-07-29 00:00:00"}, {"Tags": ["configmgr", "native mode"], "URL": "http://blogs.1e.com/2009/07/24/mpcontrol-log-and-error-code-12030/", "Area": ["ConfigMgr"], "Comments": "", "Content": [], "Author": ["Troy Martin"], "Date": "2009-07-24 00:00:00"}, {"Tags": ["1e", "carbon reduction", "nightwatchman", "pc power management", "podcast", "reduce costs"], "URL": "http://blogs.1e.com/2009/07/22/podcast-episode-2-of-the-1e-podcast-now-available/", "Area": ["Green IT", "PC Power Management"], "Comments": "", "Content": ["In this episode, I chat with Mike Terrill (SCCM Practice Lead), Neil Kimberley (Solutions Engineer) and Michelle Hazelton (Product Manager) about how an organizations carbon footprint is calculated and how to minimise it and reduce costs. The discussion is centered around Ashby's Incorporated (our ficticious company) and their need to reduce their carbon footprint and actively monitor PC state."], "Author": ["Dan Kregor"], "Date": "2009-07-22 00:00:00"}, {"Tags": ["configmgr", "self service", "shopping"], "URL": "http://blogs.1e.com/2009/07/20/shopping-user-and-computer-categories-explained/", "Area": ["1E Products"], "Comments": "", "Content": ["I have been asked many times about the difference between User and Computer categories in Shopping and for what scenarios they are most useful. Well, here goes", "User Categories  These allow you to do two things; 1) Group you applications into logical groups and 2) to restrict the user's ability to see these applications and therefore shop for it. So, an organization can bundle their applications into user categories, as follows. All applications would be grouped within each category which are shown on the Shopping web browser down the left hand side. This makes them easier to find. You would want all users to be able to see the free utilities, so no restrictions would need to be added here. However if you have Windows Security groups for development, sales and marketing users, then you can restrict the User Categories as well so that only people from each group can see the whole category.", "Computer Categories  These allow you to restrict access to Shopping Applications based upon the machine from which the request is being made. This is done on an application level. For example, Joe works in marketing. His user permissions allow him to shop for 8 applications which have been added to the Marketing Software User Category, however his PC is located in UK. Unfortunately UK PCs are not licensed for 3 of the applications in the Marketing Software User Category. Joe will therefore only be able to shop for (and see) 5 out of the 8 applications. i.e. He will only be able to shop for applications for which both his user and his machine permissions allow him.", "There will be changes to Computer Categories coming soon, which increase the capabilities of branch administrators to manage applications at a branch/computer level. More info to follow as we approach release (Q4 2009)."], "Author": ["Sophie Chang"], "Date": "2009-07-20 00:00:00"}, {"Tags": ["opsmgr", "podcast", "system center"], "URL": "http://blogs.1e.com/2009/07/14/podcast-1e-system-center-episode-1-released/", "Area": ["SCCM"], "Comments": "", "Content": [], "Author": ["Dan Kregor"], "Date": "2009-07-14 00:00:00"}, {"Tags": ["1e", "nightwatchman", "patch management", "pc power management", "wakeup"], "URL": "http://blogs.1e.com/2009/07/14/dont-like-tuesdays/", "Area": ["1E Products", "PC Power Management"], "Comments": "", "Content": ["Try creeping up on your nearest IT Manager and yelling 'It's Patch Tuesday'! If he doesn't faint, shake uncontrollably and/or cry then he's probably a 1E customer..", "However, if you are a 1E customer, Tuesdays can be just another day..", "Overall this makes for a more controlled (and controllable) approach to the headache of multiple patches and reboots.", ""], "Author": ["Phil Wilcock"], "Date": "2009-07-14 00:00:00"}, {"Tags": ["green it", "nightwatchman", "power management"], "URL": "http://blogs.1e.com/2009/07/14/team-green-britain-supporter-switches-off-pcs-at-night/", "Area": ["1E News", "Green IT", "PC Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2009-07-14 00:00:00"}, {"Tags": ["1e", "green it", "nightwatchman", "power management"], "URL": "http://blogs.1e.com/2009/07/13/product-overview-nightwatchman/", "Area": ["Green IT", "PC Power Management"], "Comments": "", "Content": ["Enjoy", ""], "Author": ["Phil Wilcock"], "Date": "2009-07-13 00:00:00"}, {"Tags": ["bandwidth", "configmgr", "nomad", "os deployment", "wan optimization"], "URL": "http://blogs.1e.com/2009/07/10/activating-a-nomad-package/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: Tweets that mention Activating a Nomad package | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Activating a Nomad package | 1E Blogs -- Topsy.com"}], "Content": ["If you manually copy some files into the Nomad cache from a CD or other media, then you will need to activate this package to ensure that Nomad is able to respond to election requests. In order to do this without restarting the service, then you will need to run the activate command for each package.", "NomadBranch.exe -activate=PKG0001E", "This is only supported on Nomad 3.x and requires a valid Nomad index file (LSZ or LST) to also be copied across. Nomad will check the contents of the package against the index file and then populate its own registry keys with useful package information. As the index file is checked, the package is considered valid so Nomadcan now participate in election requests for this package.", "If no Nomad LST or LSZ file exists for this package, then the package will not be activated. The next time the service restarts, the package will be deleted as its contents cannot be trusted.", "This is also commonly used during OS deployment. As part of the ConfigMgr task sequence, the Nomad cache can be saved and then recopied to the new OS. Providing Nomad is re-installed, then the packages can be made active again by running the activate command line as part ofthe task sequence."], "Author": ["Sophie Chang"], "Date": "2009-07-10 00:00:00"}, {"Tags": ["windows 7"], "URL": "http://blogs.1e.com/2009/07/10/windows-7-problem-step-recorder/", "Area": ["Windows 7"], "Comments": "", "Content": [""], "Author": ["Peter Murray"], "Date": "2009-07-10 00:00:00"}, {"Tags": ["application compatability", "windows 7"], "URL": "http://blogs.1e.com/2009/07/10/windows-7-application-compatibility-part-2-2/", "Area": ["Windows 7"], "Comments": "", "Content": ["Many applications check the version of the OS and behave differently or fail to run when an unexpected version number is detected. This issue can be resolved by setting appropriate compatibility modes or applying version lie shims.", "User folders, My Documents folders and folders with localization have changed moving to Windows Vista and with File Libraries in Windows 7. Applications with hard-coded paths may fail. This can be mitigated using directory junctions or by replacing hard coded paths w/ appropriate API calls to get folder locations.", "WRP is designed to protect the system in a read-only state to increase system stability, predictability and reliability. This will affect specific files, folders, and registry keys. Updates to protected resources are restricted to the OS trusted installers, (e.g. Windows Servicing). This helps to protect components and apps that ship with the OS from any impact of other apps and administrators. This can be an issue for custom installations not detected as setup by Windows 7 when they try to replace WRP files/registry and check for specific versions/values.", "Windows 7 and Windows Vista, all interactive users including members of the administrators group run as standard user. UAC is the mechanism through which users can elevate applications to full administrator privileges. Because of UAC, applications that require administrator rights or check for administrator privileges behave differently in Windows 7 and Windows Vista even when run by a user as administrator."], "Author": ["Peter Murray"], "Date": "2009-07-10 00:00:00"}, {"Tags": ["1e", "bandwidth", "configmgr", "nomad", "wan optimization"], "URL": "http://blogs.1e.com/2009/07/09/zombie-nomad-cache-folders/", "Area": ["1E Products"], "Comments": "", "Content": ["With Nomad 3.x, we introduced the concept of a 'zombie' cache. If you see these, do not be alarmed. These are almost consideredlive, but not quite. A Nomad agent will still respond to an election request however as it has an unverified cache, it will only win the election if no other agents have 100% of the package.", "A zombie cache is defined when the Nomad service starts up. If it sees an index file (either an lsz or an lst file) and has a cache folder, but it does not have the Nomad registry information for that cache, then it will verify the cache contents against the index file. If it matches, then the cache is defined as a zombie cache. If it does not match, then the cache is not valid and is deleted.", "This can occur if cache files are file copied between machines without using Nomad functionality, for example using a OS deployment restore Nomad cache step. It can also occur if you uninstall Nomad and then re-install. The registry entries are deleted during the uninstall, however the cache folders remain. Once Nomad is re-installed, then zombie cache folders will be created.", "A zombie cache is not entirely trusted. The contents has been validated against the index file so it will therefore respond to elections, however it is not as trusted as a Nomad agent which actively remembered downloading the cache. In order to resurrect this cache, then run the following command line.This is often incorporated as part of an OSD task sequence.", "NomadBranch.exe -activate=PKG0001E", ""], "Author": ["Sophie Chang"], "Date": "2009-07-09 00:00:00"}, {"Tags": ["configmgr", "mdt", "os deployment", "osd"], "URL": "http://blogs.1e.com/2009/07/08/problem-encountered-creating-mdt-2008-boot-image-when-sms-provider-is-not-installed-on-site-server/", "Area": ["OS Deployment", "SCCM"], "Comments": "", "Content": [], "Author": ["Troy Martin"], "Date": "2009-07-08 00:00:00"}, {"Tags": ["configmgr", "mdt", "os deployment", "osd"], "URL": "http://blogs.1e.com/2009/07/08/mdt-2008-error-occurred-integrating-with-configmgr/", "Area": ["OS Deployment", "SCCM"], "Comments": "", "Content": [], "Author": ["Troy Martin"], "Date": "2009-07-08 00:00:00"}, {"Tags": ["management pack", "opsmgr", "powershell"], "URL": "http://blogs.1e.com/2009/07/07/uninstalling-a-management-pack-using-powershell/", "Area": ["SCCM"], "Comments": "", "Content": ["I recently had the need to uninstall a ManagementPack from OpsMgr without using the Operators Console (kept getting a exception error every time I opened the console after importing the eXcSoftware Management Pack). Heres how I did it:", "Weve now set the variable $MP to contain the values for the MP. Now type in:", "Powershell (and the Command Shell) adds a whole new set of functionality to OpsMgr and allows for data mining and scripting that is otherwise unavailable. You can install the OpsMgr command shell on your desktop by running setup.exe from the install media."], "Author": ["Dan Kregor"], "Date": "2009-07-07 00:00:00"}, {"Tags": ["opsmgr"], "URL": "http://blogs.1e.com/2009/07/07/opsmgr-cant-change-the-alert-resolution-state-2/", "Area": ["SCCM"], "Comments": "", "Content": [], "Author": ["Dan Kregor"], "Date": "2009-07-07 00:00:00"}, {"Tags": ["configmgr", "https", "ibcm", "native mode"], "URL": "http://blogs.1e.com/2009/07/06/what-happens-when-failing-to-run-wsusutil-configuressl-and-how-to-troubleshoot-the-symptoms/", "Area": ["SCCM"], "Comments": "", "Content": ["To quickly answer the question, so that you do not have to read the entire blog:", "however, the rest of the blog entry is pretty interesting, so you might want to read on!!", "When configuring a ConfigMgr site to use an Active SUP, it does not arbitrarily select which hostname and ports it's going to use to connect to the site system server running WSUS. Under Site Settings -> Component Configuration -> Software Update Point Component , you must specify the correct port numbers for HTTP & HTTPS connections. You are required to use the port number(s) configured for the website WSUS was installed under. Most admins choose either the Default Web Site (e.g. generally ports TCP/80 & 443) or have the WSUS installer create a custom website called WSUS Administration (e.g. generally TCP 8530 & 8531), when installing WSUS. Nothing new here. Life is goodRight??", "After configuring the IIS website with the desired ports, and say you are simply using HTTP to connect to the Active SUP running WSUS (e.g. generally using ports TCP/80 or TCP/8530), you really shouldn't have many problems doing so (if any). To confirm this, check the WCM.log and WSUSCtrL.log, as they will most likely be clear of any connection-related errors. You will most often have this kind of experience when sites are running in Mixed Mode.", "I just wanted to give a little background before getting to why I'm writing this blog in the first placeI hope you didn't mind that long intro'?", "Before I get started, let me provide you some background on how I implemented IBCM within a Native Mode environment:", "Addition configuration info':", "So while implementing IBCM, I ran into a problem configuring the Active remote Internet SUP in the DMZ and here's how I went about troubleshooting it.", "So I'm reading the WSUSCtrl.log, feeling like I've configured everything properlySo why am I having this problem? Surely this must be a bug, right?? (famous last words!!). C'mongive me some loveyou've done it too!!", "Why is it trying to connect using \"HTTP\" over TCP/8530? This is definitely a problem.", "The WSUSCtrl.log gave me some things to go on, but not enough to figure out what the problem isor maybe I'm just slow?? Hhhmm??", "So I decided to check out the IIS Logfile", "So I started reviewing my steps, realizing I had not run the WSUSUTIL.EXE command on the WSUS server (e.g. wsusutil configureSSL <InTERnet FQDN of Active remote Internet SUP??>). Hhmm??", "Note: Since the Active remote Internet SUP in the DMZ will be used to only accept connections from Internet clients, then in the wsusutil command above, I used the InTERnet FQDN and not the InTRAnet FQDN.", "So I did that and the problem was fixed!! That's all it was", "Software Update Management (SUM) has proven to be kind of difficult for people to troubleshoot, because there are a number of \"moving parts\" involved. When you introduce Native Mode and Internet-Based Client Management, it can get even more complicated to troubleshoot. Native Mode and Internet-Based Client Management are not for the faint of heart. You really have to plan it out wisely and test, test, testand then test a little more!!", "I havemore topics like this that I will be blogging about.", "I hope you found this one helpful!!", "WSUSCtrl.log (on Active remote Internet SUP in DMZ)", "IIS Logfile (on Active remote Internet SUP in DMZ)"], "Author": ["Troy Martin"], "Date": "2009-07-06 00:00:00"}, {"Tags": ["data center", "green it", "nightwatchman", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2009/07/03/opinion-data-centers-are-only-part-of-the-problem/", "Area": ["Server Power Management"], "Comments": "", "Content": [""], "Author": ["Phil Wilcock"], "Date": "2009-07-03 00:00:00"}, {"Tags": ["application compatability", "windows 7"], "URL": "http://blogs.1e.com/2009/07/03/windows-7-application-compatability-part-1/", "Area": ["Windows 7"], "Comments": "", "Content": [], "Author": ["Peter Murray"], "Date": "2009-07-03 00:00:00"}, {"Tags": ["1e", "pxe lite"], "URL": "http://blogs.1e.com/2009/07/03/pxe-lite-1-5-components/", "Area": ["1E Products"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2009-07-03 00:00:00"}, {"Tags": ["1e", "os deployment", "osd", "pxe lite"], "URL": "http://blogs.1e.com/2009/07/02/pxe-lite-one-pxe-lite-server-per-subnet/", "Area": ["1E Products"], "Comments": "", "Content": ["DHCP uses subnet-local broadcasts; you have to use a DHCP relay or gateway (an IP helper) if your DHCP server is not in the local subnet.", "To avoid extra configuration hassles with your DHCP relay or gateway, we recommend that you install PXE Lite on a per-subnet basis."], "Author": ["Rod Trent"], "Date": "2009-07-02 00:00:00"}, {"Tags": ["1e", "nomad", "os deployment", "osd", "pxe lite"], "URL": "http://blogs.1e.com/2009/07/02/what-is-pxe-what-is-pxe-lite/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: Tweets that mention What is PXE? What is PXE Lite? | 1E Blogs -- Topsy.com", "Author": "Tweets that mention What is PXE? What is PXE Lite? | 1E Blogs -- Topsy.com"}], "Content": ["PXE stands for Preboot eXecution Environment, and its used for network booting and network installation of operating systems. Youre probably familiar with it in the form of the twiddly cursor that appears after BIOS POST:", "This ones from a VM running on Microsoft Virtual Server 2005 SP1  its easier to take screenshots that way.", "PXE uses DHCP (Dynamic Host Configuration Protocol) and TFTP (Trivial File Transfer Protocol) to locate and load a network boot program (NBP). For example, Windows uses STARTROM.COM (or STARTROM.N12).", "PXE also defines an application programming interface (API) that allows the network boot program to do various simple network-related things, like send and receive UDP packets; and TFTP file transfers.", "This API is supported by the vast majority of recent network cards, meaning that the network boot program doesnt need drivers.", "The PXE BIOS uses DHCP to discover the location of a network boot program. Once its got this location, it uses TFTP to load this program into memory and then runs it. From that point on, everythings up to the network boot program.", "If were talking about Windows, that network boot program is usually STARTROM.COM or WDSNBP.COM, which gets down to the business of loading Windows PE into memory.", "PXE Lite is 1Es implementation of a PXE-based boot server, aimed at branch offices where it would be difficult, expensive (or overkill) to install a Windows Deployment Services (WDS) server.", "It makes use of Nomad for bandwidth-efficient package transfer. As you can imagine, this is important when were talking about multi-gigabyte OS images.", "It integrates with ConfigMgr, providing almost a drop-in replacement for the WDS-based PXE service point.", ""], "Author": ["Rod Trent"], "Date": "2009-07-02 00:00:00"}, {"Tags": ["carbon reduction", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2009/06/30/energy-management-in-practice/", "Area": ["Green IT"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2009-06-30 00:00:00"}, {"Tags": ["1e", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2009/06/21/why-wont-my-pc-go-to-sleep-2/", "Area": ["PC Power Management"], "Comments": "", "Content": ["This is a timely piece, sent to me by Mark Blackburn, a fellow co-founder here at 1E and general technical funkmeister.Timely because Ive been having this exact problem with my VAIO laptop on and off (no NightWatchman pun intended) for a while now.. cheers Mark!", "", "Windows power management settings are supposed to make your PC go to sleep after its been left unused for a period of time, but you will often find that this doesnt actually happen when it should.", "There are three things that can keep a PC awake", "Keyboard and mouse movement is the only way that the PC has of knowing if a user is present, so mouse drift  where the mouse cursor slowly moves across the screen in one direction or another without any actual mouse movement occurring, usually because of faulty hardware, will prevent a PC from sleeping, since it thinks its being constantly used.", "The windows idle timers get reset whenever the PC thinks its busy (80% idle for the default Vista power scheme), so if something makes the overall CPU utilization of your PC go above 20% then the idle timer will reset, and if this happens regularly (say every 30 minutes) then the PC will never sleep.", "Any thread in a process can raise this flag to purposefully prevent the PC from sleeping. There are many reasons why applications raise this flag, some are legitimate, for example Media Player will raise it if youre watching a video (you dont want the PC to go to sleep whilst you watch a movie after all), and some are not.", "A lot of the time applications wont raise the flag themselves, but will cause the underlying OS subsystems to raise it instead. For example if you open a document from a network share the Network Redirector driver (rdbss.sys) will raise this flag to prevent the PC from going to sleep whilst there is an open file across the network.", "So, if your PC wont sleep heres what to look for;", ""], "Author": ["Phil Wilcock"], "Date": "2009-06-21 00:00:00"}, {"Tags": ["1e", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2009/06/21/why-wont-my-pc-go-to-sleep/", "Area": ["PC Power Management"], "Comments": "", "Content": ["This is a timely piece, sent to me by Mark Blackburn, a fellow co-founder here at 1E and general technical funkmeister. Timely because Ive been having this exact problem with my VAIO laptop on and off (no NightWatchman pun intended) for a while now.. cheers Mark!", "", "Windows power management settings are supposed to make your PC go to sleep after its been left unused for a period of time, but you will often find that this doesnt actually happen when it should.", "There are three things that can keep a PC awake", "Keyboard and mouse movement is the only way that the PC has of knowing if a user is present, so mouse drift  where the mouse cursor slowly moves across the screen in one direction or another without any actual mouse movement occurring,  usually because of faulty hardware, will prevent a PC from sleeping, since it thinks its being constantly used.", "The windows idle timers get reset whenever the PC thinks its busy (80% idle for the default Vista power scheme), so if something makes the overall CPU utilization of your PC go above 20% then the idle timer will reset, and if this happens regularly (say every 30 minutes) then the PC will never sleep.", "Any thread in a process can raise this flag to purposefully prevent the PC from sleeping. There are many reasons why applications raise this flag, some are legitimate, for example Media Player will raise it if youre watching a video (you dont want the PC to go to sleep whilst you watch a movie after all), and some are not.", "A lot of the time applications wont raise the flag themselves, but will cause the underlying OS subsystems to raise it instead. For example if you open a document from a network share the Network Redirector driver (rdbss.sys) will raise this flag to prevent the PC from going to sleep whilst there is an open file across the network.", "So, if your PC wont sleep heres what to look for;", ""], "Author": ["Phil Wilcock"], "Date": "2009-06-21 00:00:00"}, {"Tags": ["opsmgr"], "URL": "http://blogs.1e.com/2009/06/17/diagnostic-and-recovery-tasks-in-operations-manager-an-overview/", "Area": ["SCCM"], "Comments": "", "Content": ["The strength of any great monitoring solution is not just in its ability to report issues and the current state of servers and applications (there are a plethora of good monitoring tools that can do this), but in its ability to resolve problems automatically when they arise. Through the creation of automated tasks, administrators can simplify day to day management of servers and applications to allow support teams to concentrate on only the most critical of issues. This is what distinguishes a GREAT monitoring solution from a good one.", "Here at 1E, we love the System Center suite of products. You only need whisper the words Config Manager or VMM in the ear of a 1E consultant to get their pupils dilated and their heart racing. Be careful with Ops Manager though, as this can send one particular 1E consultant into a lather.", "Why? I hear you ask Simply put, Microsoft System Center Operations Manager 2007 (or OpsMgr for short) is the premiere enterprise class monitoring solution, and it just got better with the release of OpsMgr R2. But does OpsMgr meet my criteria for a great monitoring solution? You bet!", "The true power behind OpsMgr lies within the workflow engine that underpins everything. Each Discovery, Rule and Monitor is a workflow comprised of individual modules that are executed sequentially in order to identify the current status, overall health or relationships between objects. It is this workflow engine that empowers administrators to configure automated tasks. In OpsMgr, these are Diagnostic and Recovery Tasks and they are available for all Monitor workflows.", "To better understand the difference between a Rule and a Monitor consider the following:", "A rule collects data from various sources (PerfMon, Event Logs, SNMP etc) and stores that data in the Operations Database and the DataWarehouse database. This data is then made available for reporting purposes. Rules (generally speaking) do not generate alerts.", "Similarly, a Monitor also collects data but for a different purpose. A monitor uses its captured data to determine the health state of an object. The monitor will change the state of an object (Healthy, Warning or Critical) in response to the information being gathered and the configuration of the monitor (i.e. CPU utilisation threshold), and may in turn generate an alert or run diagnostic and recovery tasks.", "For more information, please see this TechNet article (http://technet.microsoft.com/en-us/library/bb977440.aspx)", "With this in mind, lets take a look at an example of what you can do with Diagnostic and Recovery Tasks.", "", "", "Within the confines of our example;", "This has been a brief, high level overview of the Diagnostic and Recovery tasks capabilities of OpsMgr. In future blog posts I will cover this topic in greater detail, first examining the underlying xml code and configuration of Recovery and Diagnostic tasks, and then how to create Diagnostic and Recovery tasks to automate system management."], "Author": ["Dan Kregor"], "Date": "2009-06-17 00:00:00"}, {"Tags": ["group policy", "windows xp"], "URL": "http://blogs.1e.com/2009/06/16/using-a-gpo-to-disable-the-windows-xp-tour-balloon/", "Area": ["OS Deployment"], "Comments": [{"Comment": "hi,", "Date": "2011-01-19 07:56:00", "Author": "January 19, 2011 at 7:56 am"}], "Content": [], "Author": ["Troy Martin"], "Date": "2009-06-16 00:00:00"}, {"Tags": ["1e", "self service", "shopping"], "URL": "http://blogs.1e.com/2009/06/05/installing-shopping-central-when-sms-provider-is-not-hosted-on-configmgr-site-server/", "Area": ["1E Products"], "Comments": "", "Content": ["The following describes the required permissions the Shopping Service Account needs when installing Shopping Central in a distributed server/component environment:", "", "Servers", "========", "SHOPPING (W2K3)- Shopping Central Server", "NMCM01 (W2K8)  ConfigMgr Central Site Server", "NMSQL01 (W2K8)  SQL Server (2K8) hosting ConfigMgr site database AND ConfigMgr SMS Provider", "", "", "", "", "", "", ""], "Author": ["Troy Martin"], "Date": "2009-06-05 00:00:00"}, {"Tags": ["1e", "nightwatchman", "power management"], "URL": "http://blogs.1e.com/2009/05/27/machines-awaiting-reboot-due-to-pendingfilerenameoperations/", "Area": ["SCCM"], "Comments": [{"Comment": "Why oh why does it need to be this complex?  Buy a Mac.", "Date": "2010-11-30 02:04:00", "Author": "November 30, 2010 at 2:04 am"}, {"Comment": "Pingback: Tweets that mention Machines awaiting reboot due to PendingFileRenameOperations | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Machines awaiting reboot due to PendingFileRenameOperations | 1E Blogs -- Topsy.com"}, {"Comment": "I've replicated this in my environment, however, when launched and \"No\" is selected, the prompt disappears then the script times out. If I remove the time out, the process stays alive but never re-prompts. Running on a Win 7 x64 workstation, without NightWatchman, and forcing bRebootNeeded to TRUE. Any ideas?", "Date": "2012-11-07 10:31:00", "Author": "November 7, 2012 at 10:31 pm"}, {"Comment": "Figured it out. I was only passing the first parameter and relying on the default for the number of \"nags\". But if you put in one parameter it assumes there's a second  so if you don't include one  no dice.", "Date": "2012-11-07 10:37:00", "Author": "November 7, 2012 at 10:37 pm"}, {"Comment": "Glad you've figured it out Don. So it's all working okay?", "Date": "2012-11-08 03:48:00", "Author": "November 8, 2012 at 3:48 pm"}], "Content": ["As we know, many desktop computers do not get rebooted for long periods of time and many laptop users almost never shutdown their computer and just merely close the lid. Because of this, the pending reboot/file rename is persisted and usually goes undetected. Case-in-point: After implementing this at a customer site, more than half of their computers needed to be rebooted due to a pending file renameand they never knew it.", "The script then determines what tool/method to use to reboot the computer. If NightWatchman is installed, the script will run the following command-line:", "'Set objArgs = Wscript.Arguments", "'intTimeOut = objArgs(0) 'Countdown in seconds", "intTimeOutSec = intTimeOut * 1000 'Convert from milliseconds to seconds", "strComputer = \".\"", "End Sub", "Rebooting computers is one of those administrative tasks thats at the top of the list. As we all have been working with Windows for quite some time now, we know that rebooting is just a good thing to do. Rebooting computers due to pending file rename operations, is a scenario that usually goes undetected in many environments.", "Automated rebooting of computers is always a hot topic and usually requires buy-in from management. While this blog may not show you how to navigate the approval process in your company, it does provide you the tools and instructions to implement this most valuable solution. <wink>Once you get approval</wink>", "I hope you enjoyed"], "Author": ["Troy Martin"], "Date": "2009-05-27 00:00:00"}, {"Tags": ["configmgr", "os deployment", "osd", "task sequence"], "URL": "http://blogs.1e.com/2009/05/26/configmgr-package-programs-cannot-use-task-sequence-variables/", "Area": ["OS Deployment", "SCCM"], "Comments": [{"Comment": "We are having problems running batch files with VBS scripts, and wise scripts from a task sequence. The software installs great through SCCM, but not a task sequence. Any thoughts?", "Date": "2012-07-12 11:04:00", "Author": "Eric Morgenstern"}, {"Comment": "Can you give some examples of what you are trying to do and how you are attempting to do it? The more information you can give, the better we can advise in regards to your issue.", "Date": "2012-07-27 09:17:00", "Author": "July 27, 2012 at 9:17 am"}], "Content": ["When running a normal ConfigMgr package/program as a step in a task sequence, you cannot use variables on the command line. This happens because the execution of the program is actually managed by the execmgr, the clients normal execution manager, which does not know of any of the OSD environment. There are two ways to get around this limitation, use a script to reference the variables or change the step to install the software to a normal \"Run Command Line\" step, which can use variables and reference the original package.", "So basically, atask sequence cannotcall a normal ConfigMgr program and parse it Task Sequence variables,the OSD variables are not understood by the execmgror they are not available:", "In order to get around it you have to either use a script that runs as admin, referencing theTS object,or usethe option to use a\"Run Command Line\" task thatreferences the packagee source in the Task Sequence as the example below. In this example we feed two variables from the TS environment to the actual installer, and as you can see, its just a standard \"Run Command Line\" step:", "Hope this saves some time for you guys!"], "Author": ["Rod Trent"], "Date": "2009-05-26 00:00:00"}, {"Tags": ["configmgr", "os deployment", "osd", "task sequence", "wmi"], "URL": "http://blogs.1e.com/2009/05/26/running-a-tasks-that-stops-wmi-as-a-part-of-a-configmgr-task-sequence/", "Area": ["OS Deployment", "SCCM"], "Comments": "", "Content": ["If you want to run a certain application or configuration that stops either WMI or the Agent Host you have to run it as a \"Run Command Line\" step. All \"Install Software\" steps is executed by the execmgr by the Agent Host, and when the application stops either WMI or the Agent Host service it will release the newly spawned process causing the TS to return it as a failure. The workaround is to simply use the \"Run Command Line\" step when using command lines/applications that reset any of these services. This works since the \"Run Command Line\" steps are executed by the TS engine which is not dependant on either WMI or the Agent Host service.", "The following picture shows a task to install a new ConfigMgr site, a task that resets both WMI and other underlying services, this will work since it is a \"Run Command Line\" step, if it was a \"Install Software\" step, it would fail when the ConfigMgr installation would stop the WMI service. The error for this can be seen in the SMSTS.LOG which specifies that the Agent Service is not running. So any task that stops a service that is depending on WMI has to be using a command line step in the task sequence in order to be installed. This type of applications are often anti-virus, VPN, firewalls etc etc."], "Author": ["Rod Trent"], "Date": "2009-05-26 00:00:00"}, {"Tags": ["configmgr", "os deployment", "osd", "task sequence"], "URL": "http://blogs.1e.com/2009/05/22/configmgr-task-sequence-variable-for-distribution-point/", "Area": ["SCCM"], "Comments": [{"Comment": "Doesnt work as described for packages that have been distributed to multiple DPs. The variable %_SMSTSSSC000A1% in my case (where the package ID is SSC000A1) resolved to a list of all the DPs the package is distributed to separated by commas.", "Date": "2011-08-17 09:44:00", "Author": "Tu Pham"}], "Content": ["You can use variables that reference the DP path for each package, there is no variable that references the DP as there could be many DPs.", "Dependnign on advert settings you can get both SMB and HTTPs locations for the DP in two difference variables. However, you can always get the UNC path by using the following environment variable, given that the package is being referenced in the TS.", "%_SMSTSUK10009F% would resolve a full UNC path for package UK10009F, ending with a backslash, so running a batch file from a TS you can specify the following command line when you have referenced the package:", "cmd.exe /c %_SMSTSUK10009F%SampleBatchFile.cmd", "Hope this helps!"], "Author": ["Rod Trent"], "Date": "2009-05-22 00:00:00"}, {"Tags": ["configmgr", "os deployment", "osd", "task sequence"], "URL": "http://blogs.1e.com/2009/05/21/importing-and-exporting-configmgr-tasks-sequences/", "Area": ["OS Deployment", "SCCM"], "Comments": "", "Content": ["First of all, if you want to programmatically import/export tasks sequences ensure that you are on SP1, that contains the undocumented import functionality. More about that in later posts.", "If you want to import a task sequence, ensure that you have all the ConfigMgr tasks sequence extensions as you did have in the original task sequence. For instance MDT and Nomad Branch adds steps that can be used in task sequences, so if you are importing a task sequence with these steps you need to ensure that MDT is set up and that the Nomad Branch consule bits are installed prior to importing.", "There are also special cases where the password bits hinder an import, so some manual cleansing might be needed before importing."], "Author": ["Rod Trent"], "Date": "2009-05-21 00:00:00"}, {"Tags": ["configmgr", "os deployment", "osd", "task sequence"], "URL": "http://blogs.1e.com/2009/05/18/running-a-configmgr-task-sequence-command-line-as-a-specified-user/", "Area": ["OS Deployment", "SCCM"], "Comments": "", "Content": ["When you use the \"Run this step as the following account\" in ConfigMgr you need to be aware of the fact that the OSD environment does NOT follow to the new user environment. This means that scripts referencing the Microsoft.SMS.TSEnvironmentor the BDD/MDT oEnvironment.Item objects will fail to run. So in order to workaround this you will have to parse any variables needed into the actual script using command line arguments. So in the picture below you can see how we workaround feeding the computername variable to a script that runs as domain admin, if the script had referenced theoEnvironment.Item(\"COMPUTERNAME\") it would have failed."], "Author": ["Rod Trent"], "Date": "2009-05-18 00:00:00"}, {"Tags": ["configmgr", "os deployment", "osd", "task sequence"], "URL": "http://blogs.1e.com/2009/05/14/when-working-with-configmgr-osd-collection-variables/", "Area": ["SCCM"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2009-05-14 00:00:00"}, {"Tags": ["configmgr", "os deployment", "osd", "task sequence"], "URL": "http://blogs.1e.com/2009/05/14/setting-dns-search-order-with-configmgr/", "Area": ["OS Deployment", "SCCM"], "Comments": "", "Content": ["If you are trying to set the DNS Search order during an OSD task sequence, this will never work if you specify a 127.0.0.1 address. It seems like both WMIC and ConfigMgr fails to use this as a valid address. Please also note that the DNS step has to be configured if you are setting a static IP, it cannot be blank unless you are skipping DNS configuration."], "Author": ["Rod Trent"], "Date": "2009-05-14 00:00:00"}, {"Tags": ["configmgr"], "URL": "http://blogs.1e.com/2009/05/14/controlling-the-installation-of-the-configmgr-provider/", "Area": ["SCCM"], "Comments": "", "Content": ["The ConfigMgr (Don't you worry, SMS 2003 works exactly the same) Provider is somewhat of an unknown component when it comes to designing hierarchies. For people who haven't got a clue what the provider is; it's the WMI engine responsible to talk to the DB etc (root\\sms_site_XXX).", "You can control where the Provider gets installed in the installation sequence when doing a ConfigMgr install, or if you are installing it unattended, use the SDKSERVER=SERVERINUPPERCASE value in your answer file. For Primary sites, the SDKSERVER means where the Provider goes, for the AdminUI, it means what server to point at, makes sense as the Admin console talks to the provider. By default the Provider goes onto the SQL box, and if that is not allowed for some reason, it can be on the ConfigMgr box itself. But did you know that the Provider actually could be on a completely different server?", "So what are the main reasons to have your Provider on anything but the SQL Server (Which is the default)?", "As we see above, there are a couple of instances where the Provider might end up in a few different places"], "Author": ["Rod Trent"], "Date": "2009-05-14 00:00:00"}, {"Tags": ["configmgr"], "URL": "http://blogs.1e.com/2009/05/12/installing-configmgr-sp1-upgrade-and-r2-unattendedsilent/", "Area": ["SCCM"], "Comments": "", "Content": ["In order to install/upgrade ConfigMgr the following commands and steps must be used, not rocket science but not documented anywhere either;", "As always, when copying code ensure that quotes and dashes are correct before running commands, \" and \" are not the same!", "Have fun!"], "Author": ["Rod Trent"], "Date": "2009-05-12 00:00:00"}, {"Tags": ["opsmgr"], "URL": "http://blogs.1e.com/2009/04/24/upgrading-a-clustered-rms-from-opsmgr-sp1-to-r2/", "Area": ["SCCM"], "Comments": "", "Content": [], "Author": ["Dan Kregor"], "Date": "2009-04-24 00:00:00"}, {"Tags": ["opsmgr", "system center"], "URL": "http://blogs.1e.com/2009/04/22/making-the-most-of-run-as-in-opsmgr-2007-r2/", "Area": ["SCCM"], "Comments": "", "Content": [], "Author": ["Andy Dominey"], "Date": "2009-04-22 00:00:00"}]