[{"Tags": [], "URL": "http://blogs.1e.com/2012/04/17/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-2-site-hierarchy/", "Area": ["1E News", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-17 00:00:00"}, {"Tags": ["1e", "configmgr", "nightwatchman", "nightwatchman server edition", "nomad", "os deployment", "osd", "shopping", "wakeup", "windows 7"], "URL": "http://blogs.1e.com/2012/04/16/1e-at-mms-2012-have-we-got-a-week-for-you/", "Area": ["1E News", "1E Products", "ConfigMgr", "Events", "IT Efficiency", "MMS", "NightWatchman", "NightWatchman Server", "Nomad", "OS Deployment", "SCCM", "Shopping", "Windows 7"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/16/1e-at-mms-what-you-need-to-know-for-system-center-2012-success-1-application-model/", "Area": ["1E News", "MMS"], "Comments": "", "Content": [], "Author": ["Su Kent"], "Date": "2012-04-16 00:00:00"}, {"Tags": ["1e", "carbon reduction", "case study", "customer", "energy efficiency", "green it", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2012/04/16/we%e2%80%99re-in-the-running-for-two-businessgreen-leader-awards/", "Area": ["1E Community", "1E News", "Events", "Green IT", "NightWatchman"], "Comments": "", "Content": ["", ""], "Author": ["Su Kent"], "Date": "2012-04-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/10/applications-applications-applications-how-to-ensure-you-are-compliant/", "Area": ["1E News", "1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Rob Nichols | Escalation Engineer", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Robert Nichols"], "Date": "2012-04-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/04/04/appclarity-savings-in-30-days/", "Area": ["1E News", "1E Products", "AppClarity"], "Comments": "", "Content": ["The Hitchhiker is on the right  track, actually. The ability to do more in less time is always a business  aspiration, particularly when considering spending and cutting cost.", "Heres a question for the  hitchhiker: Is there a 7 minute abs of IT efficiency that can deliver huge cost  savings in a short amount of time?", "We all know the standard way of  software auditing: pull together a team of FTEs to spend huge amounts of time  gathering a massive Excel document of licenses believed to be in the field, months  of interrogating users on what applications they can part ways with, manually  applying license information to each software product and version only to find  that Adobe X and Adobe 10 have been double counted, and finally blindly  uninstalling software hoping users in Asia wont call in the middle of the  night complaining their business critical applications have mysteriously  disappeared."], "Author": ["Matt Albert"], "Date": "2012-04-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/03/30/appclarity-and-workers%e2%80%99-councils/", "Area": ["1E Products", "AppClarity"], "Comments": "", "Content": [], "Author": ["Patrick Treptau"], "Date": "2012-03-30 00:00:00"}, {"Tags": ["advertisements", "configmgr", "VBScript", "wmi"], "URL": "http://blogs.1e.com/2012/03/30/john-devito/", "Area": ["ConfigMgr"], "Comments": "", "Content": ["I recently wrote some VBScript code to be used in connecting to the Provider on a ConfigMgr 2007 site in order to manipulate the various radio buttons and checkboxes on the different tabs of the Advertisement Properties dialog box. Several of the settings are controlled by RemoteClientFlags and AdvertFlags properties in the SMS_Advertisement WMI class.", "So I wrote a little script. The script evaluates all of the adverts configured on a site server and outputs them to a file that lists the property, the hex value, and the flag (bit) description. The output format starts with the Advertisement Name followed by a list of the flags. As shown below, each line contains the data/time stamp, RCF or ADV to indicate which property the flag is part of, the bit for each flag, the flag description, and a 1 or 0 to indicate if it is set or not.", "Below is an example log for an advertised task sequence:", "With this script it is easy to see which flags are set. Manually change things in the Advertisement Properties dialog and re-running the script allow you to see what flags change and can help with seeing which flags are associated with each item. This script outputs the flags set for every advert, but it can be easily modified to limit the logging to specific advertisements. By default the log is written to C:\\Windows\\Temp\\FlagEval.log", "Once you know what flags you want to set or clear you simply refer to the bit as 2^# (where the bit # is identified in the FlagEval log). For example, to enable Wake on LAN for a package you would add 2^22 to the AdvertFlags property of the packages instance in the SMS_Advertisement class.", "FlagEval.vbs", "John DeVito | Senior Consultant", "If you found this article helpful, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["John DeVito"], "Date": "2012-03-30 00:00:00"}, {"Tags": ["1e", "1E Community", "Charity fundraising", "Charity work"], "URL": "http://blogs.1e.com/2012/03/23/running-the-new-york-marathon-in-memory-of-loved-ones/", "Area": ["1E Community", "1E News", "Charity", "Events"], "Comments": "", "Content": ["Myself and three 1E vice presidents; Eric Beller, Paul Szemerenyi and Ambareesh Kulkarni ran the New York half marathon last weekend, raising almost $22,000 for the American Cancer Society. The American Cancer Society is a nationwide, community-based voluntary health organization dedicated to eliminating cancer as a major health problem.", "Our over 40s team were perhaps not natural long-distance runners, but were unerring in their support of the cause. These days, it seems hard to find a life that hasnt in some ways been touched by cancer and that was sadly true of our team members and the real raison dtre behind our committing to the run.", "We joined 22,000 other runners on a route that took us round Central Park, through Times Square, down the Westside Highway, past Ground Zero and then back up to the Southsea Port to the finish line. We had great support throughout from the crowds and the other runners and it was a wonderful occasion that we were all very proud to be a part of.", "I crossed the finish line in 5139th place but personal satisfaction aside, one of the best bits about the run was that 1E generously matched all of the donations from our friends, colleagues and family, beating our fundraising target by 100% and making us the highest fundraising team for the charity."], "Author": ["Nick Milne-Home"], "Date": "2012-03-23 00:00:00"}, {"Tags": ["1e", "appclarity", "configmgr"], "URL": "http://blogs.1e.com/2012/03/22/i-m-unique-just-like-everyone-else%e2%80%a6/", "Area": ["AppClarity", "ConfigMgr", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["One of the biggest challenges with managing licenses is dealing with variation. Lets take a well-known vendor such as Adobe. Over time, their products will be named differently. For a single product and version you may huge variations in naming such as Adobe Acrobat 8 Professional or maybe Acrobat Pro 8 or maybe just Acrobat Professional. Very quickly things become complex and convoluted and if you cant even normalize the product names, how can you have any hope of knowing what you have installed and whether you have counted something more than once?", "In addition to its ability to find and reclaim unused licenses across the entire environment, AppClarity has an incredibly sophisticated heuristics engine which takes all this raw information from Microsoft System Center Configuration Manager and transforms it into usable data.", "The first step is to strip out all of the stuff you dont care about for license management such as drivers, software updates, patches etc. Then we crush all of the variants down into a single Publisher and Product so all the variants of Acrobat regardless of how obscure, become Adobe Acrobat Professional. Finally, we hide the non-licensable software since youll probably not need to worry about that either (although you can bring it back if you like).", "But dont just take the theory at face value; Ive seen this in action. Whilst at a client site looking at their software deployment data and comparing it to their in-house license management application, some discrepancies were found. AppClarity was, in some cases, displaying several hundred application installations different from their own system. Clearly we had to investigate.", "It turns out that the discrepancies rested with the fact that some of the installations of products were simply products that had been long-since uninstalled but left remnants behind. Their system still flagged these as installations but AppClarity filtered them out immediately.", "There were a large number of machines that had upgraded from one product version to another at some point and their existing method was counting the installations once for each version. For example, Acrobat 7 upgraded to 8 would be counted twice. Once again, AppClarity came through by dealing with the variants and eliminating the duplicate records. In fact, when all was said and done, AppClaritys data was proven to be spot on.", "The last thing that I did before leaving site was to generate a license liability report for the client for one of their major vendors. Using AppClarity, we were able to generate the report in about 10 seconds, which would have traditionally taken him several weeks to pull together so needless to say he was very, very happy!", "1Es AppClarity, AppClarity or AC.whatever you want to call it, Rocks!"], "Author": ["Andy Dominey"], "Date": "2012-03-22 00:00:00"}, {"Tags": ["application rationalization", "license creep"], "URL": "http://blogs.1e.com/2012/03/14/appclaritywhats-in-it-for-the-administrator/", "Area": ["1E Products", "AppClarity"], "Comments": "", "Content": ["Houston, we have a problem (were short 116 licenses).", "Lastly we can record how we intend to resolve the discrepancy between installed and owned. This is done with a simple r-click on the product line, and selecting the desired action. Compliance Resolution allows us to initiate an automatic uninstall (also a topic for another day); or simply pay up via a true-up purchase for our 116 additional licenses. We also allow flagging the app as Business Critical (white-list; never uninstall), or add it to the list of Prohibited apps (black-list; always uninstall wherever found, regardless of usage)", "Then go for a coffee."], "Author": ["Ed Aldrich"], "Date": "2012-03-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/03/07/1e-appclarity-reclaiming-complex-applications/", "Area": ["AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "When automatically reclaiming an used license, is there a mechanism in place to remove the device (or in the case of an App-V app targetted at a user, then a user) from the associated SCCM collection used for provisioning?", "Date": "2012-03-20 10:16:00", "Author": "March 20, 2012 at 10:16 pm"}, {"Comment": "Hello Craig.  Thank you for your post.  ", "Date": "2012-03-22 09:53:00", "Author": "Brent Hunter"}, {"Comment": "Hi,", "Date": "2012-03-22 08:39:00", "Author": "March 22, 2012 at 8:39 pm"}, {"Comment": "Hi,", "Date": "2012-04-12 09:16:00", "Author": "April 12, 2012 at 9:16 pm"}, {"Comment": "Hi Craig,\nThis is a great point, and I've asked our AppClarity Product Manager for how we can deal with these instances. Here is his response:", "Date": "2012-04-13 11:12:00", "Author": "Brent Hunter"}, {"Comment": "Hi,", "Date": "2012-04-13 11:05:00", "Author": "April 13, 2012 at 11:05 pm"}, {"Comment": "Hi Craig.   I know this is an old thread, but I wanted to let you know that AppClarity has now supported App-V applications since version 3.2 (released August 2012).", "Date": "2014-04-10 08:14:00", "Author": "Brent Hunter"}, {"Comment": "Hi, Does 1E Appclarity monitors Application Usage Without SCCM integration??", "Date": "2013-05-08 05:03:00", "Author": "May 8, 2013 at 5:03 am"}, {"Comment": "Hi Prabha, I believe it is a requirement to have SCCM integration to monitordesktop application usage. With the release of 4.0 there is Agentless server software inventory. You can see more in this video:", "Date": "2013-05-09 11:15:00", "Author": "May 9, 2013 at 11:15 am"}, {"Comment": "Hi there.  1E AppClarity now includes an Agent (as an optional feature) for environments without ConfigMgr already installed/deployed.", "Date": "2014-02-27 11:18:00", "Author": "Brent Hunter"}, {"Comment": "1E AppClarity Service stopped working. Not able to start the service..", "Date": "2013-06-05 06:32:00", "Author": "June 5, 2013 at 6:32 am"}, {"Comment": "Firstly, please use your 1E Support Portal access to request support such as this.", "Date": "2013-06-05 08:26:00", "Author": "Brent Hunter"}], "Content": ["1E AppClarity has the ability to automatically uninstall software, on a per-application basis. This can be controlled bysoftware reclaim policies dependingif the application has not been used in the past 90 days or even if you want to prohibit specific applications.One ofthe benefits of removing unused software is that it avoids the additional cost of purchasing licenses (for new installations) when they werent even required in the first place. This is of course great news for the IT department and the software license budget.", "1E AppClarity has the intelligence to uninstall the majority of applications in our organisations.Ensuring 1E AppClarity can uninstall a specific application is a simple process.Ideally we would test this in a lab.And wanting to be proactive, we can discover if 1E AppClarity can uninstall an application (using the vendors MSI), by using the Reclaimer utility on a computer that has the application already installed.", "Its very simple and easy, however its not always plain sailing, and sometimes the vendor has complicated our lives by using additional installation tools, such as setup.exe.", "Software vendors sometimes complicate application installations by using a bootstrap executable, such as setup.exe to pass environment or additional variables to the actual MSI. Typical examples include Microsoft Office and Adobe Creative Suite.", "Using the above command-line does not result in an automated and silent uninstallation of the application, so we must take additional action to do so.", "Create a batch file or script that includes the necessary logic to perform the uninstallation. The following batch file uninstalls the entire Adobe Creative Suite:", "The return code of this batch file will be sent back to AppClarity in order to report a success/failure of the uninstallation.", "Now that we have discovered the vendors specific command-line to uninstall Adobe Creative Suite, we need to wrap it all up together and add it to our 1E AppClarity Reclaimer package in ConfigMgr.", "Now that we have configured the specific software reclaim policy, we need to update the 1E AppClarity Reclaimer package in ConfigMgr. Include the batch file in the package in a new sub-folder called Resource, as shown below:", "I also have a helper script (called AppClarity_HelperScript.vbs) that the 1E AppClarity Reclaimer program in ConfigMgr is configured to run. This script is responsible for copying the package source files (and any additional resource files) to the local computer, and then executes the Reclaimer utility.", "In this example, we discovered how AppClarity is capable of uninstalling applications that were installed using the vendors native MSI yet required some additional action to compensate for a setup.exe bootstrap.", "All 1E products are sold with Professional Services bundled as a part of an overall solution. This is because 1E believes that delivering successful, well managed deployments lead to the end customer achieving a successful and fully operational environment, while providing detailed training and documentation during the engagement.", "Brent Hunter |EMEA Solutions Engineer", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left. Thank you."], "Author": ["Brent Hunter"], "Date": "2012-03-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/03/01/debating-the-eu-energy-efficiency-directive-at-uk-parliament/", "Area": ["1E News", "IT Efficiency"], "Comments": [{"Comment": "Certainly, but everyone needs to realise that adding Solar on their home is an purchase that should increase the longer term worth of their property if / when they make a choice to sell. With the environment the way it is going we cannot overlook any item that offers totally free electricity at no cost to both the buyer and more notably the world!", "Date": "2013-02-16 03:28:00", "Author": "JakeyM"}], "Content": ["These include:", "She commented: Across Europe it looks like we will reach less than 9% of the Energy Efficiency target by 2020. However, we see that the 20% figure is on track to be achieved in reducing emissions and increasing renewable energy sources. The key difference is that the renewable energy target is mandatory; the energy efficiency target is not. The only way to make progress with energy efficiency is for such targets to be binding.", "Tony Robson chair of EU-ASE concurred that the directive was a good idea and its essential to impose legislation to achieve the imperative of Energy Efficiency. He also commented that there is an ever-widening gap between our commitments to reduce CO2 and reality. We need to continue a fight against imported energy dependency. Energy efficiency must come first, and we should force energy companies to recycle money into energy efficiency measures. The UK can lead here and build on existing legislation.", "Looking at IT is the low-hanging fruit in terms of reducing our environmental impact. European policy makers are missing a fundamental opportunity. Data from independent research shows that nearly $4bn can be saved across data centres every year and a further 200 million personal computers can be targeted with additional savings.", "When asked whether IT will feature on the UKs efficiency measures, Davey commented that he liked to get granular, chase the big numbers and get into the details. He concluded that the DECC would be fighting for positive change and didnt rule out the possibility of an incentive structure to make it work."], "Author": ["Su Kent"], "Date": "2012-03-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/28/1e-and-sustainableit-seek-to-save-australia/", "Area": ["1E News", "1E Partners"], "Comments": "", "Content": ["1Es chief executive officer of 1E, Sumir Karayi said this new development was timely as Australia is claimed to be the worlds worst polluter per capita and, now facing a carbon tax, had a big challenge ahead.", "We can help Australian organisations reduce their energy use by focusing specifically on corporate PCs and servers which account for 60 per cent of IT energy use, he said."], "Author": ["Rod Trent"], "Date": "2012-02-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/24/following-1e-february-28-2012-at-the-house-of-commons/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["28 February 2012 from 12-2pm; The Grimond Room, Portcullis House, House of Commons", "COMMON SENSE POLICY IN AN AGE OF AUSTERITY", "WHY THE UK NEEDS A EUROPEAN FRAMEWORK FOR ENERGY EFFICIENCY", "Greater energy efficiency is a critically important part of solution to help lift the UK out of the financial and economic crisis. In these difficult times, managing energy use is one of the most cost-effective solutions to stimulate a green economy.", "The good news is that this solution is available. Energy efficiency is an area where British businesses excel and many of them already have technologies and services to help British citizens, communities and businesses save significant amounts of energy. Energy efficiency will also reduce the UKs dependence on foreign energy supplies.", "This will only be achievable if the coalition government supports the market transition through the appropriate regulatory tools by setting out a coherent and detailed plan for implementing the UKs Green Deal and through supporting the EUs Energy Efficiency Directive. Yes the EU, because putting in place a regulatory framework for energy efficiency at the European level is the most effective way to give investors certainty in the energy efficiency market. A binding commitment for energy efficiency in Europe will also create opportunities for British companies to export their solutions, technologies and know-how into other European countries and create hundreds of thousands of local jobs, particularly in the UKs ailing construction sector.", "The UK has led the way in terms of recent energy efficiency policies and the Green Deal has the potential to be a landmark policy instrument that could be driven across the EU, driving UK businesses with it, but only if we support a strong European Energy Efficiency Directive. Moreover, whilst UK PLC will do well from exporting its policy instruments it has little to fear from the European Commissions proposal except a situation where European consumers will be able to spend money on British goods and services rather than expensive energy.", "The UK can and should lead the charge on energy efficiency in Europe; we have the experience, we have the know-how and leading British companies are supportive of European action.", "Panelists:"], "Author": ["Rod Trent"], "Date": "2012-02-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/15/v1ewpoint-the-efficient-it-magazine/", "Area": ["1E News", "IT Efficiency"], "Comments": "", "Content": ["The most recent issue digs deep into Power Management and is available just by subscribing."], "Author": ["Rod Trent"], "Date": "2012-02-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/14/nightwatchman-enterprise-and-1e-are-finalists-in-the-green-it-awards/", "Area": ["1E News", "Awards"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2012-02-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/07/following-1e-it-efficiency-is-the-next-evolutionary-step/", "Area": ["1E News", "IT Efficiency"], "Comments": "", "Content": ["And, while this may well be the next push, and another pioneering effort by 1E, the concept is so obvious. Making IT efficient is the only way to provide a true value after many years of gluttony. Fortunately, 1E has already developed solutions to make the evolution of IT as easy as possible."], "Author": ["Rod Trent"], "Date": "2012-02-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/06/better-together-appclarity-and-configuration-manager-2012/", "Area": ["AppClarity"], "Comments": "", "Content": ["Take a look when you get a chance:", "AppClarity immediately identifies and accurately quantifies your software waste. This software asset management solution presents a rationalized inventory of installed applications, license costs and where installations are unused. By analyzing all your applications AppClarity provides you with actionable results to intelligently help you to automatically reclaim and recycle your software assets."], "Author": ["Rod Trent"], "Date": "2012-02-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/03/how-much-time-and-money-is-your-company-spending-on-software-delivery-management-2/", "Area": ["1E Products", "AppClarity"], "Comments": "", "Content": ["How much time and money is your company spending on software delivery management? Shopping empowers users to install software, operating systems and services at a time when it suits them without disrupting their daily workload."], "Author": ["Rod Trent"], "Date": "2012-02-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/02/01/kiwibank-uses-1e-solutions-to-turn-off-pcs-and-lower-bills/", "Area": ["1E News", "1E Products", "NightWatchman"], "Comments": "", "Content": ["The projected $18,614 in annual savings Kiwibank cites from turning those systems off comes from estimates that resulted from a separate assessment with models and analytics the consultant used, which are different from those 1E deployments, Petelo says."], "Author": ["Rod Trent"], "Date": "2012-02-01 00:00:00"}, {"Tags": ["patch management"], "URL": "http://blogs.1e.com/2012/01/31/following-1e-system-center-configuration-manager-on-steroids/", "Area": ["1E Products", "AppClarity", "ConfigMgr", "Events", "NightWatchman", "Nomad", "PC Power Management", "SCCM"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2012-01-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/31/actually-look-forward-to-your-next-software-audit/", "Area": ["1E Products", "AppClarity"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2012-01-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/26/nomad-enterprise-reaches-finalist-in-the-network-computing-awards/", "Area": ["1E News", "Awards"], "Comments": "", "Content": ["www.networkcomputingawards.co.uk"], "Author": ["Rod Trent"], "Date": "2012-01-26 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/25/presidential-state-of-the-union-address-so-what-does-it-mean-to-1e/", "Area": ["1E News", "IT Efficiency", "NightWatchman", "NightWatchman Server"], "Comments": "", "Content": ["Energy efficiency is a key pillar in President Obamas vision for an economy built to last. The easiest way to save money is to waste less energy. We hear that loud and clear!", "Reining in of non-productive servers produces $3.8 billion in energy cost savings alone", "A one night shut down of the worlds PCs would save enough energy to power the Empire State Building for 30 years", "By looking at the energy use of your PCs and servers and taking steps to reduce waste, youre also taking a first step towards greater IT Efficiency. Whats not to like?"], "Author": ["Rod Trent"], "Date": "2012-01-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/23/following-1e-state-department-using-1e-to-cut-emissions/", "Area": ["1E News"], "Comments": "", "Content": ["The State Departments new mission is cutting emissions  one computer at a time. The department is working to save millions of dollars and cut 21,000 tons of carbon emissions by cutting power waste in its computers."], "Author": ["Rod Trent"], "Date": "2012-01-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/19/following-1e-discovery-channels-treehugger-interviews-1e-ceo-on-the-cloud-and-it/", "Area": ["1E News", "Green IT", "IT Efficiency"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2012-01-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/13/it-asset-management-our-new-microsite-helps-you-get-it-under-control/", "Area": ["1E Products", "AppClarity"], "Comments": "", "Content": ["Weve unveiled a new Microsite to help you understand and get a handle on your IT Asset Management woes. It answers the most common questions such as:", "Take a look at the new Microsite by visiting the following link:", "http://efficiency.1e.com/it-asset-management/"], "Author": ["Rod Trent"], "Date": "2012-01-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/12/vnext-partners-with-1e-to-solve-frances-it-efficiency-problems/", "Area": ["1E News", "1E Partners"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2012-01-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/11/1e-pulls-away-from-other-vendors-in-the-pcpm-landscape-says-ovum/", "Area": ["1E News"], "Comments": "", "Content": ["1E ranks as the reporting leader by virtue of its expansive breadth and depth of reporting capabilities, according to the guide. NightWatchman Enterprise from 1E includes what-if analysis, which can compare actual and hypothetical groups of machines by make and model, software installed, or any other type of metric. This yields power-usage data for modeling for PC refresh cycles, as well as for determining the most energy-efficient deployment configurations.", "Among its strengths, NightWatchman Enterprise features robust PC insomnia capabilities called Advanced Sleepless Client Detection, whose breadth and depth is a competitive differentiator. It reports on processes that prevent PCs from sleeping, such as anti-virus software and screensavers, and allows administrators to automatically override them, continues Ascierto.", "We are thrilled with this accolade from Ovum, comments Sumir Karayi, CEO, 1E. PC power management is just one part of the IT efficiency jigsaw and 1E is dedicated to working with our customers to help them achieve maximum savings by identifying unused IT, removing it and optimizing everything else."], "Author": ["Rod Trent"], "Date": "2012-01-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/11/following-1e-6-predictions-for-green-it-in-2012/", "Area": ["1E News"], "Comments": "", "Content": ["Have any to add? Dont agree with a bullet point? Drop a comment here."], "Author": ["Rod Trent"], "Date": "2012-01-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/10/u-s-state-department-utilizes-1e-to-cut-carbon-emissions-and-save-power/", "Area": ["1E News"], "Comments": "", "Content": ["Read the details of how 1E solutions helps manage the State Departments 88,986 desktops at 468 worldwide sites:", "http://gov.aol.com/2012/01/10/state-department-power-initiative-to-cut-carbon-emissions/"], "Author": ["Rod Trent"], "Date": "2012-01-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2012/01/04/following-1e-how-the-public-sector-can-use-more-current-resources-and-cut-costs/", "Area": ["Data Center", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["Read through the components to get a better understanding of areas where your organization can help define 2012 as the year of IT Efficiency."], "Author": ["Rod Trent"], "Date": "2012-01-04 00:00:00"}, {"Tags": ["nightwatchman", "pc power management", "PCPM"], "URL": "http://blogs.1e.com/2012/01/04/ovum-report-highlights-reasons-for-power-management-implementation-reluctance/", "Area": ["1E News", "PC Power Management"], "Comments": "", "Content": ["A new reports from Ovum shows that, despite the huge savings in cost and environment, some organizations are still tentative about deploying a power management solution. Ovum sites a few reasons in the article. They are all interesting reasons, but, as I read, one stands out to me as something I havent thought of previously, and its worth mentioning here in the event it describes your organization.", "One of the reasons, Ovum outlines, centers around the built-in power management capabilities of the operating system itself, and that IT Admins believe that the improvements made in Windows 7 are enough. For a home computer, this may be true. But, for an organization of several thousand computers, where the endpoints must be managed centrally, this deception is costing them money.", "I think this confusion comes from a couple sources: 1) Microsoft, and 2) orgs like Energy Star.", "Microsoft is proud of their Windows 7 operating system, and they should be. Windows 7 is heads above previous versions. The power management functions have been greatly improved. But, being able to manage power from a central point (including saving data on power down, remote boot on a schedule, etc., etc.) still remains a mystery to Windows 7. When you have thousands of computers to maintain, central management is a must. Just being able to administer from a central location saves tons of money on its own.", "In the brief breakdown of the report on eWeek.com, Nathan Eddy walks through a few more standout reasons. Take a look when you get a chance:", "Power Management Savings Overlooked by Businesses: Report"], "Author": ["Rod Trent"], "Date": "2012-01-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/16/inefficient-it-will-cost-global-businesses-over-the-festive-season/", "Area": ["1E News", "IT Efficiency"], "Comments": "", "Content": ["Global businesses that do not focus on efficiency will be hit by unnecessary costs over the festive season. 2012 is the year to change that.", "According to independent research firm Forrester Research, Inc. in the report 2012 IT Budget Planning Guide for CIOs (October 27, 2011), improving the efficiency of IT tops the list for enterprises as they go into 2012. Forrester Research writes: While 2011 started with a more robust IT spending environment, many organizations began to pull back midyear, and 2012 plans are expected to be more conservative given the high degree of uncertainty. [...] Efficiency and consolidation are top IT priorities.", "CIOs are being pulled in multiple directions at once. They are faced with budget constraints; getting to grips with the big data challenge; the need to get quick returns on investment and optimize costs; reluctance from the business to embark on IT projects that last longer than 6 months and ever-increasing responsibilities in a demanding role that is constantly changing. Like the technology frameworks they need, CIOs must remain agile in their roles, must continue to innovate and bring about positive business change. To some, this will mean investing now to make greater efficiencies in the long-term.", "As we draw a line under 2011 and enter a new year, organizations worldwide must place a renewed focus on greater IT efficiency. There is no need to feel daunted by the challenge and become paralyzed by inaction. There are ways to identify unused IT, remove it and make everything else more efficient. Once this is done, the prospect of facing a new year of austerity measures and budget constraints will seem a lot brighter.", "Here are 1Es top tips for an IT efficient Christmas:", "References:"], "Author": ["Rod Trent"], "Date": "2011-12-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/16/how-much-time-and-money-is-your-company-spending-on-software-delivery-management/", "Area": ["1E Products", "AppClarity", "Shopping"], "Comments": "", "Content": ["Deploy applications, even operating systems, effortlessly just by giving the end-user access to a familiar shopping experience. Pump up your Windows 7 migrations!"], "Author": ["Geoff Collins"], "Date": "2011-12-16 00:00:00"}, {"Tags": ["climate change"], "URL": "http://blogs.1e.com/2011/12/16/cop-in-or-cop-out/", "Area": ["The Green Room"], "Comments": "", "Content": ["Global climate politics are incredibly complex. Climate ministers have been locked in decades of lengthy all-nighter talks but have made little progress. Indeed, the United Nations COP series of International Climate Change Summits have long been under fire for lacking substance. So, what really happened during COP 17 in Durban this December? Were the additional 36 hours of negotiation worth the wait?", "For the optimists among us, Durban did achieve positive change. The goal of the summit was to negotiate a new climate deal by 2015; a deal that would replace the Kyoto protocol. Indeed, progress towards that goal was made. The worlds biggest carbon emitters  China, the United States, the EU and India  have all agreed to negotiate legally binding restrictions. Thats a big change from the terms of the Kyoto protocol, which essentially excluded developing countries; among them China, the worlds biggest carbon emitter.", "It was also agreed that poorer countries would get a $100bn fund by 2020, to help them develop frameworks for a green economy and cope with the effects of climate change. But the crucial issue at the talks, aside from the heated exchange between the UE, India and China, was whether a new agreement on protecting the climate should have full legal force.", "Thats where the pessimists among us perhaps had a little bit more to play with. Some argue that securing the legality of the agreement gave way to scrimping on the detail. The Durban treaty will be negotiated by 2015, which means we could stand to see ministers locked in the same frantic negotiations for the next few years. Whatever is agreed will be coming into force from 2020, a full eight years from now! Until then we have the Kyoto agreement  although Japan, Russia and Canada stated that they would not take on further Kyoto targets. All three are, incidentally top ten emitters of Green House Gases (GHGs).", "Post COP17, negotiators are under continued fire for having failed to commit to ambitious enough emissions reduction targets, so according to some, we are no further away from dangerous climate change than we were."], "Author": ["Karolina Shaw"], "Date": "2011-12-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/15/services-provider-balfour-beatty-workplace-cuts-carbon-by-143-tonnes/", "Area": ["1E News", "1E Products", "NightWatchman"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-12-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/14/nightwatchman-server-edition-is-a-searchdatacenter-com-product-of-the-year-finalist-for-2011/", "Area": ["1E News", "Awards", "NightWatchman Server"], "Comments": "", "Content": ["The products are all nominated based on the following criteria:"], "Author": ["Rod Trent"], "Date": "2011-12-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/14/nomad-and-nightwatchman-gives-the-the-u-s-department-of-state-quick-success-in-security-and-savings/", "Area": ["1E Customers", "1E News", "PC Power Management"], "Comments": [{"Comment": "Pingback: IT Security | Mitigation strategies to protect your assets", "Author": "IT Security | Mitigation strategies to protect your assets"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-12-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/06/key-criteria-to-consider-when-evaluating-nomad-enterprise-against-other-vendor-products/", "Area": ["IT Efficiency", "Nomad"], "Comments": "", "Content": ["IT departments are constantly challenged with finding ways to reduce infrastructure and operational costs while providing and maintaining uninterrupted services to the business. All this often needs to be achieved with limited resources and budget.", "Streamlining systems management can yield significant infrastructure and operational savings specifically in the spaces of Wide Area Network (WAN) optimization and remote branch management. Surprisingly there are very few solutions which play in this space and are able to truly provide the value-add and savings being sought. It is thus very important to perform an evaluation which considers ALL criteria including less obvious items to determine which products best fit your organizations needs.", "As part of the evaluation process you might make use of external sources such as articles, blogs etc. to try and determine how a product is viewed and used by others. Always make sure the source is reliable and trusted  often good sources take the form of customers who have had the solution in place for a few years. Beware of independent reviews which have not been conducted in a professional manner and thus dont inform you of how exactly findings were determined  these sort of reviews/opinions can be misleading and damaging and can often be influenced by those with something to gain.", "A thorough technical/functional evaluation is always a good idea too, any worthy product should pass this with relative ease. But, as many know this can consume valuable time and resources so by evaluating some of the criteria below one may well remove unfit contenders allowing more time to technically review and focus on the best solutions.", "Products on the market today operate well in deployments of a few hundred machines but often the solution being sought would need to manage and operate over thousands if not hundreds-of- thousands of machines. Organizations may only uncover scalability issues after the fact.", "Some products may provide a separate proprietary system/console with links into ConfigMgr. Ensure that this approach aligns with your overall resource management strategy because it could incur additional deployment, maintenance and training costs not to mention the links which could well be considered moving parts and are susceptible to breaking. These costs and concerns can be eliminated by leveraging industry-standard platforms that are already deployed within a company.", "This is an obvious area which should always be checked during any vendor evaluation. To simplify this you could ask some very straight forward questions namely: How many successful implementations have you completed? What is your largest deployment? Name your top five customers? How many devices are under management?", "It goes without saying that pricing is often a major deciding factor in any deal. If there is a significant price difference between products be sure to ask yourself WHY? New untried and untested V1 software is often a prime candidate for offering handsome discounts. The thinking behind this may be obvious in that vendors need to gain customers and ultimately market share, but as a buyer you need to tread cautiously because this discount comes at a price. New software WILL encounter significant teething problems and this will consume your time, effort, resources and patience not to mention inevitable downtime  this all COSTS you one way or another. In the end you may well find that the discount has been nullified and that you have in fact paid more. For many organizations the RISK of implementing significantly discounted V1 software is simply too HIGH.", "Once a product has been purchased you would expect to simply roll it out and begin taking advantage of its promised benefits. In many situations this is simply not the case. Implementation projects can consume valuable resources for extended periods of time and impact normal daily operational activities. The rollout can cause a lot of disruption to an organization and the benefits it was meant to introduce remain a distant aspiration. Your existing pains are compounded with a long and drawn-out implementation which incorporates many tweaks and enhancements that still need to be made, but which you thought had already been catered for in the product.", "You need to verify a vendors ability to implement their own solution. Often vendors do not have the resources required or are thinly spread and unable to adequately support a rollout. The easiest way to avoid this situation is to check how many previous deployments of a similar size and nature have been completed. Make sure these checks have been carried out with reference customers who have had the solution bedded in for at least one to two years (this should be an adequate time to determine a successful implementation). Also its worth verifying the vendors consulting headcount as you will soon realize whether they have the resource available to meet their commitments."], "Author": ["Stevan Lukic"], "Date": "2011-12-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/02/ms-bytes-by-technet-with-1es-mike-terrill-and-keith-combs/", "Area": ["Nomad"], "Comments": "", "Content": ["Join Keith Combs, Sr. Program Manager Server & Tools Online at Microsoft, and Mike Terrill, Systems Management Practice Lead at 1E, for a discussion around Microsoft System Center Configuration Manager. Mike is an expert in deployment consulting and discusses the challenges and solutions he is seeing with todays customers around deployment. He walks through how 1E is utilizing System Center Configuration Manager in their product Nomad Enterprise, which allows you to get bits over a slower network. Mike also talks about the importance of joining a community user group to get up to speed on the latest technologies. Tune in for some great tips!"], "Author": ["Rod Trent"], "Date": "2011-12-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/12/02/video-automatically-switching-off-idle-pcs-to-save-thousands/", "Area": ["PC Power Management"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-12-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/29/two-things-from-gartner-on-the-cloud-you-shouldnt-miss/", "Area": ["1E News", "Data Center"], "Comments": "", "Content": ["At the Gartner Data Center & IT Operations Summit 2011, Rakesh Kumar made a couple interesting yet startling admissions during a presentation. The first one, I think may even shock some of you reading this, while the second revelation is entirely conceivable given the landscape of the Cloud these days.", "Both of these are amazing statements and when the Cloud was first envisioned as a marketing term a few years ago, I really doubt anyone could have predicted that building a datacenter could actually prove to be cheaper. Gartner also goes on to say that the cost of renting rackspace in a hosted datacenter is doubling every two years. Again, I dont believe anyone would have guessed this, but considering how the cable TV industry jacks up prices due to demand, it does make sense.", "Something to think about."], "Author": ["Rod Trent"], "Date": "2011-11-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/29/the-nomad-effect/", "Area": ["IT Efficiency", "Nomad"], "Comments": "", "Content": ["Discover how you can harness its true power across your organization. You can significantly reduce your infrastructure footprint and overhead which cuts costs and deployment timelines."], "Author": ["Stevan Lukic"], "Date": "2011-11-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/28/newham-university-hospitals-nhs-trust-wins-public-sector-project-of-the-year-at-the-greenbang-2011-efficiency-awards/", "Area": ["1E News"], "Comments": "", "Content": ["Great news from one of our customers!", "Our work with advanced PC power management from 1E shows that it is possible to make significant energy savings without disrupting the work of frontline staff. In just one year, we saved 18,500 and reduced our carbon emissions by approximately 143 tonnes. Were now looking to measure server efficiency and identify how many are not doing anything useful, with a view to decommissioning or repurposing them. It is widely believed that 15% of servers are not doing any useful work, so we expect to see more efficiency savings here, concludes Jeffery."], "Author": ["Rod Trent"], "Date": "2011-11-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/22/nomad-enterprise-eliminates-the-need-for-costly-wan-optimization-device-upgrades/", "Area": ["Nomad", "OS Deployment"], "Comments": "", "Content": ["1Es Nomad Enterprise bandwidth management solution was recently selected and implemented by a couple notable and sizeable customers to address limitations they experienced when deploying Windows 7 OS images and standard software distribution packages via existing WAN Optimization infrastructure.", "The dilemma primarily centered around the fact that WAN Optimization devices are priced/purchased relative to their disk capacity. Our customers purchased 75GB models, but the combined total size of all their package and OS images was around 50GB. That only left 25GB available for all other content namely SharePoint, File/Print, Email, Video Content etc. The problem encountered was not being able to determine and have the assurance that all package content needed during OSD or standard software distribution was already cached at the WAN Optimization device. Furthermore, it was also unreliable and there were issues around manageability in that there was no real control over the content caching process. Each customer had to greatly depend on their internal Network teams to manage the whole process because they owned the devices.", "Our customers were faced with the option of upgrading their WAN Optimization device with additional disk space at a considerable cost instead they chose to purchase the Nomad Enterprise solution at a fraction of the cost and avoided any purchase, implementation and configuration of expensive hardware. They now also have greater control over their content caching process."], "Author": ["Stevan Lukic"], "Date": "2011-11-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/17/new-whitepaper-how-to-claim-your-energy-rebate-from-your-utility-provider-when-implementing-a-pc-power-management-solution/", "Area": ["1E News", "PC Power Management"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-11-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/17/1e-product-suite-sccm-2012-support-the-whole-is-greater-than-the-sum-of-its-parts/", "Area": ["ConfigMgr"], "Comments": "", "Content": ["We have had an early adopter program (EAP) in place since May where some notable customers have been putting the beta releases through its paces and providing some valuable feedback as we progress through the various Release Candidates.", "The development journey has been extremely productive and we are excited about the launch of ConfigMgr 2012. We would like to thank the team at Microsoft for allowing us to collaborate so closely. This has enabled us to enhance our solutions alongside them developing their own. Together, we provide greater business value for our customers, the whole is greater than the sum of its parts.", "1E is committed to full ConfigMgr 2012 support 90 days after RTM, this will apply to all 1E products. However, if you are interested in joining the beta program for any of the products please contact the 1E team directly."], "Author": ["Stevan Lukic"], "Date": "2011-11-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/16/utility-providers-will-partially-or-fully-fund-the-costs-of-a-pc-power-management-project/", "Area": ["1E News", "PC Power Management"], "Comments": [{"Comment": "Pingback: New whitepaper: How to claim your energy rebate from your utility provider when implementing a PC Power Management solution | 1E Blogs  Insight and debate on IT Efficiency", "Author": "New whitepaper: How to claim your energy rebate from your utility provider when implementing a PC Power Management solution | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Utility incentive programs fund anything from 25 percent to 70 percent of qualifying efficiency projects or offer cash rebates for customers who install new, energy efficient IT equipment or cooling systems.", ""], "Author": ["Rod Trent"], "Date": "2011-11-16 00:00:00"}, {"Tags": ["crc", "CRC performance league table", "energy efficiency"], "URL": "http://blogs.1e.com/2011/11/15/so-how-did-they-perform-our-customers-and-the-crc-league-table/", "Area": ["Green IT", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["We wanted to see how organizations are getting on with CRC reporting, but more importantly, with reducing their carbon footprints.", "Were pleased to say that we work with 93 of the top 500 organizations in the Performance League Table (PLT)  thats a respectable 19%. Almost half (47%) of that number use our flagship PC power management solution, NightWatchman Enterprise including (in order of CRC performance):"], "Author": ["Karolina Shaw"], "Date": "2011-11-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/14/ensuring-shutdown-of-pcs-is-still-the-easiest-energy-reduction-procedure/", "Area": ["PC Power Management"], "Comments": [{"Comment": "OK  Ive done some sums, and if my desktop PC uses 80 watts and electricity costs 22cents/kilowatt-hour, then my PC costs a bit under 2 cents/hour to leave on.", "Date": "2012-01-11 09:12:00", "Author": "January 11, 2012 at 9:12 am"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-11-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/11/is-fuel-poverty-hitting-the-commercial-sector/", "Area": ["The Green Room"], "Comments": [{"Comment": "Pingback: Is fuel poverty hitting the commercial sector? - 1E Blog", "Author": "Is fuel poverty hitting the commercial sector? - 1E Blog"}], "Content": ["With average energy prices potentially jumping over 100 percent by 2050, European businesses face at least 20 years of electricity price rises, according to a leaked European Commission report on how the region can meet its green energy targets.", "Fuel poverty is said to occur when in order to heat its home to an adequate standard of warmth a household needs to spend more than 10% of its income to maintain an tolerable heating regime. Is the commercial sector now facing the same threat and if so, what can be done about it now?", "On average one sixth (15%) of servers are not doing any useful work", "50% of PCs are not shut down on weekday evenings and weekends  wasting 25 per PC per year", "Im looking forward to reading the European Commissions Energy Roadmap to 2050 when it comes out later this year and to seeing what is agreed in Durban at the COP17 summit in November.", "Incidentally, 31% of the top 50 are 1E customers."], "Author": ["Karolina Shaw"], "Date": "2011-11-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/10/nomad-enterprise-the-undisputed-market-leader-tried-tested/", "Area": ["1E Products", "IT Efficiency", "Nomad", "Server Efficiency"], "Comments": [{"Comment": "Pingback: Nomad Enterprise  the undisputed market leader, Tried & Tested - 1E Blog", "Author": "Nomad Enterprise  the undisputed market leader, Tried & Tested - 1E Blog"}, {"Comment": "Pingback: Key Criteria to consider when Evaluating Nomad Enterprise against other Vendor Products | 1E Blogs  Insight and debate on IT Efficiency", "Author": "Key Criteria to consider when Evaluating Nomad Enterprise against other Vendor Products | 1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Market leader, Nomad Enterprise, part of an IT Efficiency suite from 1E, already installed across more than 3.5 million PCs worldwide, continues to go from strength to strength  this year alone weve won more than 60 deals at some of the largest corporations across the globe. They have bought into this mature, yet simplified systems management solution which revolutionizes software and OS deployments.", "Developed more than eight years ago, Nomad Enterprise is unrivalled in this space. Today it is running successfully in some of the worlds biggest institutions, these include HSBC, AT&T and Verizon Wireless to mention but a few. Parker Hannifin is on record showing that since deploying Nomad, it has eliminated more than 450 servers, saving $2m in the first year alone. Saint Gobain saw a 30-fold reduction in server investment than originally foreseen when they were installing ConfigMgr. Verizon Wireless saw similar success with savings of $9m per year and reduced OS deployment times of 80%.", "This highly efficient solution distributes, updates and manages software with a very high level of reliability and security. It easily manages large computer estates, proof of which is found at some of our very large customers, many of whom have between 100,000 to 400,000 seats. This ability to scale is important for large organizations which had previously suffered bandwidth constraints that hampered the flow of everyday business data when initiating software deployments, patches or OS upgrades. Cost avoidance and reduction are also extremely important considerations, to date, we have saved our customers more than $500million in infrastructure investment because Nomad Enterprise removes the need for branch servers or desk side visits thereby reducing existing server footprint and administrative overhead.", "Our continuous investment in research and development combined with our proactive collaboration with our customers has resulted in todays robust and stable solution. The enhancements in the latest version of Nomad Enterprise has further increased the lead that it has over its rivals. Furthermore our customers are serviced by an experienced support and services team whose expertise makes the implementation of Nomad a smooth ride."], "Author": ["Stevan Lukic"], "Date": "2011-11-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/10/south-africans-outsurance-using-proven-solution-to-save-146000-kwh-of-electricity-per-year/", "Area": ["1E News", "NightWatchman", "PC Power Management"], "Comments": "", "Content": ["Our staff would often not reboot their machines. In some cases, machines had not been rebooted for more than 50 days, which was clearly impacting patching and performance. This was when we realized that enough was enough and we needed to do something, says Simon Faragher, OUTsurance project manager.", "Initially, OUTsurance ran a test on 1,678 machines over a period of 20 days. The solution helped the insurer see that 33% of desktops and 3% of monitors were being left on overnight, wasting energy unnecessarily. It also showed that 29% of desktops and 4% of monitors were being left on, but only 11% of PCs are actually used, during the weekend.", "Tim James, director at sustainableIT, says: Its rewarding to see the deployment of NightWatchman Enterprise help OUTsurance solve its immediate need to improve patch manageability across the organization, save money and positively contribute to its own corporate C02 emissions reductions."], "Author": ["Rod Trent"], "Date": "2011-11-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/09/1e-continues-channel-momentum-by-adding-two-more-north-american-partners/", "Area": ["1E News", "1E Partners"], "Comments": "", "Content": ["IT Efficiency Leader adds MTM Technologies and SyCom to growing roster of partners, further expanding Microsoft System Center services", "NEW YORK, Nov 09, 2011 (BUSINESS WIRE)  1E, the global leader in IT efficiency software, today announced the continued growth of its North American channel partner program, forming new partnerships with MTM Technologies and SyCom.", "The addition of MTM Technologies and SyCom to 1Es North American channel program further validates 1Es commitment to offering customers world-class IT efficiency solutions. Both new partners have extensive expertise within Microsoft System Center services, demonstrating 1Es dedication to reducing the implementation time of joint customers Microsoft projects.", "As one of the largest system integrators in the Northeast, SyCom relies on our partnerships with innovative technology companies to offer our customers world-class solutions to help them get the most out of their data center resources, said Tom Carr, head of sales at SyCom. Our partnership with 1E allows us to leverage our deep expertise in Microsoft implementations and provide software and services solutions that improve IT efficiency by identifying and eliminating waste.", "It is critical that MTM partners with organizations that can help us execute our mission to help our customers deploy IT systems that align with their business objectives, said Jeff Richards, Director, National Microsoft Practice for MTM Technologies. We provide pioneering IT solutions and services for everyone from the Global 2000 to mid-sized businesses, and 1Es expertise with Microsoft System Center is the ideal complement to our focus on enabling our customers to reap all possible strategic benefits from their Microsoft investment.", "1E has focused its North American channel program on building strategic relationships with service providers and resellers, especially Microsoft Gold Certified Partners with a deep understanding of the value of 1Es suite of IT efficiency products. Through 1E University, dedicated technical support and sales enablement and marketing tools, the program provides 1E partners with highly customized tools and resources to help them gain market traction. 1Es online partner portal, to be launched later this year, will provide a comprehensive, intuitive framework for working with 1E and serve as a central navigation point for access to a wide variety of partner resources and tools.", "The addition of SyCom and MTM Technologies to our roster of innovative partners underscores our commitment to offering customers the absolute best in IT efficiency products and also strengthens our presence both nationally in the local markets of Maryland and West Virginia, said Paul Szemerenyi, vice president of North American Channels for 1E. It is a priority for 1E to collaborate with partners who can help us expand further into the growing Microsoft market while also helping joint customers reduce their carbon footprint and address environmental sustainability.", "About MTM", "MTM Technologies is a leading national provider of innovative IT solutions and services to Global 2000 and mid-size companies. Partnered with the top-tier technology providers and with offices from coast to coast, our unique solution-based methodology, combined with our experience and expertise, has enabled thousands of industry-leading organizations to effectively address their business needs, optimize the returns on their IT investments, mitigate risk, and focus on growth and profitability. Additional information is available at http://www.mtm.com .", "About SyCom", "Founded in 1996, SyCom is headquartered in Richmond and has offices in Vienna and Roanoke, and Charleston, W.Va. SyCom Technologies, a Microsoft Gold Virtualization Partner, recently received the Mid Atlantic 2011 Microsoft Cloud Practice Award at Microsoft WPC. The company was honored among the top Microsoft partners for demonstrating excellence in innovation and implementation of customer solutions based on Microsoft technology.", "Our focus is primarily mid-Atlantic with a national delivery capability. With more than $40 million in revenue, we are one of the largest systems integrators on the East coast. Named Best Place to Work in Richmond, we are an employer of choice for some of the best IT talent in the region. SyCom is committed to our mission statement: To provide outstanding and memorable service in everything we do.", "About 1E", "Globally over the past five years $8 trillion has been spent on IT, which is more than half the U.S. GDP. Maintaining this huge amount of IT accounts for 70-80 percent of each years IT budget. CIOs want to reduce this figure to save money or to have more discretionary spend, but lack the tools to do so. 1E is the pioneer and global leader in Efficient IT solutions. 1Es mission is to identify unused IT, help remove it and optimize everything else. 1E solutions help reduce servers, network bandwidth constraints, software license bills, energy consumption and many time consuming IT tasks. Some of worlds most prestigious names feature among 1,400 organizations using 16 million 1E software licenses to reduce their IT maintenance bills while providing a more responsive service to their users. For more information, please visit staging.1e.com ."], "Author": ["Rod Trent"], "Date": "2011-11-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/08/how-can-australian-organizations-prepare-for-carbon-tax/", "Area": ["1E News", "Green IT", "IT Efficiency"], "Comments": "", "Content": ["Thanks in part to its small population, Australia is the developed worlds worst polluter per capita, accounting for 1.5% of the worlds emissions. Its controversial new Clean Energy Act will force the countrys 500 worst-polluting companies to pay a tax on their carbon emissions from 1 July 2012. The Australian government has set the initial price per tonne of carbon at A$23 ($23.80; 14.80), much higher than other similar schemes such as in the EU where the price is between $8.70 and $12.60 a tonne.", "How will businesses prepare for this law?", "Effectively, our customers all did the same thing. They started by looking at their office environment. PCs account for a large percentage of total organizational IT power consumption, and yet at least in 50% are not shut down at the end of the day or over the weekend. Yet there are clear savings to be made  a one night shut down of the worlds 1 billion PCs would save enough energy to power the Empire State Building for 30 years. NightWatchman Enterprise has been licensed across 5.1 million PCs around the world, saving on average 25 per PC per year.", "Simply put, our flagship PC power management solution NightWatchman Enterprise works. The built-in Enterprise View dashboard captures and highlights real energy and efficiency data across all locations, departments, hardware and operating systems.", "As a result of deploying NightWatchman Enterprise from 1E on just 1,000 desktop PCs, City of Melbourne:"], "Author": ["Rod Trent"], "Date": "2011-11-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/08/join-1e-on-google/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Join 1E on Google+ - 1E Blog", "Author": "Join 1E on Google+ - 1E Blog"}], "Content": ["Google has recently opened up product and brand pages on Google+ and we are one of the first companies to take advantage of this. If you are a Google+ member, drop by our Google+ page and add us to your Google+ circles."], "Author": ["Rod Trent"], "Date": "2011-11-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/07/1es-jerry-rutkowski-asks-are-your-servers-running-efficiently/", "Area": ["1E News", "NightWatchman Server", "Server Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: 1Es Jerry Rutkowski asks: Are Your Servers Running Efficiently? - 1E Blog", "Author": "1Es Jerry Rutkowski asks: Are Your Servers Running Efficiently? - 1E Blog"}], "Content": ["As Jerry states:", "You may buy the most energy efficient servers available today but in actuality you may not run them efficiently. Research Server energy and efficiency report, Alliance to Save Energy shows that servers use about 60 percent of their maximum power while doing nothing at all and typically only run at around 15 percent utilization.", "Take a read through Jerrys article to see if there are some areas of efficiency in the datacenter that are still not realized in your organization."], "Author": ["Rod Trent"], "Date": "2011-11-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/07/take-a-look-at-the-new-look-1e-blogs/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Take a look at the new-look 1E blogs - 1E Blog", "Author": "Take a look at the new-look 1E blogs - 1E Blog"}], "Content": ["Were still working through some tweaks, but the primary format and theme are solid. Over the weekend, weve rolled out a new look for our blogs. Let us know what you think!"], "Author": ["Rod Trent"], "Date": "2011-11-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/11/03/1e-at-green-it-expo-2011-good-things-do-come-in-small-packages/", "Area": ["1E News", "Events", "Green IT"], "Comments": "", "Content": ["The 1E team came away from Green IT Expo this year having started a lot of good conversations with prospective customers who are looking to take control of energy management in their datacenters and across their PC and Mac estates.", "", "", "", "", "We also had the satisfaction that\r\n  there was a very excited buzz around stand #27, where 1E pitched up. All in all, this was another successful event for 1E.", ""], "Author": ["Rod Trent"], "Date": "2011-11-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/31/1e-to-showcase-nightwatchman-energy-and-efficiency-management-solutions-at-green-it-expo-in-london/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["PCs and servers account for around 60% of total organizational IT power consumption, and yet:", "1E will also be doing a prize draw to win an iPad 2 on its stand."], "Author": ["Rod Trent"], "Date": "2011-10-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/27/catch-1e-in-this-consider-it-done-webinar-replay/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["With over $8 Trillion in IT expenditures over the last 5 years worldwide, unprecedented, bloated estates of IT hardware, infrastructure and software now exist throughout organizations.", "Check out the webcast:"], "Author": ["Rod Trent"], "Date": "2011-10-27 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/27/the-uptime-institute-is-challenging-you-to-get-rid-of-unused-servers-with-a-contest-1e-can-help-you-win/", "Area": ["1E News", "Data Center", "Server Efficiency"], "Comments": "", "Content": ["", "The Uptime Institute has announced a contest, where the winner is the organization that removes the most servers out of the datacenter. This may be the first of its kind contest, but its a very worthy event to be part of. Two winners will be determined, one for most IT equipment removed, one for largest percentage of IT equipment removed.", "", "Want to win the Uptime Institute contest? Check out NSE:", "http://staging.1e.com/it-efficiency/software/nightwatchman-server-edition-server-power-management/"], "Author": ["Rod Trent"], "Date": "2011-10-27 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/26/1es-mike-terrill-joins-keith-combs-for-a-bytes-by-technet-interview/", "Area": ["1E News", "Nomad"], "Comments": "", "Content": ["Check it out:", "http://technet.microsoft.com/en-us/hh531530.aspx"], "Author": ["Rod Trent"], "Date": "2011-10-26 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/25/1e-coming-to-calgary-october-26th-2011/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["Microsoft Windows 7 is the highest quality Windows release to date, offering many new and enhanced features. But migrating to Windows 7 can impose challenges on any organization, especially in planning, managing and automating the deployment.", "This is where real experience counts. By working with our consultants you can quickly build a cohesive strategy to deploy your new operating system, knowing that you have ensured the compatibility of all your mission critical hardware, desktop applications and data.", "Leverage our knowledgeable and experienced consultants to help you deploy quickly, cost effectively and without disruption. Significantly reduce costs, allowing you to deploy operating systems and software upgrades across the network with zero-touch IT involvement, no branch servers and no site visits. Scale to deploy thousands of PCs a week with the smallest of teams, giving you the benefit of our years of experience in OS deployments. Reduce the hardware, software and staff necessary to manage operating system deployments, while maintaining scalability Enable migrations to occur out-of-hours to limit any impact on user or business productivity.", "Windows 7 Migration Services build on the zero-touch installation capabilities of ConfigMgr OS Deployment and the Deployment Toolkit with innovative software like Nomad Enterprise and WakeUp, extending zero-touch deployment throughout your environment, even to remote branches, without the need for site visits or servers.", ""], "Author": ["Rod Trent"], "Date": "2011-10-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/25/spending-too-much-on-software-licenses-you-dont-really-need/", "Area": ["1E News", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": "", "Content": ["Many asset managers have no idea of the scale of unused software assets lying within their company nor do they have the supporting tools to give them an accurate view.", "Are you one of them? Do you know how much software you have in the organization thats not being used?", "http://staging.1e.com/appclarity/software-license-optimization"], "Author": ["Rod Trent"], "Date": "2011-10-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/25/a-healthy-recipe-for-your-servers/", "Area": ["1E News"], "Comments": "", "Content": ["Servers are organisms that need managing and nurturing properly, otherwise the data center will get peppered with energy hungry boxes that arent doing any useful work. If you dont keep track of your server estate you may find that you are wasting energy (which can never be retrieved) and eating up your budget unnecessarily.", "How do you manage the number of servers you have in the business and how much power they digest? Do you take an educated guess by putting your finger in the air, do you manage them on an excel spreadsheet or do you use a server power management tool that can give you accurate reports, not just on the numbers of servers you possess but their usefulness and value they add to the business?", "Its like this: imagine if a data center was your body, and each pound of weight was a server. What would you do to shed those extra few pounds that make you sluggish and less energetic? Some of those pounds will be fat, inefficient and surplus to requirements yet still in need of nourishment. The same goes for your inefficient servers in the data center, theyll still consume energy, still need cooling and still need maintaining whether or not they are doing useful work.", "Server administrators know there are non-useful servers in the enterprise, whether theyve provisioned the business with a slew of servers that have yet to be operational for a new project or for a project that has been pulled. Its a matter of finding which ones are useful and having visibility of those which are not contributing to the value of the business has been trickier. Its likely that these administrators generally havent given it much thought, opting to add more server capacity as the business grows rather than taking the effort to increase usage of existing assets.", "Using server power management software helps organizations slimdown their presence in data centers with very little physical effort. By identifying where nothing is being gained from the power consumed, administrators can make informed decisions about what to do, whether to decommission assets too old to sensibly repurpose, or recycle for future use."], "Author": ["Andy Hawkins"], "Date": "2011-10-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/24/got-carbon-management-maybe-you-should-rethink-that/", "Area": ["PC Power Management", "Server Power Management"], "Comments": "", "Content": ["Heather Clancy of ZDNet reports today", "", "", "http://staging.1e.com/it-efficiency/software/nightwatchman-enterprise-pc-power-management/"], "Author": ["Rod Trent"], "Date": "2011-10-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/24/mandatory-pc-energy-standards-proposed/", "Area": ["PC Power Management"], "Comments": "", "Content": ["The IDG News service is reporting today that New Zealand is starting to get serious about PC energy conservation.", "The Energy Efficiency and Conservation Authority has begun the formal process of engaging industry on energy-saving standards for personal computer equipment, with a discussion document that suggests mandatory standards that would shut out computers judged inefficient from being imported into or manufactured in New Zealand.", "http://staging.1e.com/it-efficiency/software/nightwatchman-enterprise-pc-power-management/"], "Author": ["Rod Trent"], "Date": "2011-10-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/24/shopping-appclarity-and-virtual-desktop-infrastructure-vdi/", "Area": ["1E News"], "Comments": "", "Content": ["Going through a VDI transition is much like going through an OS migration. Its a great opportunity to get full control of your software distribution and software waste as you move to the new environment. Its a chance for a fresh start. AppClarity enables you to make sure your application portfolio is as clean as possible before you begin to create your virtual images.", "Once you have transitioned to VDI you will achieve ongoing control of software distribution via Shopping. Not only will you enable your users to get the apps they need on demand but you will get an audit trail of who has installed what, when and who authorised it. No more ad-hoc, rogue software on your PCs.", "You probably have a lot of expensive applications deployed in your environment that your users may have installed but are simply not using. AppClarity shows you these. If users do require these premium apps then no problem, Shopping is there and can enable users to install them in a controlled fashion and get access to them within minutes.", "Many of our customers are currently going through an OS migration or transition like this. These projects are often cost heavy in the first 12 months but with Shopping and AppClarity cleaning and controlling the environment they soon deliver signifcant cost reductions. And this doesnt even consider the ongoing cost savings that Shopping can deliver by removing the need to request software through the helpdesk."], "Author": ["Richard Cudd"], "Date": "2011-10-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/24/raising-money-and-awareness-for-the-baaf/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["Adoption and fostering both have the purpose of providing children in care with safe, stable and secure family lives. Many of the children helped by charities such as this one are traumatized and the majority will have experienced abuse or neglect. These children need consistent and skilled parenting to help them to try and recover from the reasons why they came into care. There are some 84,000 children in care in the UK today and nearly 54,000 of those are living in foster families.", "Help today:", "National Adoption Week Awareness"], "Author": ["Rod Trent"], "Date": "2011-10-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/20/close-to-jacksonville-beach-fl-join-us-for-a-casual-dinner/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Close to Jacksonville Beach, FL? Join us for a casual dinner - 1E Blog", "Author": "Close to Jacksonville Beach, FL? Join us for a casual dinner - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-10-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/20/gartners-top-10-it-challenges-and-how-1e-fits/", "Area": ["1E News", "Data Center", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Gartners Top 10 IT Challenges and how 1E fits - 1E Blog", "Author": "Gartners Top 10 IT Challenges and how 1E fits - 1E Blog"}], "Content": ["Immediately, I see 3 different areas where our solutions are already available to meet the challenges that youll face. Ive outlined them here and also given some links of interest for each one based on how weve covered this even recently.", "", "", "3 Simple Steps to Cutting Energy Use & Costs with Green IT", "Significant energy savings without disrupting the work of frontline staff", "PC Power Management  Agent versus Agentless: The Series", "CSC Partners With 1E to Monitor Energy Use", "", "", "", "", "", ""], "Author": ["Rod Trent"], "Date": "2011-10-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/19/data-center-consolidation-and-efficient-it/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Data Center Consolidation and Efficient IT - 1E Blog", "Author": "Data Center Consolidation and Efficient IT - 1E Blog"}], "Content": [], "Author": ["Andy Hawkins"], "Date": "2011-10-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/19/strategies-to-streamline-and-reduce-wastage-in-your-server-estate/", "Area": ["1E News", "1E Products", "IT Efficiency", "NightWatchman Server", "Server Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Strategies to streamline and reduce wastage in your server estate - 1E Blog", "Author": "Strategies to streamline and reduce wastage in your server estate - 1E Blog"}], "Content": ["Heres an excerpt:", "If you virtualize 100 percent of your physical servers today then you will be running more operating system instances than you started with. The physical and environmental footprint has changed but you still need to monitor, patch, secure, backup and license the virtualized servers and now the host servers as well. Requirements such as high availability further increase infrastructure costs. Yet the publicity of energy and space savings has created a mindset that virtualized servers are cheap. Consolidation through virtualization therefore is only a partial answer to becoming more IT efficient.", ""], "Author": ["Rod Trent"], "Date": "2011-10-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/19/1e-sector-highlight-uk-healthcare/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: UK Healthcare - 1E Blog", "Author": "1E sector highlight: UK Healthcare - 1E Blog"}], "Content": ["The UK health sector always faces unrelenting pressure to do more with less. For example, now that the CRC Energy Efficiency Scheme has been introduced to reduce CO2 emissions in the UK, qualifying organizations will have to report on their emissions before beginning to buy carbon dioxide allowances in April 2011. The good news is that by lowering their emissions, any organization can generate extra cash  in addition to benefiting from cheaper energy bills  by trading their allowances to develop an extra income stream.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/uk-healthcare/"], "Author": ["Rod Trent"], "Date": "2011-10-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/19/license-control-and-management-with-shopping-part-1/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: License Control and Management with Shopping (Part 1) - 1E Blog", "Author": "License Control and Management with Shopping (Part 1) - 1E Blog"}], "Content": [], "Author": ["Richard Cudd"], "Date": "2011-10-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/18/1e-sector-highlight-us-healthcare/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: US Healthcare - 1E Blog", "Author": "1E sector highlight: US Healthcare - 1E Blog"}], "Content": ["The healthcare sector in the United States is unique among developed countries in its nearly equal mix of private and public sector programs and in its necessarily diverse response to the very different needs and demands of more than 300 million people.", "Since President Barack Obamas announcement of sweeping healthcare reforms, the pressures to manage costs are more intense than ever on both private and public sector healthcare providers. Several notable healthcare providers are targeting reduction of energy consumption as a quick win, by powering down PCs overnight and by rationalizing or decommissioning inefficient physical and virtual servers.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/us-healthcare/"], "Author": ["Rod Trent"], "Date": "2011-10-18 00:00:00"}, {"Tags": ["IAITAM"], "URL": "http://blogs.1e.com/2011/10/17/1e-at-iaitam/", "Area": ["Events", "IAITAM"], "Comments": [{"Comment": "Pingback: 1E at IAITAM - 1E Blog", "Author": "1E at IAITAM - 1E Blog"}, {"Comment": "This event does look to be very good, hopefully I can attend next year. Is 1E attending in 2014?", "Date": "2014-01-25 09:30:00", "Author": "Terry Green"}, {"Comment": "Hi Terry, we certainly intend to yes! See you there!", "Date": "2014-01-27 06:00:00", "Author": "January 27, 2014 at 6:00 pm"}], "Content": ["IAITAM has been running for 9 years now and is the only event solely dedicated to the advancement of IT Asset Management.", "Heres some quick photos of the event."], "Author": ["Rod Trent"], "Date": "2011-10-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/17/1e-sector-highlight-manufacturing/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: Manufacturing - 1E Blog", "Author": "1E sector highlight: Manufacturing - 1E Blog"}], "Content": ["The manufacturing industry  the powerhouse driving the US economy  has been reeling under the most challenging time in its history. Manufacturers are striving to be more innovative, compete globally, and expand into new markets. Intense pressure to reduce costs and the need to effectively manage a complex supply chain have US manufacturers shifting their production bases and spreading out operations well beyond their home grounds.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/manufacturing/"], "Author": ["Rod Trent"], "Date": "2011-10-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/13/1e-sector-highlight-us-public-sector/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: US Public Sector - 1E Blog", "Author": "1E sector highlight: US Public Sector - 1E Blog"}], "Content": ["On 5th October 2009, President Barack Obama signed Executive Order (EO) 13514, Federal Leadership in Environmental, Energy, and Economic Performance, a broad-based environmental initiative to establish an integrated strategy towards sustainability in the Federal Government which requires Federal agencies to lead by example in creating a clean energy economy. EO13514 expands upon energy reduction and environmental performance requirements of Executive Order (EO) 13423, which obliges Federal agencies to purchase environmentally sustainable products and services under the Environmentally Preferable Purchasing program.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/us-public-sector/"], "Author": ["Rod Trent"], "Date": "2011-10-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/12/1e-sector-highlight-telecommunications/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: Telecommunications - 1E Blog", "Author": "1E sector highlight: Telecommunications - 1E Blog"}], "Content": ["In most sectors of the Telecommunications industry, the impact of the recession has been nothing short of disastrous. Like many other industries, unfavorable economic conditions have forced most Telecommunications businesses to dramatically scale back operations, with a focus on driving down costs and driving up efficiency. Many companies have benefitted from deploying Efficient IT solutions from 1E to make significant cost and energy savings and streamline their operations as well as drive down their CO2 emissions.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/telecommunications/"], "Author": ["Rod Trent"], "Date": "2011-10-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/11/1e-sector-highlight-information-technology/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: Information Technology - 1E Blog", "Author": "1E sector highlight: Information Technology - 1E Blog"}], "Content": ["In most sectors of the IT industry, the impact of the recession has been nothing short of disastrous. Like many other industries, unfavorable economic conditions have forced most IT businesses to dramatically scale back operations, with a focus on driving down costs and driving up efficiency. Many companies have benefitted from deploying Efficient IT solutions from 1E to make significant cost and energy savings and streamline their operations as well as drive down their CO2 emissions.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/it/"], "Author": ["Rod Trent"], "Date": "2011-10-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/10/1e-sector-highlight-construction-infrastructure/", "Area": ["1E Products"], "Comments": [{"Comment": "Construction task machinery that can be effortlessly passed out by Nigerians is opposed to the development of the wealth. A foreign professional must only approach into the UK  country to do The expatriate must come into the UK country at all, there must be clear provisions of the location,", "Date": "2011-10-10 06:23:00", "Author": "construction companies"}, {"Comment": "Pingback: 1E sector highlight: Construction Infrastructure - 1E Blog", "Author": "1E sector highlight: Construction Infrastructure - 1E Blog"}], "Content": ["No industry has been hit harder during the recent recession than construction and infrastructure. Construction companies have had to take a long hard look at where cost savings can be made and where efficiencies can be implemented across all their operations. In IT, deploying PC power management, automating processes distributing software and patches, and enabling users to be able to install the applications and operating systems they need without disruption are just some of the ways that efficiencies and savings can be made. 1E has helped multinational enterprises in this sector to save millions with its Efficient IT solutions.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/construction-infrastructure/"], "Author": ["Rod Trent"], "Date": "2011-10-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/08/welcome-to-our-newly-christened-partners/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Welcome to our newly christened partners - 1E Blog", "Author": "Welcome to our newly christened partners - 1E Blog"}], "Content": ["Our partner program is designed to build the most knowledgeable and most experienced experts in the industry."], "Author": ["Rod Trent"], "Date": "2011-10-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/07/heather-clancy-power-management-could-help-businesses-save-18-6b/", "Area": ["1E News", "1E Products", "NightWatchman Server", "Server Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Heather Clancy: Power management could help businesses save $18.6B - 1E Blog", "Author": "Heather Clancy: Power management could help businesses save $18.6B - 1E Blog"}], "Content": ["In a recent blog post, Heather Clancy of ZDNet, talks about the recent Pike Research report that suggests that businesses can save $18.6B just from power management of PCs and Servers. Heather says:", "When it comes down to it, power management really is about good management of an IT infrastructure. Period. It is just one more factor within all the various factors that an IT organization needs to consider. So maybe one of the reasons that I have heard less about this category lately is because more businesses now consider power management within their broader systems management agenda.", "You can read Heathers full post here:", "http://www.zdnet.com/blog/green/power-management-could-help-businesses-save-186b/19060", "", "Incidentally, Heather starts out her post with", "It has been weeks since one of the power management software companies pinged me with news about a recent mega-customer win", "She needs to ping us more. We always have big wins in helping our customers.", "County government in Fairfax County, Va. uses NightWatchman Server Edition to find servers that are good candidates for consolidation"], "Author": ["Rod Trent"], "Date": "2011-10-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/07/a-sustainable-approach-to-it/", "Area": ["Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: A sustainable approach to IT - 1E Blog", "Author": "A sustainable approach to IT - 1E Blog"}], "Content": ["Sumir Karayi, CEO of IT efficiency specialist 1E, discusses the ways in which businesses can reach a greater level of IT efficiency.", "Before investing in new technologies, however, organisations need to evaluate their existing infrastructure and determine what is actually providing business value or even simply what is being used. Becoming more sustainable can often be achieved by becoming more efficient. For an organisation to reach a greater level of IT efficiency, five primary questions must be addressed:", "http://www.bus-ex.com/article/sustainability-green-it"], "Author": ["Rod Trent"], "Date": "2011-10-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/07/1e-sector-highlight-education/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: Education - 1E Blog", "Author": "1E sector highlight: Education - 1E Blog"}], "Content": ["The recession has deeply affected the Education Sector and many institutions are looking for ways to do more with less. Some have many thousands of PCs running across a campus and need to run them more efficiently as well as deliver software and patches at a time that will not impact their users. In addition, as public institutions, some have Carbon Reduction targets to meet. IT Efficient solutions from 1E give educational institutions control and transparency to their energy consumption, automated patch management and software distribution as well as make significant cost and energy savings.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/education/"], "Author": ["Rod Trent"], "Date": "2011-10-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/06/1e-appclarity-in-real-life-a-great-software-asset-management-tool-that-completes-configuration-manager-2007/", "Area": ["1E Customers", "1E News", "1E Products", "AppClarity"], "Comments": [{"Comment": "Pingback: 1E AppClarity in real life: a great software asset management tool that completes Configuration Manager 2007 - 1E Blog", "Author": "1E AppClarity in real life: a great software asset management tool that completes Configuration Manager 2007 - 1E Blog"}], "Content": ["All in all, AppClarity has saved us tens of hours of work and many headaches by simplifying the uninstall process and providing multiple methods of achieving the desired results.", "1E AppClarity Software Uninstalls", "", "Check out AppClarity:", "http://staging.1e.com/it-efficiency/software/appclarity-software-asset-management/"], "Author": ["Rod Trent"], "Date": "2011-10-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/06/1e-sector-highlight-insurance/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: Insurance - 1E Blog", "Author": "1E sector highlight: Insurance - 1E Blog"}], "Content": ["Over the past few years, the turmoil in the financial markets as well as significant natural catastrophes have affected the insurance industry. From the Queensland floods and the Christchurch earthquake to the devastating effects of the Tsunami in Japan, is it estimated that globally insurance claims may exceed $30 billion.", "Insurers keen to streamline their operating costs are looking where efficiencies can be made throughout their organizations. Efficient IT solutions from 1E have helped its insurance customers to automate the distribution of software, make energy savings and meet their corporate green initiatives, all of which have direct impact on their bottom line.", "Read more:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/insurance/"], "Author": ["Rod Trent"], "Date": "2011-10-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/05/1e-sector-highlight-banking-and-finance/", "Area": ["1E Products"], "Comments": [{"Comment": "Pingback: 1E sector highlight: Banking and Finance - 1E Blog", "Author": "1E sector highlight: Banking and Finance - 1E Blog"}], "Content": ["The past few years have seen extraordinary levels of upheaval across all financial markets and it has yet to calm down. The crisis that began in the sub-prime mortgage market and spread rapidly across the globe has affected markets worldwide. The crisis, and its impact, has brought major changes to business models, business processes and regulation for virtually all financial services companies.", "The banking industry in particular has had to downsize and improve their operating systems to work more efficiently and cost-effectively. 1E has served many financial organizations to reach such objectives through deploying Efficient IT solutions. Not only have they made significant savings and are able to run their IT processes more efficiently, the have also improved their green credentials.", "Read the rest:", "http://staging.1e.com/it-efficiency/solutions/industry-solutions/banking-finance/"], "Author": ["Rod Trent"], "Date": "2011-10-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/04/manage-your-companys-software-assets-without-going-to-school/", "Area": ["1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Manage your company", "Author": "Manage your company"}, {"Comment": "Pingback: Manage your companys software assets without going to school - 1E Blog", "Author": "Manage your companys software assets without going to school - 1E Blog"}], "Content": ["I received an email the other day and even though it was a salesy thing, I held on to it for a bit - more from being shocked and appalled than the email really being valuable. The email was advertising seminars on Microsoft Licensing. These clinics last 2 full days and go over things like: how to choose the correct volume licensing plan for your project, virtualization opportunities and risks, how to spot gaps in licensing compliance, the difference in developer licensing, unique Microsoft discoverability issues, discount basis and tiers, mapping volume licensing programs to IT and financial requirements, and understanding Microsoft roadmaps.", "Yes, Ill admit, Microsoft licensing schemes have changed more times over the years than I have personally changed the oil in my car, and with each iteration they can get more and more confusing. But, do we really need a clinic to understand the rules? Has it come that far? Probably so  and Ill tell you why. Its just easier to sit through and listen to someone who knows how to do it than digging in to learn it yourself. Its why most people rarely do their own taxes and why Microsoft licensing has regularly been compared to government tax codes.", "Uniquely focused on software waste, AppClarity delivers compliance without complexity by filtering out irrelevant data to show just licensable software and organizing it by financial impact or vendor so you can quickly focus on reducing your software spend.", "By making sense of what software you have, why you have it, and where and how it is being used, AppClarity allows you to make informed strategic and operational decisions. For example, setting policies to silently reclaim and reallocate licenses from one user to another if an application has not been used for a set period.", "AppClarity enables your organization to make immediate reductions in software costs by analyzing all your applications and providing you with actionable results, reducing your spend within one month. By identifying the software you actually use, then automatically removing what you dont need, AppClarity financially quantifies all unused software, across all applications and across all machines."], "Author": ["Rod Trent"], "Date": "2011-10-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/04/county-government-in-fairfax-county-va-uses-nightwatchman-server-edition-to-find-servers-that-are-good-candidates-for-consolidation/", "Area": ["1E News", "1E Products", "Data Center", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: County government in Fairfax County, Va. uses NightWatchman Server Edition to find servers that are good candidates for consolidation - 1E Blog", "Author": "County government in Fairfax County, Va. uses NightWatchman Server Edition to find servers that are good candidates for consolidation - 1E Blog"}, {"Comment": "Pingback: Heather Clancy: Power management could help businesses save $18.6B | 1E Blogs", "Author": "Heather Clancy: Power management could help businesses save $18.6B | 1E Blogs"}], "Content": ["Public sector organizations are under pressure not only to be environmentally friendly, but also to control spending. The county government in Fairfax County, Va., launched a server virtualization program in its data center about a year and a half ago, and has thus far reduced its physical servers from 870 to fewer than 300. The ultimate goal is to reduce the number of physical servers to fewer than 50, says Jeff Porter, director of infrastructure for the county.", "To help determine which servers are good candidates for consolidation, the county IT department uses a software product called NightWatchman, from 1E, which measures server workloads and identifies which servers are being underutilized."], "Author": ["Rod Trent"], "Date": "2011-10-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/04/standardizing-energy-reporting/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Standardizing energy reporting - 1E Blog", "Author": "Standardizing energy reporting - 1E Blog"}], "Content": [], "Author": ["Andy Hawkins"], "Date": "2011-10-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/03/1e-ceo-sumir-karayi-speaking-at-the-the-european-sme-week-summit/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1E CEO, Sumir Karayi, speaking at the the European SME Week Summit - 1E Blog", "Author": "1E CEO, Sumir Karayi, speaking at the the European SME Week Summit - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-10-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/03/part-3-getting-software-licensing-under-control/", "Area": ["1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Part 3: Getting software licensing under control - 1E Blog", "Author": "Part 3: Getting software licensing under control - 1E Blog"}], "Content": ["The wrong tools", "Many organizations worry that using traditional Systems Management or Software Asset Management tools is not only time consuming but frequently devoid of any identifiable ROI.", "In most cases, traditional tools focus on compliance and license liability  they tell you how much you have installed versus how much you have licensed  so you can ensure you are compliant in the face of a vendor audit. They almost never tell you where those licenses are, how they could be better deployed or how much money you could save by removing them altogether.", "Unfortunately, even if traditional tools could identify unused software, many of those unused applications wont be packaged in your Systems Management platform to allow automated uninstall. The process to recover unused licenses can become as cumbersome and time-consuming as the process of finding them in the first place.", "Even here, there is a straightforward answer  using an active, user centric software reclaim policy. One that is capable of identifying what software you have and where and how it is being used before helping you to then reclaim and redeploy your applications.", "In short, one that is capable of making a real difference to your business."], "Author": ["Rod Trent"], "Date": "2011-10-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/10/03/the-cloud-creates-even-more-demand-for-1e-nomad-enterprise/", "Area": ["1E Products", "Nomad"], "Comments": "", "Content": ["While the Cloud is a hot topic and companies are considering some form of Cloud involvement in the IT organization, theres still the potential for inefficiencies. One of those inefficiencies is the network itself. With endpoints jumping back and forth between the private and public cloud, the last thing an IT administrator wants to hear, is that the connection is congested.", ""], "Author": ["Rod Trent"], "Date": "2011-10-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/30/part-2-getting-software-licensing-under-control/", "Area": ["1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Part 2: Getting software licensing under control - 1E Blog", "Author": "Part 2: Getting software licensing under control - 1E Blog"}], "Content": ["Too much risk", "One of the most common risk-related concerns is in managing applications that are only used once or twice each year, for example to run an end of year performance report.", "Depending on how the uninstall of licenses is managed, an automated reclaim of unused applications could conceivably result in this software being removed from a users machine, thus leaving them unable to do their job. At a cost of say $400 per year per application, the savings generated by the removal of those applications would seem more than trivial if, when that user next tries to run that report they find the application has been uninstalled without their knowledge.", "With user centric software reclaim strategy these concerns can be managed either by allowing your users to decide what gets reclaimed and what doesnt, or by simply ring fencing named applications so they are never ever removed from the machine."], "Author": ["Rod Trent"], "Date": "2011-09-30 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/29/part-1-getting-software-licensing-under-control/", "Area": ["AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: Part 1: Getting software licensing under control - 1E Blog", "Author": "Part 1: Getting software licensing under control - 1E Blog"}], "Content": ["Negative user reaction", "There are several other ways to allay user concerns. For example, you could provide them with an opt-out mechanism, automating the reclaim of licenses across the enterprise while giving every user a choice as to which applications they get to keep and which get removed.", "You could also offer them the ability to find, select and download applications they need on demand using an enterprise app store. So if, in a few weeks or months time, a user finds that they need access to an application that has been removed, they can reinstall it themselves. Users are less likely to be concerned about the removal of software from their machine if they can get those applications back in a matter of minutes.", ""], "Author": ["Rod Trent"], "Date": "2011-09-29 00:00:00"}]