[{"Tags": ["data center", "green buildings", "greening it", "it efficiency", "pue", "renewable energy"], "URL": "http://blogs.1e.com/2010/10/12/the-data-center-of-the-future/", "Area": ["Data Center", "Green IT", "IT Efficiency", "Server Power Management"], "Comments": "", "Content": ["Despite the fact that the likes of Google and Facebook are seemingly making monthly breakthroughs in data center efficiency, there is going to come a point where we simply cannot go any lower due to the fact that data centers (in most cases) need some sort of infrastructure in addition to the IT equipment. This can range from building management systems, fans and chillers, down to lighting and running water. All of these represent an overhead. The biggest overhead today remains cooling. Regardless of how you are keeping your servers cool; free-air, sea water or old fashioned air conditioners, you still need power to run the cooling system and for the most part, that power comes straight from the grid. Not necessarily for long though.", "University of Arizona physicists have discovered a new way of turning waste heat into electrical power. Using a theoretical model of a molecular thermoelectric device, it may be possible to re-use probably the biggest emission from most data centers today; hot air. According to Justin Bergfield, a doctoral candidate in the UA College of Optical Sciences and lead author of an article in the scientific journal, ACS Nano, Thermoelectricity makes it possible to cleanly convert heat directly into electrical energy in a device with no moving parts,. The technology works in a similar way to how noise-cancelling headphones are able to reduce background noise; a process called quantum interference where two opposing but equal waves cancel each other out. In this case, the way in which the device (a sandwich of two electrodes with a molecular forest filling) works is by encouraging the buildup of voltage between the two electrodes when quantum interference occurs and a heat source is present.", "The technology is currently only in the theoretical stage but has the potential to increase efficiency across a wide-range of applications including manufacturing and automotive. It also represents a real opportunity to dramatically increase the efficiency of data centers where these devices would be used to capture the hot exhaust from the servers and covert it to energy to power the IT load. This could be exploited to a point where a data center could exist off the grid or even further where it is able to provide energy back to the grid which would be especially beneficial in particularly power stretched areas such as New York City which are running over capacity.", "Clearly at this point, the technology is largely a pipe-dream but it is extremely encouraging to see that research such as this provides us real hope for the future"], "Author": ["Andy Dominey"], "Date": "2010-10-12 00:00:00"}, {"Tags": ["1e", "events", "patch management", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2010/10/12/come-find-us-at-these-upcoming-1e-events/", "Area": ["1E News", "1E Products", "Data Center", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management", "Shopping"], "Comments": "", "Content": ["1E believes that connecting with customers and community is a top priority. For this reason, you'll see 1E participating at major events around the world. If you are planning to attend any of the following events, please stop by and say \"Hello\". We're always grateful to meet and chat with our customers and also those interested in our industry solutions and products.", "The Data Center Efficiency Summit is a one day forum that focuses on best practices and emerging technologies/applications that reduce data center costs and significantly increase efficiencies for both legacy and new construction.", "", "", "", "", "", "", "Although the global recession has squeezed IT budgets, hindered capital expenditure and slowed IT development, Green IT strategies and solutions have gained a significant upside during the economic downturn.", "", "", "TechEd Europe is Microsofts premier technical education event providing the most comprehensive technical training on Microsofts suite of products, technologies, solutions and services. If you are a technology professional involved in building, deploying or maintaining IT solutions using Microsoft technologies, TechEd Europe is the conference that will help you solve today's real-world challenges and prepare you for tomorrow's innovations.", "For more information and registration please visit:", "", "", "For updates on more 1E Events, keep tabs on the following page:"], "Author": ["Rod Trent"], "Date": "2010-10-12 00:00:00"}, {"Tags": ["1e", "shopping"], "URL": "http://blogs.1e.com/2010/10/07/computerweekly-gives-four-ways-to-read-about-1es-shopping/", "Area": ["1E News", "IT Efficiency", "Shopping"], "Comments": "", "Content": ["This white paper sets out the 1E view of user empowerment in the organisation, together with how and why we think innovative companies are deploying user-empowerment solutions to drive down costs, drive up productivity and encourage their users to become more self sufficient in the face of the rising consumerisation of IT.", "This white paper sets out the 1E view of how organizations can blend the benefits of both centralised and decentralised approaches to IT management, resulting in reduced costs, greater business agility and happier, more motivated users", "This white paper sets out the 1E view of how organizations could evolve software rental models for their end users using just-in-time downloads to provide users with access to the applications they need, when they need them, driving down costs while also driving up productivity.", "This white paper sets out the 1E view of how organisations could dramatically reduce help desk costs and increase the value that the IT help desk delivers to the business by empowering end users to search for, find and download the applications they need, when they need them."], "Author": ["Rod Trent"], "Date": "2010-10-07 00:00:00"}, {"Tags": ["energy management", "green it"], "URL": "http://blogs.1e.com/2010/10/05/uk-teenager-shows-the-uk-government-how-to-monitor-energy-usage/", "Area": ["Green IT", "IT Efficiency"], "Comments": "", "Content": ["Words arecheap in politics, but when you have a talented 16 year old like Isobell Long looking over your shoulder, you'd better mean what you say Mr C!"], "Author": ["Phil Wilcock"], "Date": "2010-10-05 00:00:00"}, {"Tags": ["crc", "green it"], "URL": "http://blogs.1e.com/2010/10/05/uk-crc-registration-deadline-has-passed-so-what-now/", "Area": ["Green IT", "IT Efficiency", "PC Power Management"], "Comments": "", "Content": ["Last week there was a flurry of activity this side of the pond as companies scrambled to register for the UK's CRC scheme before the deadline of September 30. Or should I say 'some' companies seem to have scrambled while others stood around looking slightly confused and some just ignored it completely. So what happens now?", "Well firstly, the UK Environment Agency has published its list of participants as promised, so you can go and have a snoop around to see if your competitors are in there. There are 12112 registered companies in there, but only 2778 full participanys the Agency did expect more, about 20,000 declared companies and 5000 full participants, but as the companies that have registered account for about 90% of electricity usage expected to be covered by the scheme it's not looking too bad.", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-10-05 00:00:00"}, {"Tags": ["data center", "energy star", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/10/01/energy-star-says-out-with-the-old-in-with-the-new/", "Area": ["1E Products", "Data Center", "Green IT", "IT Efficiency", "Server Power Management"], "Comments": "", "Content": ["In some tests, the older hardware and Operating System used as much as 54% more energy than the newer system. This energy saving doesn't sacrifice performance however  at 50% utilization, the newer Energy Star serverandWindows Server 2008 R2handled over three times the work, which in turn can help to reducethe number of systems needed to support a given workload.", "And cost? Of course we all want to know how this effects the bottom line, and according to Energy Star the savings over a server lifetime can be between $480 and $1440", "Of course, here at 1E we always believe that you can go that bit further. Although these Energy Star test results are great, and demonstrate that there are super savings to be made by upgrading hardware and software, it doesn't tackle what happens when the server is deployed in the rack in the real world.", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-10-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/27/techcrunch-coverage-1es-ceo-sumir-karayi-on-google-instant/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["Sumir adds his experttake onGoogle's new \"Google Instant\" in a recent TechCrunch article.", "\"Google Instant is incredibly sensible. With it, he says Google is addressing one of the biggest areas of waste in IT, the amount of time PC users, and IT professionals waste on doing things that are not required and that can be automated. If you can save a few minutes or milliseconds, cumulatively, that amounts to a huge number of work minutes, even if these are not directly energy-saving or easily quantifiable.", "Read the entire article on TechCrunch:"], "Author": ["Rod Trent"], "Date": "2010-09-27 00:00:00"}, {"Tags": ["1e", "1e wakeup", "dell", "drowsy", "drowsy server", "green it", "nightwatchman", "nightwatchman server", "nomad enterprise", "patch management", "pc power management", "server power management", "shopping"], "URL": "http://blogs.1e.com/2010/09/27/1e-on-the-delltechcenter/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management", "Shopping"], "Comments": [{"Comment": "Pingback: 1Es 2010 Blog Year in Review | 1E Blogs", "Author": "1Es 2010 Blog Year in Review | 1E Blogs"}], "Content": [], "Author": ["Rod Trent"], "Date": "2010-09-27 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/27/1es-shopping-3-2-launch-replay-is-now-available/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency", "Shopping"], "Comments": [{"Comment": "Take 120 mg of Ginkgo Biloba, twice per day. Ginkgo bilobo increases blood flow to the genitals, helping to treat erectile dysfunction. She Chuang Zi (Cnidium Monnier), in particular is highly beneficial in the natural treatment of Erectile Dysfunction as it helps to relax muscles, increases blood flow and increases the level of hormones thereby improving erection and preventing premature ejaculation.   Propecia Online OCs have been more thoroughly studied than any other medication in history and have been found to be safe for the majority of women.", "Date": "2011-05-06 09:43:00", "Author": "PropeciaDRrx"}], "Content": ["I know from emails thata large numberof you were unable to attend the Shopping version 3.2 launch Webinar recently, and have been waiting for a replay link. Well, that link is now available and you can watch the Webinar in it's entirety using the following:"], "Author": ["Rod Trent"], "Date": "2010-09-27 00:00:00"}, {"Tags": ["1e", "1e wakeup", "nightwatchman", "r3"], "URL": "http://blogs.1e.com/2010/09/24/new-1e-youtube-channel-video-jeff-wettlaufer-and-david-lippa-on-nightwatchman-and-system-center/", "Area": ["1E News", "1E Products", "Green IT", "IT Efficiency"], "Comments": "", "Content": ["In this video Jeff Wettlaufer, Sr. Technical Product Manager for System Center, speaks with Dave Lippa, Solution Engineer for 1E. Jeff and Dave talk about the best-of-breed extensions delivered by the 1E \"Nighwatchman\" technology for System Center Configuration Manager 2007 R3."], "Author": ["Rod Trent"], "Date": "2010-09-24 00:00:00"}, {"Tags": ["crc. nightwatchman", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2010/09/24/last-chance-saloon-for-uk-crc-registrations/", "Area": ["Data Center", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Could the Carbon Reduction Commitment Close UK Data Centers? | 1E Blogs", "Author": "Could the Carbon Reduction Commitment Close UK Data Centers? | 1E Blogs"}], "Content": ["I know it's a Friday and most people will be idly counting down the hours until the weekend, but there's a deadline approaching.", "The fine is only 5,000, which is obviously small change to some of the companies being targeted, but the real 'punishment' lies in the PR disaster that will ensue once you are named and shamed as a non-caring, Carbon belching tree killer. And you will be shamed (there is to be a published league table).", "In case you've been living under a rock for the past couple of years, here's how it works.Any UK business that uses more than 6,000 MWh (megawatt-hours) of electricity with half-hourly metering will have to buy CO2 allowances. Companies are required to monitor all emissions and complete an annual report. It is expected that around 20,000 companies will need to make information disclosures to see if they need to participate, with 5,000 companies expected to be included in the scheme."], "Author": ["Phil Wilcock"], "Date": "2010-09-24 00:00:00"}, {"Tags": ["1e", "green it", "it efficiency", "lean it"], "URL": "http://blogs.1e.com/2010/09/23/green-it-for-tree-huggers-only-lean-it-is-for-everyone/", "Area": ["Green IT", "IT Efficiency"], "Comments": "", "Content": ["Green and sustainable IT is becoming increasingly important for businesses but some organisations still view it as a hippie craze, according to IDC Asia-Pacific research director, Phil Carter. At HPs Eco Solutions Awards ceremony, Carter brought up statistics from IDCs recent Green IT survey of over 200 IT executives and large organisations. Cost of energy remains a primary driver for adoption of Green IT solutions with 61 per cent of respondents confirming this.", "It seems that Green IT (Or Sustainability to give it a more sensible name), is emerging but is still not at the core of what companies do.", "I must say I groaned a little when the term Green IT first started to appear, as I knew right away that all of the negative 'tree hugger' and 'eco-hippy' trivialism would immediately be associated. But it was inevitable really. Any phraseincluding the word 'Green' is asking for it!", "As the above article states, the underlying reasons for adopting so called Green IT strategies and projects remains the same. Cost. Energy cost in particular is the main focus for such projects, but also there's a general desire these days to simply run your IT more efficiently, and why not?", "Here's the bottom line. People have been striving to deliver great IT services as long as IT has been around. So I do thing that tags such as Green IT will come and go, and I'd like to think that this overt effort to be 'seen to be Green' will become second nature, like breathing. We need that to happen if our kids stand a chance of inheriting a planet in a reasonable state!", "So to get things straight, lets just agree. Green IT isn't just for tree huggers, it'sthe natural way to do business. No more misleading labels please."], "Author": ["Phil Wilcock"], "Date": "2010-09-23 00:00:00"}, {"Tags": ["1e", "nightwatchman", "wakeup"], "URL": "http://blogs.1e.com/2010/09/23/jeff-wettlaufer-sr-technical-product-manager-for-system-center-and-extending-system-center-with-1e/", "Area": ["1E Products", "Green IT", "IT Efficiency", "PC Power Management"], "Comments": "", "Content": ["In this video Jeff Wettlaufer, Sr. Technical Product Manager for System Center speaks with Dave Lippa, Solution Engineer for 1E. Jeff and Dave talk about the extensions delivered by the 1E Nighwatchman technology for System Center Configuration Manager 2007 R3 and the new Power Management capabilities.", "LINK:"], "Author": ["Rod Trent"], "Date": "2010-09-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/23/new-whitepaper-nomad-enterprise-wan-caching-appliances/", "Area": ["1E Products", "Green IT", "IT Efficiency"], "Comments": "", "Content": ["Typically people would look at WAN optimization technology to address specific issues, for example a mission critical application that is suffering from network performance latency. In this instance, an organization could choose to spend money on upgrading their WAN link or to buy a WAN optimization appliance to make the link work smarter. What may be happening however is that performance is suffering because the link is being flooded when software deployments are taking place, and it is this area that Nomad Branch has been specifically designed to address.", "While WAN Caching appliances address overall network performance, Nomad specifically addresses WAN optimization in a SMS/ConfigMgr environment. In organizations where large amounts of data are flowing across sites due to software distributions and other miscelleaneous SMS/ConfigMgr services and tasks,Nomad can save you the cost and time of putting up a Distribution Point in branch offices.", "The most important thing to take from this document is that Nomad Enterprise and WAN Caching Appliances cannot and should not be compared on a like for like basis. They were designed to do different tasks and the features and benefits they provide are appropriate to each task. However, if you rely on SMS or ConfigMgr in your company,Nomad Enterprise is your best bet.", "Download and read the Whitepaper:"], "Author": ["Rod Trent"], "Date": "2010-09-23 00:00:00"}, {"Tags": ["1e", "1e wakeup", "nightwatchman", "nightwatchman server", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2010/09/20/mandated-co2-reporting-are-you-ready/", "Area": ["1E Products", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["One key statement in the article, says:", "\"for many companies counting and reducing emissions will soon cease to be a voluntarily action but something mandated by legislation or required by customer and shareholder pressure. The world is changing.\"", "With legislation pending, it's smart to start preparing now to be able to accurately report on CO2 emissions, and implement mechanisms that allow companies to manage power and reduce CO2 emissions.", "With over 10 years of experience and development, 1E provides software that can help you prepare fortoday's industry changes.Don't be blind-sided. Start planning today. 1E's products give companies complete control over PC and Server power management whilepromoting a world where IT is efficient, smart, and cost effective."], "Author": ["Rod Trent"], "Date": "2010-09-20 00:00:00"}, {"Tags": ["applications on demand", "helpdesk", "self service", "service desk", "shopping"], "URL": "http://blogs.1e.com/2010/09/20/how-syngenta-saves-1-7m-per-year-with-shopping/", "Area": ["IT Efficiency", "Shopping"], "Comments": "", "Content": ["1E initially worked with Syngenta to reduce the number of software requests that were being handled by the central admin team.", "Having used Shopping for some time now, user know where to go for their software. Each user has a link to Shopping on their start menu, and all users are well versed in using the platform to download new and existing applications.", ""], "Author": ["Phil Wilcock"], "Date": "2010-09-20 00:00:00"}, {"Tags": ["carbon reduction", "data center", "energy efficiency", "green buildings", "nightwatchman server edition"], "URL": "http://blogs.1e.com/2010/09/17/how-low-can-you-go/", "Area": ["Data Center", "Green IT", "IT Efficiency"], "Comments": "", "Content": ["Google has long been a proponent of energy efficiency and carbon reduction and it has recently announced plans to take that even further. Google currently maintains an average PUE of less than 1.2 across it's facilities; meaning that for every Watt of power that is required to run the IT load, only 0.2 of a Watt is allocated to cooling and building infrastructure. This is an extremely low PUE and demonstrates just what can be achieved when utilizing the latest in energy efficiency technology and strategies.", "However, despite how impressive this may be, Google believes that a PUE of 1.1 is achievable in some of their facilities. How, one may ask, is such efficiency possible? Well actually, its a combination of factors including smart design, use of the latest and most efficient technology and also location of the facility itself enabling the designers to take advantage of local resources; in Googles case, the Baltic Sea.", "In addition to using free-air cooling, Google aims to minimize the amount of fresh water directly consumed by their facilities. Some of their data centers are already using 100% recycled water and the remainder use less than 20% fresh water. Utilizing sea water for cooling is actually, in my opinion,a stroke of genius. Google calculated that it is far more efficient and responsible to take dirty sea water and clean it just enough to be effectively used for cooling instead of wasting fresh water.Granted, you wouldnt want to drinkthis water but that doesnt matter when all its doing is circulating through a cooling system. In locations such as the facility near the Baltic Sea, this water can be pumped in, cleaned and cycled through the cooling system 12 months of the year significantly reducing (and in some cases eliminating) the need for traditional air conditioners.", "In addition, Google also has a very responsible approach to replacing old machines but re-purposing wherever possible. In fact, they claim to re-purpose 68% of their server hardware. Server re-purposing and reallocation remains one of the most effective ways to reduce cost and limit carbon footprint by doing more with what you have. This not only reduces the demand on cooling, bringing down your PUE, but there are significant savings to be made from limiting the hardware and licenses required to run your business. Identification of servers for re-purposing can be difficult and something of a 'hit and hope' approach for most organizations. Fortunately, 1E can help. NightWatchman Server Edition identifies unused servers and helps you to make these decisions easily and with confidence.", "Like 1E, Google has always been a pioneer in terms of energy efficiency and Im looking forward to watching them continue to get closer and closer to a PUE of 1.0Just how low can they go??"], "Author": ["Andy Dominey"], "Date": "2010-09-17 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/16/what-can-shopping-3-2-actually-do-for-you/", "Area": ["1E Products", "Green IT", "IT Efficiency", "Shopping"], "Comments": "", "Content": ["With our release of Shopping version3.2 comes a few questions  particularly from the IT crowd. Most people understand that Shopping is a centralized mechanism for deploying applications, but Shopping actually goes even further than that. Understanding the overall cost savings that Shopping provides is dependent on the organization itself, and how deeply integrated Shopping is into the company's processes. Our case studies provide a great way to determine how much our customers are saving in time and money and you can then apply their examples to your situation:", "But, to get right down to it, nothinghelps to understand better,exactly what can be done using Shopping, than examples. The way Shopping is architected the question shouldactually be \"What can Shopping NOT do?\" because Shopping really is an application that can be fully customized to the customers's needs, processes, and requirements. But, the answer to that question is too all encompassing. So simplify it, here's a few quick examples. See if any of these are something that would provide extreme value to you and your organization.", "Shopping can help with:", "The ability of Shopping is limitless and only hampered by your creativity!", "Find out what Shopping can do for you. A full 30 day evaluation license is available for download:", "Have a question about a specific task that your are curious if Shopping can help you with? Drop us a comment here and we'll post back the answer."], "Author": ["Rod Trent"], "Date": "2010-09-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/16/top-ways-to-connect-with-1e/", "Area": ["1E News", "1E Products", "Data Center", "Green IT", "IT Efficiency", "PC Power Management", "Server Power Management", "Shopping"], "Comments": "", "Content": ["There are a lot of waysto connect with 1E to learn about our company, our products, and our ability to turn your IT into a highly efficient, adaptive, and cost savings organization.", "Choose the one (or many) that is right for you:", "P.S. There are some additional options coming soon. Keep an eye out here for the announcement."], "Author": ["Rod Trent"], "Date": "2010-09-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/15/financial-times-powerful-argument-for-cutting-it-energy-consumption/", "Area": ["1E News", "Green IT", "IT Efficiency"], "Comments": "", "Content": ["1E CEO Sumir Karayi comments:", "The information technology industry accounts for about 2 per cent of global carbon dioxide emissions  about the same as the airline industry. Although the technology is increasingly power-efficient, more innovation and design are required to offset the growing use of computers, especially in China and India.", "The focus on innovation has led to a host of developments, through green ideas and exotic new equipment, says Sumir Karayi, chief executive of 1E, a power management software vendor that claims to have cumulatively saved its customers 4m metric tonnes of carbon dioxide emissions.", "He adds: It has also sparked the redesign of technology and the revival of old ideas that have gained a new relevance to reduce resource use and cut greenhouse gas emissions.", "", "Read the full post here:"], "Author": ["Rod Trent"], "Date": "2010-09-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/15/itbusinessedge-how-self-service-applications-can-save-the-it-department/", "Area": ["1E News", "Green IT", "IT Efficiency", "Shopping"], "Comments": "", "Content": ["Here's a greatbit of informationfrom the post by our own Richard Cudd:", "\"According to Richard Cudd, product manager for 1E, the adoption of self-service application platforms such as Shopping from 1E will not only improve the perception of the internal IT department, it also frees up IT personnel to work on projects that add more value to the business.\"", "Read the full post:"], "Author": ["Rod Trent"], "Date": "2010-09-15 00:00:00"}, {"Tags": ["1e", "shopping"], "URL": "http://blogs.1e.com/2010/09/14/itbusinessedge-the-crying-need-for-self-service-it/", "Area": ["1E News", "IT Efficiency", "Shopping"], "Comments": "", "Content": ["Visit the web page when you get a chance, and feel free to comment here about the results."], "Author": ["Rod Trent"], "Date": "2010-09-14 00:00:00"}, {"Tags": ["1e", "shopping"], "URL": "http://blogs.1e.com/2010/09/14/network-world-let-your-users-go-shopping-for-apps/", "Area": ["1E Products", "IT Efficiency", "Shopping"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2010-09-14 00:00:00"}, {"Tags": ["applications on demand", "helpdesk", "self service", "service desk", "shopping"], "URL": "http://blogs.1e.com/2010/09/10/new-study-into-it-help-desk-efficiency-shows-users-being-badly-let-down/", "Area": ["1E News", "1E Products", "Shopping"], "Comments": "", "Content": ["A new study into IT help desk efficiency and user attitudes towards self-service software provisioning in the United States and the United Kingdom revealed that more than half (52 percent) of employees wait up to a week or more for the software they need  40 percent have to chase their initial request and 15 percent reportedly never get it.", "The research polled 1,000 US and UK based professionals from medium to large organisations (500-3,000 employees) from a broad range of departments including senior and middle management, sales, marketing and operations. Conducted in August 2010 by Vanson Bourne, the study was commissioned by 1E, a software and services company that improves IT efficiency by identifying and reducing costs and waste in hardware, software, energy and time.", "The key findings from the study are:", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-09-10 00:00:00"}, {"Tags": ["applications on demand", "helpdesk", "self service", "service desk", "shopping"], "URL": "http://blogs.1e.com/2010/09/09/releasedshopping-3-2-delivers-rapid-cost-reductions-and-real-roi/", "Area": ["1E News", "1E Products", "Shopping"], "Comments": "", "Content": ["To register for a webinar about Shopping on 14th or 16th September, please visit:"], "Author": ["Phil Wilcock"], "Date": "2010-09-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/09/09/it-efficiency-the-professional-community/", "Area": ["1E News", "Green IT"], "Comments": "", "Content": ["1E is taking part in building a professional community around developing a better, smarter, and more agile IT business. We are participating in a new LinkedIn professional group that serves to provide communication and interaction between participants to create a repository of ideas, choices, and discussion on how to improve the efficiency of IT in any organization. The goal is to bring together the best minds to develop a consistent messageabout how to integratethe processes, techniques, methodologies, and technologiesto make \"IT Efficiency\" a real and tangible business perspective.", "There are a number of members already, but we invite you to join the LinkedIn group and share your comments and ideas.", "You can use the following link to join:", ""], "Author": ["Rod Trent"], "Date": "2010-09-09 00:00:00"}, {"Tags": ["applications on demand", "helpdesk", "self service", "service desk", "shopping"], "URL": "http://blogs.1e.com/2010/09/08/i-am-not-a-number-empowering-users-with-self-service-solutions/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: Tweets that mention I Am Not A Number! Empowering Users with Self Service Solutions | 1E Blogs -- Topsy.com", "Author": "Tweets that mention I Am Not A Number! Empowering Users with Self Service Solutions | 1E Blogs -- Topsy.com"}], "Content": ["It's all about giving users more of a say in what kind of service they receive from their IT department. Back in the bad old days, I remember sitting in meetings between the IT department and user group representatives which were little more than slanging matches. The general perception was that 'users' didn't understand IT and must therefore be spoon fed and treated like the stroppy children they were. Users on the other hand viewed IT as the Evil Empire to be defeated and outwitted at every turn wherever possible."], "Author": ["Phil Wilcock"], "Date": "2010-09-08 00:00:00"}, {"Tags": ["application compatability", "os deployment", "windows 7", "Windows XP Danger Zone", "Windows XP Migration"], "URL": "http://blogs.1e.com/2010/09/08/windows-7-deployment-the-1e-way-part-3-the-perfect-match-2/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration"], "Comments": [{"Comment": "Pingback: Windows 7 Deployment the 1E way - Part 1: Introduction | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way - Part 1: Introduction | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Windows 7 Deployment the 1E way  Part 2: Tools for the job | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way  Part 2: Tools for the job | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["In many industry surveys, most IT Organizations quote application compatibility concerns as their number 1 blocker to being able to start mass-migration projects. This is a genuine concern, and for most organizations will be a significant component of the overall work, but fortunately there are a number of tools that help identify, remediate and manage the process, most importantly the set of tools that compose the Microsoft Application Compatibility Toolkit (ACT). The latest version on the Microsoft download site is version 5.6ACT itself is a full suite of tools and utilities, a database and a processing service that compose a management system for identifying and remediating application compatibility issues for an organizations current application portfolio. Its extent and complexity can be somewhat daunting, but the Microsoft download link also contains comprehensive documentation, installation and planning documentation and detailed how-to tutorials for deploying and using the tools. The purpose of this blog is not to replace the detailed documentation, but to provide an overview and introduction of what the major components do and how an IT Organization would use them to manage and remediate Application Compatibility problems as part of a wider Windows 7 deployment Project.", "The core of ACM is a database of application instances (and also Hardware Devices) that is derived from both a Microsoft maintained repository and via local inventory and update. The screenshot below shows one of the Quick Report views from the Analysis section of ACM showing applications that have been either already assessed or approved as Windows 7 compatible and those that have known issues or detected problems.", "Especially for the largest enterprise environments, linking the ACT database and application assessment status, with the detailed client software and Hardware inventory information from SCCM, provides the final piece of the jigsaw to complete information and confidence of what impact on the desktop estate a migration to Windows 7 would truly entail.Having the right information and a complete impact assessment at the start is essential to limiting later surprises in any project, especially an organization wide OS migration. Hopefully this introduction and deeper experimentation with full suite of ACT tools can at least get you a good head-start.", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Peter Murray"], "Date": "2010-09-08 00:00:00"}, {"Tags": ["case study", "csc", "customer", "drowsy server", "green it", "nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/09/07/part-7-csc-on-power-management-with-nightwatchman-server-edition/", "Area": ["1E Customers", "1E News", "1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["To ensure that the tool capabilities were fully leveraged during the pilot, we decided to verify that the remaining servers onthe pilot had this functionality before allowing them to participate. Where necessary, we refused older servers, including only servers that could be power managed. Our end result would be 28% of our pilot was on servers that would allow power management  much more within the industry normal range.", "Server report: On one of our fairly well used servers, there was an opportunity for energy savings (primarily on weekends), taking advantage of the power management functionality of NightWatchman Server Edition."], "Author": ["customer spotlight bloggers"], "Date": "2010-09-07 00:00:00"}, {"Tags": ["applications on demand", "helpdesk", "self service", "service desk", "shopping"], "URL": "http://blogs.1e.com/2010/09/07/webinar-self-service-software-delivery-with-1e-and-shopping-3-2/", "Area": ["1E News", "1E Products"], "Comments": "", "Content": ["1E Product Manager Richard Cudd will guide you thru this latest release, and will explain how real 1E customers such as UNUM and Syngenta use Shopping to save money while improving user service levels."], "Author": ["Phil Wilcock"], "Date": "2010-09-07 00:00:00"}, {"Tags": ["nightwatchman server edition", "virtual sprawl", "virtual stall", "virtualization"], "URL": "http://blogs.1e.com/2010/09/06/potential-for-virtual-sprawl-is-greater-now-than-ever/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["So what does this mean in general terms? Well one thing is for certain. Where the uptake of virtual servers increases, so does the potential for Virtual Sprawl.", "At 10 VM's per physical host that means about 80-100 million virtual machines are being created per year or 273,972 per day or 11,375 per hour.", "Aside from possibly buying up as many shares in VMWare as you can afford, this is actually quite scary stuff from a management point of view. All of these servers MUST be managed if we are to keep any control over costs and energy usage.", "You can track it's energy use (and possibly charge high energy using customers a premium)", "You can make sure that it is still being used on an ongoing basis", "In a Cloud Computing environment this type of monitoring is vital as customers will potentially purchase Virtual Server capability 'on the fly' for maybe a couple of weeks to facilitate a new project and then stop using it. With NWSE you can easily report on servers that are no longer being used and tidy up on a regular basis. If VMs continue to run after theyre no longer required, the initial savings gained from virtualization will be lost with increased costs from power, cooling, licensing and management.", "The combination of the growing market for Cloud Computing services and ease with which Virtual Servers can be deployed is a heady mix. It reminds me a little of the dot-com boom, only a thousand times bigger! If we want to avoid the same type of boom and bust scenario I think care is needed when planning and managing your servers, physical or virtual.", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-09-06 00:00:00"}, {"Tags": ["applications on demand", "helpdesk", "self service", "service desk", "shopping"], "URL": "http://blogs.1e.com/2010/09/02/putting-your-users-in-charge-could-save-you-millions/", "Area": ["1E Products"], "Comments": "", "Content": ["According to Gartner's recent IT Key Metrics: IT Spending and Staffing Report 2010, IT organizations spent 7% of their operating budgets on IT service desks in 2009.That's just the helpdesk folks, and it's a hefty chunk of budget in these cost conscious times.", "You would think that as technology advances, the task of servicing users would get easier right? Wrong. The problem lies in complexity. Think of the vast array of devices that users now have access to, and the increasing number and sophistication of aplications. Some are web based, some are iPhone apps and so on. Corporate IT is becoming a victim of it's own success.", "The value of the Helpdesk is in helping users to do their job effectively. But as user become more IT aware, Helpdesk staff need to become better at dealing with more complex issues and pre-empting problems before they happen. It's catch 22 in effect, and the end result is that calls to the service desk remain around the same level."], "Author": ["Phil Wilcock"], "Date": "2010-09-02 00:00:00"}, {"Tags": ["1e", "1e wakeup", "nightwatchman", "nightwatchman server", "pc power management"], "URL": "http://blogs.1e.com/2010/09/01/power-it-down-day-did-it-work-2/", "Area": ["1E Products", "Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["", "But, did it work?", "", "", "", "", "Over 17,500 people signed up, but how many of those actually shut down their computer like they said they would?", "", "", "", "", "Did the message stick?", "Prepare for Power IT Down day 2011", "Industry reports"], "Author": ["Rod Trent"], "Date": "2010-09-01 00:00:00"}, {"Tags": ["nightwatchman", "pc power management", "windows power management"], "URL": "http://blogs.1e.com/2010/09/01/theres-no-such-thing-as-a-no-cost-power-management-solution/", "Area": ["1E Products", "Green IT", "PC Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-09-01 00:00:00"}, {"Tags": ["interop", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2010/08/31/revisit-your-green-it-goals-with-1e-at-interop-new-york/", "Area": ["1E News", "1E Products", "Green IT", "PC Power Management"], "Comments": "", "Content": ["As media attention seems to have switched to the Data Center (PC Power Management? Oh that's soooo last year darling) and beyond, the energy savings that can be achieved from desktops and laptops are often overlooked. So if you're new to the heady world of Green IT, or just looking to revisit your options, here's a quick PC Power Management Primer.", "You can easily get a rough idea of the savings available by auditing your PC population using your management suite of choice. You can check which makes and models are capable of advanced Power Management techniques on the Energy Star website, or just ask your PC vendor. Also, talk to the various departments in your organisation and get them onboard. Life is much easier if everyone is behind your goals!"], "Author": ["Phil Wilcock"], "Date": "2010-08-31 00:00:00"}, {"Tags": ["applications on demand", "license management", "shopping", "software rental"], "URL": "http://blogs.1e.com/2010/08/27/stopping-the-yo-yo-with-some-decentralized-centralization/", "Area": ["1E Products", "Green IT"], "Comments": "", "Content": ["In another thoughtful and timely paper, Richard Cudd examines both centralized and decentralized IT models and the pros and cons of each. As companies tend to yo-yo between trends of both centralization and distribution of IT roles and responsibilities, the effects can be detrimental as control is lost."], "Author": ["Phil Wilcock"], "Date": "2010-08-27 00:00:00"}, {"Tags": ["1e", "shopping"], "URL": "http://blogs.1e.com/2010/08/27/park-hill-school-district-empowers-users-by-integrating-1es-shopping-application-with-sccm-2/", "Area": ["1E Customers", "1E News"], "Comments": "", "Content": ["A recent case study conducted between 1E and the Park Hill School District is eye-opening evidence about how 1E products provide solutions to maximize current investments, give freedom back to the IT organization, and enhance end-user support.", "1Es Shopping was able to fulfill all of Park Hill School Districts needs and requirements, as well as, over-deliver on features and ease of installation and use.", "", "Read the full Case Study", "Watch 1Es Shopping in action in this video overview"], "Author": ["Rod Trent"], "Date": "2010-08-27 00:00:00"}, {"Tags": ["1e", "events", "nightwatchman", "nightwatchman server", "pc power management", "power management", "wakeup"], "URL": "http://blogs.1e.com/2010/08/26/power-it-down-day-scheduled-for-friday-august-27th-2010-how-1e-takes-a-good-idea-even-further-2/", "Area": ["1E News"], "Comments": "", "Content": ["We encourage you to accept the challenge of powering down this Friday, and then take a few minutes to prepare for Monday  when the computers power back up  by investigating1Es year-round solutions.", "http://staging.1e.com", "Read, see and hear how 1Es customers have been saving the planet using 1Es products:", "http://staging.1e.com/it-efficiency/content-hub/#Case%20Studies", "Also, check out InfoWorlds coverage on this exact topic. InfoWorlds Ted Samson agrees with us:", "Power IT Down Day shouldnt just be Aug. 27"], "Author": ["Rod Trent"], "Date": "2010-08-26 00:00:00"}, {"Tags": ["1e", "events"], "URL": "http://blogs.1e.com/2010/08/25/1e-hosts-green-policy-leaders-congressmen-steve-israel-and-paul-tonko-with-alliance-to-save-energy/", "Area": ["1E News"], "Comments": "", "Content": ["On Monday in New York City, 1E hosted fifty-seven public and private sector sustainability leaders in a standing room-only event. At the EE Policy Perspectives lunch, 1E President Nick Milne-Home introduced SEEC members Congressmen Steve Israel and Paul Tonko who presented their insights on how America is leading the new green economy. Congressmen Israel and Tonko praised 1E for its significant contribution in advancing energy efficiency and creating clean energy jobs in America.", "", "Pictured here: Congressman Paul Tonko, Congressman Steve Israel, Alliance to Save Energy President Kateri Callahan, 1E President Nick Milne-Home"], "Author": ["Rod Trent"], "Date": "2010-08-25 00:00:00"}, {"Tags": ["case study", "csc", "customer", "drowsy server", "green it", "nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/08/25/part-6-csc-baseline-data-server-productivity/", "Area": ["1E Customers", "1E News", "1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": [{"Comment": "Pingback: Are You Ready for Datacenter Efficiency? | 1E Blogs", "Author": "Are You Ready for Datacenter Efficiency? | 1E Blogs"}], "Content": ["In this blog well share the first set of reports around server utilization.Here is the information we pulled from the tool around our pilot servers:", "Figure 1: Server Usage as identified by CSCs NightWatchman Server Edition case study", "Figure 2: Server reports  Left = non productive; Right = fully productive", "In our next blog, well discuss the power management features of the tool and share those preliminary reports as well."], "Author": ["customer spotlight bloggers"], "Date": "2010-08-25 00:00:00"}, {"Tags": ["1e", "1e wakeup", "microsoft", "microsoft systems management", "nightwatchman"], "URL": "http://blogs.1e.com/2010/08/25/video-jeff-wettlaufer-talks-about-extending-system-center-with-best-of-breed-1e-products/", "Area": ["1E News", "1E Products", "Green IT", "PC Power Management"], "Comments": [{"Comment": "Pingback: 1Es 2010 Blog Year in Review | 1E Blogs", "Author": "1Es 2010 Blog Year in Review | 1E Blogs"}], "Content": ["In this video Jeff Wettlaufer,Sr. Technical Product Managerfor System Center, speaks with Dave Lippa, Solution Engineer for 1E. Jeff and Dave talk about the extensions delivered by the 1E \"Nighwatchman\" technology for System Center Configuration Manager 2007 R3."], "Author": ["Rod Trent"], "Date": "2010-08-25 00:00:00"}, {"Tags": ["1e", "nightwatchman"], "URL": "http://blogs.1e.com/2010/08/24/1e-and-ah-technology-to-showcase-desktop-power-management-at-teched-australia-2010/", "Area": ["1E News", "1E Products", "Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["By working together with1Es best-of-breed energy efficient IT solutions, we offer customers a powerful combination of automation, reduced infrastructure and power management. As a result, customers can gain a deeper insight into their operations and drive efficiencies across their physical and virtual IT environments."], "Author": ["Rod Trent"], "Date": "2010-08-24 00:00:00"}, {"Tags": ["1e", "it efficiency", "nightwatchman", "nightwatchman server edition"], "URL": "http://blogs.1e.com/2010/08/23/a-smarter-more-efficient-it-means-a-better-more-cost-effective-business/", "Area": ["1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2010-08-23 00:00:00"}, {"Tags": ["carbon footprinting", "crc. nightwatchman", "pc power management", "server power management"], "URL": "http://blogs.1e.com/2010/08/23/are-you-ready-for-mandatory-carbon-footprinting/", "Area": ["Data Center", "Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["The CRC will apply to around 5,000 large organizations that use more than 6,000 megawatt-hours of electricity annually. The UK's Environment Agencysaid last week that just 1,229 organizations had signed up to meet the Sept. 30 deadline. Those that take early action through various certifications,such as the Carbon Trust Standard, can earn a higher ranking on the CRC league table, which will eventually be made public so that poorer performingcompanies can be 'named and shamed'.", "According to the report, most companies are now resigned to the fact that Carbon Footprinting (and paying for the emission of excess carbon) is goingto become law sooner rather than later.", "In another interesting report, it seems that even those companies that are recording sustainability stats aren't doing it so efficiently."], "Author": ["Phil Wilcock"], "Date": "2010-08-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/08/21/1es-trevor-sullivan-builds-the-1e-wakeup-ios-guide/", "Area": ["1E Products"], "Comments": "", "Content": ["Hopefully, you've already heardabout 1Ereleasing an application to WakeUp computers on your network using your iPhone and iPad. If not, shame on us!", "The WakeUp component for iPhone/iPad is wildly popular. Imagine being able to sit at home, watching your favorite TV show, and wake up a computer at work to provide remote management  all without booting up your PC, messing around with aVPN connection, logging in, logging on, and then jumping through hoops to find out that the remote computer is shutdown. Instead, just grab the 1E WakeUp app, install it on your iPhone or iPad, and managing remote computers is only a screen tap away.", "Trevor Sullivan, senior consultant at 1E, has put together an excellent blog post (including images!) detaling how to download, install, configure and use the 1E WakeUp app. Take a read through his post to get started today:"], "Author": ["Rod Trent"], "Date": "2010-08-21 00:00:00"}, {"Tags": ["1e", "data center", "energy management", "nightwatchman", "nightwatchman server", "nightwatchman server edition", "power management"], "URL": "http://blogs.1e.com/2010/08/20/empowering-energy-efficiency-in-federal-data-centers/", "Area": ["1E News", "1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2010-08-20 00:00:00"}, {"Tags": ["1e", "nightwatchman", "nightwatchman server", "power management"], "URL": "http://blogs.1e.com/2010/08/20/whitepaper-empowering-energy-efficiency-and-sustainability-in-it-for-federal-agencies/", "Area": ["1E News", "Data Center", "Green IT", "PC Power Management"], "Comments": "", "Content": ["THIS DOCUMENT DISCUSSES EXECUTIVE ORDERS 13514 & 13423 AND LOOKS AT HOW THE GOALS, OBJECTIVES AND SUSTAINABLE PRACTICES OUTLINED IN THE EXECUTIVE ORDERS CAN BE MET BY USING SIMPLE BUT INTELLIGENT SOLUTIONS.", "Download:"], "Author": ["Rod Trent"], "Date": "2010-08-20 00:00:00"}, {"Tags": ["1e", "it efficiency", "nightwatchman", "patch management", "pc power management", "wakeup"], "URL": "http://blogs.1e.com/2010/08/20/intel-acquires-security-company-mcafee-and-how-1e-fits-into-the-news/", "Area": ["PC Power Management"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2010-08-20 00:00:00"}, {"Tags": ["drowsy server", "nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/08/20/microsoft-server-power-management-made-simple/", "Area": ["1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["However, I found one suggested Server Power Management practice a little unrealistic. The top item in the Power Efficiency Best Practices list is: 'Shut down idle machines during off-peak times'", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-08-20 00:00:00"}, {"Tags": ["applications on demand", "license management", "shopping", "software rental"], "URL": "http://blogs.1e.com/2010/08/19/could-applications-on-demand-cure-shelfware/", "Area": ["1E Products", "Green IT"], "Comments": "", "Content": ["It's new Whitepaper time folks! The first of a series of great 1E whitepapers based around saving license costs, while making sure that your users have all the software they need, but only when they need it .", "This whitepaper sets out the 1E view of how organizations could evolve software rental models for their end users using 'just-in-time' downloads to provide users with access to the applications they need, when they need them.", "Does that strike a chord? It certainly does with many companies that 1E have worked with over the years. The problem of 'shelfware' as it is known is growing as users demand more and more applications. So take a look at this paper, and you may start to feel that all is not lost as Richard takes you through a possible solution using the 'Software Rental' concept."], "Author": ["Phil Wilcock"], "Date": "2010-08-19 00:00:00"}, {"Tags": ["green it", "nightwatchman", "pc power management", "windows 7"], "URL": "http://blogs.1e.com/2010/08/18/maximum-savings-possible-with-nightwatchman-and-windows-7/", "Area": ["1E Products", "Green IT", "PC Power Management"], "Comments": "", "Content": [""], "Author": ["Phil Wilcock"], "Date": "2010-08-18 00:00:00"}, {"Tags": ["1e", "energy management", "green it", "nightwatchman"], "URL": "http://blogs.1e.com/2010/08/17/green-fatigue-not-in-the-business-world/", "Area": ["Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["The percentage of UK employees stating that they were personally concerned about environmental issues fell from a peak of 77% in 2008 to 63% in 2010. When asked specifically about the issue of climate change, the figures were even starker, with concern down to 50% from 65% in 2008.Seems that so called 'Green Fatigue' is starting to take hold. Human nature dictates that no matter how concerned or compassionate we feel about a subject, eventually we lose heart and start to care less. With climate change it's because for a lot of people the results aren't immediately apparent, or just don't affect them.", "Employees surveyed said theyve also found it easier to get environmental policies onto the IT planning agenda in 2010. With 41 per cent finding support from management easier to achieve. This may be linked to the fact that 65 per cent of IT managers confirmed they are now required to report on the energy performance of their networks, although only 49 per cent had actually conducted an energy audit.", "So in the corporate world there is still a strong energy/cost saving driver to major projects, and I can't see that trend abating any time soon and energy costs rise and companies strive to be leaner and fitter."], "Author": ["Phil Wilcock"], "Date": "2010-08-17 00:00:00"}, {"Tags": ["1e", "computer health", "it efficiency", "wakeup"], "URL": "http://blogs.1e.com/2010/08/13/1ewakeup-what-does-it-do-again/", "Area": ["1E Products"], "Comments": "", "Content": ["So just what do we mean by Computer Health?. WakeUp can contribute to the overall health of desktop PCs by monitoring several key components of the workstation such as", "Disk Errors  if the user is filling up the local disk etc", "Devices  any errors in devices such as printers will be reported", "Windows Update  check if there are any Windows Update Failures such as critical patches", "CPU and Memory usage  be alerted if a PC's CPU is too busy or if a workstation is constantly using too much memory (which can make the machine slow)", "If errors are found they are reportedvia the SMS/Config Manager Management Console and can be acted on by administrators. A daily glance at the Computer Health report or collectionsis all it takes to give you peace of mind. In fact the WakeUp agent will even attempt to fix an error if possible, by running the disk cleanup utility for instance.", "These are just a small selection of the Computer Health Checks that 1E's WakeUp will perform out of the box. With the local WakeUp agent running on your computers you can be sure that you're making a significant contribution to that 42% saving for a well managed desktop."], "Author": ["Phil Wilcock"], "Date": "2010-08-13 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/08/10/stop-and-think-before-you-commit-to-rapid-data-center-expansion/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-08-10 00:00:00"}, {"Tags": ["1e wakeup", "application compatability", "migration", "nomad", "os deployment", "self service", "shopping", "system center", "wake-on-lan", "wakeup", "windows 7", "Windows XP Danger Zone", "Windows XP Migration"], "URL": "http://blogs.1e.com/2010/08/10/windows-7-deployment-the-1e-way-part-2-tools-for-the-job-2/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration"], "Comments": [{"Comment": "Pingback: Windows 7 DeploymentThe Series | 1E Blogs", "Author": "Windows 7 DeploymentThe Series | 1E Blogs"}, {"Comment": "Pingback: Windows 7 Deployment the 1E way  Part 5  Image is everythingor is it? | 1E Blogs", "Author": "Windows 7 Deployment the 1E way  Part 5  Image is everythingor is it? | 1E Blogs"}, {"Comment": "Pingback: Windows 7 Deployment the 1E way - Part 1: Introduction | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way - Part 1: Introduction | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["Although not used directly for the deployment of Windows operating systems, there are two other tools to mention that help out in the Assessment and Planning phases of an OSD project:", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left.", ""], "Author": ["Mike Terrill"], "Date": "2010-08-10 00:00:00"}, {"Tags": ["1e", "ipad", "iphone", "itunes", "wakeup"], "URL": "http://blogs.1e.com/2010/08/09/wakeup-computers-on-your-network-using-your-ipad-and-your-iphone/", "Area": ["1E News", "1E Products", "Green IT", "PC Power Management"], "Comments": [{"Comment": "Pingback: Tweets that mention Wakeup computers on your network using your iPad and your iPhone | 1E Blogs -- Topsy.com", "Author": "Tweets that mention Wakeup computers on your network using your iPad and your iPhone | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: iPhone/iPad WakeUp app updated to version 1.7 | 1E Blogs", "Author": "iPhone/iPad WakeUp app updated to version 1.7 | 1E Blogs"}], "Content": ["What was that?", "A lot of companies utilize iTunes for various things on various devices and computers  so it makes sense that you would actually find 1E products in the Applications list. 1E continues striving to allow you to manage all devices on your network in an effort to provide total ITEfficiency.", "This neat little utility from 1E combines with Web WakeUp to let you wake up any computer on your network using an iPhone or iPad. Handy when you've just got to finish that last minute piece of work but you've already left the office, or when you want to get a head start on the day by waking up your PC before you get to your desk. Once your computer is awake you can connect to it remotely using any third party Remote Desktop Protocol (RDP) app.", "If you want to find 1E WakeUp in the iTunes app, just search for 1E WakeUp in the iTunes store. Or, just jump out to the following links to read more:", "Requirements and features are explained on the iTunes product page:"], "Author": ["Rod Trent"], "Date": "2010-08-09 00:00:00"}, {"Tags": ["1e", "nomad enterprise", "software distribution"], "URL": "http://blogs.1e.com/2010/08/06/nomad-enterprise-saving-co2-without-even-trying/", "Area": ["1E Products"], "Comments": "", "Content": ["You see, we're still saving energy and CO2 even we're not even trying! Seriously though, the reduction in the number of servers required to service your software distribution when deploying Nomad Enterprise is often overlooked. Many of our customers are able to significantly reduce the number of servers which in turn reduces management cost, energy use and ultimately CO2.", "In case you don't already know (where've you been!?), here's how Nomad works:", "As the diagram below shows, Nomad intelligently utilizes the disk space on local systems to ensure that large packages only cross the network once to remote locations. This highly efficient software distribution and deployment method means that even large Operating Systems updates can be deployed to any location or even to mobile users."], "Author": ["Phil Wilcock"], "Date": "2010-08-06 00:00:00"}, {"Tags": ["data center", "greenpeace", "nightwatchman server edition", "sustainability"], "URL": "http://blogs.1e.com/2010/08/05/social-networkings-social-responsibility-2/", "Area": ["Data Center", "Green IT"], "Comments": [{"Comment": "Pingback: Facebook Pokes Green IT | 1E Blogs", "Author": "Facebook Pokes Green IT | 1E Blogs"}], "Content": ["It seems that as Facebook continues to expand, as does its list of critics.This time they have caught Greenpeaces eye. It seems that Greenpeace are less than pleased with Facebooks new 30MW data center facility in Prineville Oregon, which is being built to cope with increasing demand for their service. The original articles can be found here:", "http://www.greenpeace.org/international/en/news/features/facebook-dump-coal190210/", "On the surface, it seems that Facebook have endeavored to be as green as possible in the build of this new facility. The building has been designed to take advantage of as much free air cooling as possible and being Oregon where overnight lows are in the 40s even in the summer, there will be plenty of it! In addition, the facility has been constructed to silver LEED certification status meaning that water use, cooling, heating and lighting have all been designed to be as efficient as possible. Also, by building the datacenter in Crook County, Facebook aims to bring a much needed 200 temporary construction and 35 permanent jobs to an area with the highest unemployment in the state at 16.4%", "However, despite these facts, Greenpeace are unhappy that the data center will run on mostly non-renewable, coal power. They have stated that Facebook could have located their new facility in an area where renewable sources of energy are more abundant and although Greenpeace are unable to halt construction, they are attempting to raise awareness about the technology industries growing thirst for electricity.", "I can see both sides of the argument, and the reason this post interested me is that despite the fact that I think Facebook have endeavored to be as carbon neutral as possible whilst making the facility cost-effective, the issue of growing consumption by the IT industry still remains prevalent. So what can be done?", "Clearly, building the most efficient facilities is critical to ensure that consumption is minimized as much as possible but even before this happens, it is possible to increase efficiency with what you have. Conservative estimates estimate that around 15% of servers are not being used for productive and useful workloads. That is, they are switched on and consuming power, but they are not actually running any business applications. They have either been forgotten about or have been built with the expectation of future growth. This number is likely to be even higher in virtual environments due to the dreaded effect of virtual sprawl.", "Rather than breaking ground on a new datacenter or renting an additional rack in a co-lo facility, would it not be more effective (and indeed efficient) to do more with what you have? Why buy more when what you have will suffice. It is 1Es belief that our customers should expect more from their IT and do more with what they have and this is about identifying waste in power, hardware, operational costs and licensing, something that NightWatchman Server Edition can do in the datacenter environment today.", "Want to avoid the wrath of the environmentalists? 1E can help."], "Author": ["Andy Dominey"], "Date": "2010-08-05 00:00:00"}, {"Tags": ["branch", "branchcache", "configmgr", "software distribution", "wan optimization"], "URL": "http://blogs.1e.com/2010/08/04/is-branchcache-the-right-solution-for-software-distribution/", "Area": ["ConfigMgr"], "Comments": "", "Content": [""], "Author": ["Dave Fuller"], "Date": "2010-08-04 00:00:00"}, {"Tags": ["csci", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2010/08/03/big-cuts-in-it-sector-co2-emissions/", "Area": ["Green IT", "PC Power Management"], "Comments": [{"Comment": "Of the panoply of website Ive pored over this has the most vraetciy.", "Date": "2011-10-09 08:32:00", "Author": "Cheyanna"}, {"Comment": "ILDogM  dsrkzllafwtq", "Date": "2011-10-10 03:43:00", "Author": "bppxhahkzbj"}, {"Comment": "S2WSi2  pmlywklvptqx", "Date": "2011-10-13 09:32:00", "Author": "exxazfl"}], "Content": [""], "Author": ["Phil Wilcock"], "Date": "2010-08-03 00:00:00"}, {"Tags": ["green it", "hsbc", "nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2010/08/02/the-importance-of-being-idle/", "Area": ["1E Products", "Green IT", "PC Power Management"], "Comments": "", "Content": ["That's why desktop power management is one of the most effective technologies that a business can use to reduce costs via reduced energy usage.", "HSBC havean awfullot of employees, and it's nice to think that as part of our Global deployment of NightWatchman, and all of the subsequent savings, that at least some of HSBC's staff have now realized the importance of being idle."], "Author": ["Phil Wilcock"], "Date": "2010-08-02 00:00:00"}, {"Tags": ["application compatability", "migration", "os deployment", "system center", "windows 7", "Windows XP Danger Zone", "Windows XP Migration"], "URL": "http://blogs.1e.com/2010/07/26/windows-7-deployment-the-1e-way-part-1-introduction/", "Area": ["OS Deployment", "Windows 7", "Windows 7 Migration"], "Comments": [{"Comment": "Pingback: Deploying Windows 7 the Easiest and Most Cost Effective Way | 1E Blogs", "Author": "Deploying Windows 7 the Easiest and Most Cost Effective Way | 1E Blogs"}, {"Comment": "Pingback: Windows 7 DeploymentThe Series | 1E Blogs", "Author": "Windows 7 DeploymentThe Series | 1E Blogs"}, {"Comment": "Pingback: Windows 7 Deployment the 1E way  Part 5 - Image is everything...or is it? | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way  Part 5 - Image is everything...or is it? | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}, {"Comment": "Pingback: Windows 7 Deployment the 1E way  Part 3: The Perfect Match | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency", "Author": "Windows 7 Deployment the 1E way  Part 3: The Perfect Match | 1E Blogs - Insight and debate on IT Efficiency1E Blogs  Insight and debate on IT Efficiency"}], "Content": ["This is the first in a series of blogs looking at the challenge that will be facing just about every organization over the next 12-24 months  migrating your existing desktop environment off of XP with a Windows 7 deployment. 1E have been developing and implementing solutions to automate the deployment of new operating systems and the migration of existing desktop environments for over 7 years. This series will take you through the key stages of your deployment project and explain the cool tools, tips and tricks that we use to make the migration process as smooth and efficient as it can possibly be.", "OSMigration Utopia?", "I think the Utopia for OS migration is a solution that is initiated either by a remote operator or the end user, and is then fully automated -backing up the user data and personality, deploying the corporate standard image along with all the right drivers, automatically determining and layering on the business and location specific applications and settings, applying all the latest updates and then restoring the user data and personality leaving the machine fully migrated and ready for the user to be productive. This should all be achieved with minimal time and effort from desktop operators, helpdesk support or even end users to initiate the process, with minimal down-time for the user, with minimal impact on the network and with the minimum amount of server infratructure as possible. With such a solution in place, actual migration of your desktop environment, no matter how large it is, becomes an effortlessprocess that continues to provide cost savings every day when new joiners start, when workstations have to be replaced due to Hardware Refresh cycles and when workstations have to be rebuilt due to technical issues (break-fix).", "This Utopia is achievable  and this blog series will explain how! It obviously involves a fair bit of work up front, and involves a number of tools and technologies that you need to get your head around, but the effort upfront will make the deployment a breeze, not only for Windows 7 now but will also prepare you for the next wonder that Microsoft throws into the desktop arena.", "This series will cover the following topics", "If you found this article interesting, please take a moment to share it with your contacts using the social media buttons to the left."], "Author": ["Dave Fuller"], "Date": "2010-07-26 00:00:00"}, {"Tags": ["nightwatchman server edition", "virtual machine power management", "vmware"], "URL": "http://blogs.1e.com/2010/07/26/making-every-kilowatt-count-virtually/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["Virtualization seems to be getting a lot of bad press these days. With energy costs set to rise as demand outstrips supply, and carbon emission legislation looking more and more likely in the US, Virtualization was at first seen as a savior of hard pressed data centers who were near to capacity with no place to go.", "This recent trend for 'Virtualization Bashing is starting to grate a little with me now. As VMware partners, 1E is firmly behind Virtualization as a key tool in the fightagainst ever expanding energy consumption in the Data Center. Like all great technologies, it just has to be managed well to avoid the pitfalls of inefficient implementation and management.", "Take the Cloud for example. As more and more business applications migrate to the Cloud, the ability to monitor individual Virtual Servers becomes morepressing. In NWSE2.0 we've expended the 'Useful Work' analysis to Virtual Machines, so that you can see exactly which ofthose VMs is behaving badly. In a scenario wheremultiple customers using multiplevirtual servers may be sharing the same physical server, energy use becomes more of an issue too. PreviouslyNightWatchman used to monitor the power consumption of individualphysical servers, which is great when you own all of the hardware, but is less useful in large co-hosting or chargeback setups. Addressing this concern, we can now monitor the power consumption of individualVirtual Machines so that you can identify and monitor the most power hungry and possibly even charge for VM usage based on energy consumption. This screen shot below shows you what you might see in the NWSE console.", ""], "Author": ["Phil Wilcock"], "Date": "2010-07-26 00:00:00"}, {"Tags": ["nightwatchman", "pc power management"], "URL": "http://blogs.1e.com/2010/07/22/nightwatchman-the-low-calorie-approach-to-pc-power-management/", "Area": ["Green IT", "PC Power Management"], "Comments": "", "Content": ["Now on the face of it this a quite a lightweight, amusing little story with a happy ending, but it does highlight the level of naivety that's out there when companies approach such projects. Leaving aside the cost in time of sending someone out to check which computers had been turned off, and then dropping the chocolate on the correct desks, in the real world we have found that this approach simply doesn't work.", "I do applaud the guys at Cotswold District Council for taking an innovative approach to PC Power Management. However, I think that to achieve ongoing success may result in some serious chocolate consumption..", ""], "Author": ["Phil Wilcock"], "Date": "2010-07-22 00:00:00"}, {"Tags": ["1e"], "URL": "http://blogs.1e.com/2010/07/20/waiting-for-an-energy-revolution-technology-has-a-big-part-to-play/", "Area": ["Green IT"], "Comments": "", "Content": ["..I love it when I come across a well written, thought provoking blog.", "The essence of Kate's piece is that despite the massive leaps and bounds of the IT industry both in hardware and software design, the same advances in technology can't be brought to bear and expected to achieve the same results in the world of energy. She quote various eminent sources, among them Shell chief exec Peter Voser who stated:", "So while I do recognise that the massive advances in technologycan't be magically reproduced in the search for solutions to the energy problems that we face, I think that we need to recognise the enormous challenge and role that technology has to play in making sure that the planet is still in reasonable shape when we are ready to transition to a cleaner future."], "Author": ["Phil Wilcock"], "Date": "2010-07-20 00:00:00"}, {"Tags": ["data center", "green grid", "pue"], "URL": "http://blogs.1e.com/2010/07/19/new-green-grid-report-consolidates-pue-reporting-progress/", "Area": ["Data Center", "Green IT"], "Comments": "", "Content": ["Generally speaking the report does the following:", "Simple, effective, and a good start. I like the way that the Green Gridwork to get stuff released and straight onto the next version  which in this case will cover mixed use buildings alongside the dedicated Data Centers covered in this version 1 report.", "", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-07-19 00:00:00"}, {"Tags": ["1e", "configmgr", "os deployment", "osd", "system center", "systems management", "task sequence"], "URL": "http://blogs.1e.com/2010/07/17/configmgr-osd-always-including-certain-files-in-your-boot-images-think-trace32/", "Area": ["ConfigMgr", "OS Deployment", "SCCM", "Windows 7"], "Comments": [{"Comment": "Pingback: Tweets that mention ConfigMgr OSD: Always including certain files in your Boot Images -think Trace32 | 1E Blogs -- Topsy.com", "Author": "Tweets that mention ConfigMgr OSD: Always including certain files in your Boot Images -think Trace32 | 1E Blogs -- Topsy.com"}, {"Comment": "Pingback: SCCM: Trace in je SCCM Boot.Wim file | BPMi", "Author": "SCCM: Trace in je SCCM Boot.Wim file | BPMi"}, {"Comment": "Pingback: Reblog: ConfigMgr OSD Always including certain files in your Boot Images  t3chn1ck", "Author": "Reblog: ConfigMgr OSD Always including certain files in your Boot Images  t3chn1ck"}, {"Comment": "Pingback: The Power of Task Sequences, Part 4, Misc Notes  t3chn1ck", "Author": "The Power of Task Sequences, Part 4, Misc Notes  t3chn1ck"}, {"Comment": "Pingback: SCCM: Inject useful tools to SCCM WinPE image | IT Consultant Everyday Notes", "Author": "SCCM: Inject useful tools to SCCM WinPE image | IT Consultant Everyday Notes"}], "Content": [], "Author": ["Mike Terrill"], "Date": "2010-07-17 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/07/15/1e-dynamic-duo-discuss-nightwatchman-server-edition-2-0-release/", "Area": ["1E Products"], "Comments": "", "Content": ["Here's oneNOT to miss.", "1E's Andy Dominey and Andy Hawkins present NightWatchman Server Edition 2.0", "This webinar will be packed full of information about the new features in NWSE 2.0, and how you can make the best use of them. Registration is easy (and free), just go to:", "There are two sessions running each day on the 15th and 22nd July so no excuses  I will be asking questions !", "Enjoy"], "Author": ["Phil Wilcock"], "Date": "2010-07-15 00:00:00"}, {"Tags": ["case study", "csc", "customer", "drowsy server", "green it", "nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/07/13/part-5-csc-on-nightwatchman-server-edition-installation-and-baselining-contd/", "Area": ["1E Customers", "1E News", "1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["With reports now ready to go, next week we will share our preliminary results!", ""], "Author": ["customer spotlight bloggers"], "Date": "2010-07-13 00:00:00"}, {"Tags": ["1e", "sunday times international track"], "URL": "http://blogs.1e.com/2010/07/12/1e-in-sunday-times-2010-international-track-100-league-table-of-top-private-companies/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1Es 2010 Blog Year in Review | 1E Blogs", "Author": "1Es 2010 Blog Year in Review | 1E Blogs"}], "Content": ["Straight in at 91 with a bullet!", "Had to share this one with you, just because it makes me proud. Every year the UK's Sunday Times publishes it's lists of the fastest growingcompanies in various sectors. We've made it into the Tech Track 100 a couple of times in the past but this year is our first in the International group, and as you can se there are some serious performers in there.So well done everyone at 1E, and a big thanks to all of our friends and customers out there who support us each and every day. You know who you are.", "", "BTW Anyone wants to hire me to write their Oscars acceptance speech  I'm available!"], "Author": ["Phil Wilcock"], "Date": "2010-07-12 00:00:00"}, {"Tags": ["green it", "nightwatchman server edition", "pc power management"], "URL": "http://blogs.1e.com/2010/07/12/most-data-center-servers-vastly-underutilized/", "Area": ["Data Center", "Green IT", "PC Power Management", "Server Power Management"], "Comments": "", "Content": ["First up is PC Power Management", "Next up is the Data Center, and it's interesting to read that this area is where participants can see the greatest potential savings:", "As I scanned through this report, this was the piece that leapt out at me. Servers running at four percent utilization? That's quite shocking don't you think!? Well for us it's not that surprising. This is what our customers are finding all over the world. Under used servers lead to a rash of virtualization projects which leads to Virtual Sprawl and ultimately Virtual Stall. The savings are obviously there for the taking, but without some way offirst identifying these underutilized servers and then tackling their lazy habits it's difficult for managers to take the plunge.", "", "", ""], "Author": ["Phil Wilcock"], "Date": "2010-07-12 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/07/07/press-release-nightwatchman-server-edition-2-0/", "Area": ["1E News", "Data Center", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-07-07 00:00:00"}, {"Tags": ["configmgr", "microsoft", "nightwatchman", "pc power management", "r3"], "URL": "http://blogs.1e.com/2010/07/05/1e-ceo-sumir-karayi-chats-with-microsoft-cvp-brad-anderson/", "Area": ["1E News", "Green IT", "PC Power Management"], "Comments": "", "Content": ["This is an interesting chat that our CEO Sumir had with Brad Anderson a while back. Talks about the relationship that we have with Microsoft, and goes on for a more detaileddiscussion onthe importance of power management in enterprises and how 1E solutions, coupled with System Center Configuration Manager 2007 R3, can help large organizations save substantially on infrastructure costs."], "Author": ["Phil Wilcock"], "Date": "2010-07-05 00:00:00"}, {"Tags": ["1e wakeup", "configmgr", "patching", "r3", "wake timer", "wake-on-lan"], "URL": "http://blogs.1e.com/2010/06/28/wake-on-lan-versus-wake-timers-2/", "Area": ["1E Products", "ConfigMgr", "SCCM"], "Comments": "", "Content": ["When you absolutely, positively have to wake up your PCs, accept no substitute.", "In the military, Reveille has long been played by the company bugler to rouse the soldiers from their slumber. They could have relied on each soldier to set his own alarm or train their body clock to wake them at the appropriate time, but long experience has shown that this is an unreliable way to ensure that the company of soldiers is awake at the time it should be.", "The same is true for PCs. Even though there are now mechanisms within the operating system to wake a PC from sleep at a certain time, there are definitely times when this is not sufficient. The need for a reliable, scalable and secure wake-up call is clear. The only solution which enables this is Wake-On-LAN (WoL) from an external source, such a the 1E WakeUp solution..", "There are 3 main reasons to use WoL in addition to alarm clock style wake-ups", "Alarm clock wakeups have a set future time to wake up and rely on the on-motherboard clock to notice that the correct moment has come. Most alarm clock style solutions allow only one wake-up from sleep event per day, so you can either set the PCs to wake at some point overnight for patching, or before the user comes into work so that the PC is ready for them, but not both. If an emergency patch is needed, the administrator has to wait for the PCs to wake themselves up, rather than forcing them to wake up centrally using WoL", "Laptops are normally set to ignore alarm clock style wakeups, since if they wake themselves up in a bag, that poses a potential fire risk and can run down the battery so that the laptop is dead when the user comes to next use it. A laptop that is left connected to a wired network is usually also connected to eternal power, and so a WoL packet can wake the PC up to be patched or for remote access.", "When a PC has been powered down to save energy overnight or at the weekend, the end user may want to remotely connect to that PC to retrieve documents or run their applications. The user may not know exactly when they will need to connect to the PC and therefore an alarm clock type wake-up is not the correct way to enable this remote access. Using Web WakeUp (part of 1E WakeUp) end users can remotely wake-up their PC and then seamlessly connect to it to do their work, whether the PC was were off or in stand by.", "Another reason people cite for preferring alarm clock wakeups is that Wake-On-LAN requires the use of subnet directed broadcasts or modification of the ARP cache timeout on every router, both of which can compromise network security. With 1E WakeUp, neither modification is necessary, increasing the security and reliability of the WoL solution and reducing the administrative burden."], "Author": ["Phil Wilcock"], "Date": "2010-06-28 00:00:00"}, {"Tags": ["nightwatchman server edition", "virtual sprawl", "virtual stall", "virtualization"], "URL": "http://blogs.1e.com/2010/06/28/from-virtual-sprawl-to-virtual-stall/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["Depending on who you believe, Virtualization seems to be either the greatest technology of the last ten years or a creator of chaos, misery and destruction  no middle ground here. Hot on the heels of allthe worry and associated publicityover Virtual Sprawl beingthe bad guycapable of wiping out any savings due to the unchecked prolifigation of Virtual Machines across your networks, comes a swing of the pendulum in the shape of Virtual Stall.", "Seems that IT managers are becoming jittery in the face of this potential for misuse of VM technology and are litterally stalling rollouts. Once a few articles appeared in the blogosphere describing the pain of VM rollouts coming to a grinding halt of course we needed a new buzzword, and so Virtual Stall was born. So, what is it to be? Are you a Sprawler or a Staller? Or have you just gone ahead and rolled out your virtualization project with no problems at all?", "Despite my obvious amusement at yet another VM catch phrase, there is a serious side to things if you look at the facts. Virtual Stall can be summed up quite easily. The stall happens when a company realizes that it has gone too far too fast with virtualization, which, while it is a good thing to recognize, results in a complete undermining of confidence in completing the rollout. Quite often this occurs when mostly non-mission critical systems have been migrated, and leaves a gaping chasm whereby the fear of further unchecked VM chaos means that those systems which could possibly benefit the most from virtualization will never be migrated.", "So what next? Well it's obvious that both Sprawl and Stall are avoidable with good project planning and follow up management, but what if you are already stuck in the stall? For many ofthese projects,it looks like there's no way out of the mire, and that the best thing to do is to sit still and do nothing. The problem with that approach is that doing nothing is not a reality. When Sprawl results in Stall, you still have servers out there in no-mans land and they need to be brought under control before you can proceed. If you really want to Stall you still need to check the Sprawl!"], "Author": ["Phil Wilcock"], "Date": "2010-06-28 00:00:00"}, {"Tags": ["nightwatchman", "public sector"], "URL": "http://blogs.1e.com/2010/06/24/dodging-the-deficit-uk-emergency-budget-and-ict/", "Area": ["PC Power Management"], "Comments": "", "Content": ["Budget time agaqin here in the UK, and this time hearing it live on TVit was like 18th Century Revolutionary France  waiting the see where the guillotine fell next. The bottom line is, we have no money, and a hugedeficit, so it's time for some cuts.", "Secondly, here another area thats closer to (everybodys) home.", "And Finally", "Well, perhaps my Mobile Broadband will actually start working then. Hooray!"], "Author": ["Phil Wilcock"], "Date": "2010-06-24 00:00:00"}, {"Tags": ["case studies", "dell", "nightwatchman", "shopping"], "URL": "http://blogs.1e.com/2010/06/22/video-case-studies-at-1e-com/", "Area": ["1E Customers", "1E News"], "Comments": "", "Content": ["Ever wondered exactly what we do here at 1E and for whom we do it? Me too!", "This project has pulled together some case studies from some of our wonderful customers, large and small. From Dell to Park Hill School District, find out just how we have helped these organizations save time, energy and money through some of our solutions. Heres a couple to get you started:", ""], "Author": ["Phil Wilcock"], "Date": "2010-06-22 00:00:00"}, {"Tags": ["case study", "csc", "customer", "drowsy server", "green it", "nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/06/21/part-4-csc-on-nightwatchman-server-edition-installation-and-baselining/", "Area": ["1E Customers", "1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": [{"Comment": "Pingback: PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 2: The Data Center | 1E Blogs", "Author": "PC Power Management is just the First Step to Realizing the Big Picture of Overall IT Efficiency and SavingsPart 2: The Data Center | 1E Blogs"}], "Content": ["Our engineers located the problem, and their solution was to update the firewall security settings and open the required port. For subsequent installations, we ensured that these settings were updated in advance as part of our change request."], "Author": ["customer spotlight bloggers"], "Date": "2010-06-21 00:00:00"}, {"Tags": ["pc power management", "sumir karayi"], "URL": "http://blogs.1e.com/2010/06/17/podcast-1e-ceo-speaks-about-pc-power-management/", "Area": ["1E News", "Green IT", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: 1Es 2010 Blog Year in Review | 1E Blogs", "Author": "1Es 2010 Blog Year in Review | 1E Blogs"}], "Content": ["In an insightful interview with Tech by SouthWest, 1E's Sumir Karayi gives us the lowdown on 1E, how and why companies should embrace PC Power Management, 1E'snew missioninto the data centerand what he dreams about at night!", ""], "Author": ["Phil Wilcock"], "Date": "2010-06-17 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "pue", "server power management"], "URL": "http://blogs.1e.com/2010/06/17/raising-the-bar-on-data-center-energy-efficiency/", "Area": ["Data Center", "Green IT"], "Comments": [{"Comment": "Pingback: New Cloud Data Centers  More Energy Please! | 1E Blogs", "Author": "New Cloud Data Centers  More Energy Please! | 1E Blogs"}], "Content": [""], "Author": ["Phil Wilcock"], "Date": "2010-06-17 00:00:00"}, {"Tags": ["data center", "drowsy server", "energy efficiency", "nightwatchman server edition"], "URL": "http://blogs.1e.com/2010/06/16/topaz-the-gem-of-utah/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["On May 4th this year, eBays new $287 million Topaz data center was brought online in Utah, designed and built to host the eBay.com and PayPal.com. This new facility is a fault tolerant Tier IV data center designed to support transactions totaling over $60 billion a year or $2000 a second!", "But whilst this new data center is big and powerful; 240,000 sq ft and 7.2 MW of capacity, its also green. eBay has tried with this project, to be as energy efficient as possible both for financial and ethical reasons. With a view to this goal, eBay is using 400V power distribution, eliminating a level of transformers and saving 2% in energy costs. The facility is cooled using a water-side economizer, supported by a 400,000 gallon cistern which collects rainwater and eBay anticipates that free outside air can be used to cool the building for more than half the year. Using these technologies and intelligent placement of racks and management of cold and hot air, eBay expect to achieve PUE of 1.4 which is excellent considering the side and scale of the facility.", "However, wouldnt it be nice to go that one step further? When designing and building a data center, something that is very often overlooked is power reduction at the server level. Data center designers will architect to supply a certain maximum capacity to each rack; up 30kW in the case of the Topaz facility and stand back and admire their work once the switch is flipped. The server managers will then come in behind them and load the racks to capacity and stand back themselves and admire their work once all the flashing lights are blinking hypnotically.", "But in todays economy, it is absolutely critical to get the most from what you have and squeeze the very last bit of juice out of the fruit. With that in mind, server power management is becoming more and more important in addition to technologies such as virtualization. Wouldnt it be great to load up a rack with servers then during times when the servers are less utilized or entirely unused, reduce their power consumption by 15%?", "These savings would not only serve to increase the operational efficiency of a data center but some power companies are even offering rebates to facilities which use less than their quota of power. In addition, during times when a server is power managed, it has been observed that the overall temperature often reduces, placing less of a demand on cooling and decreasing power requirements even further. In the case of eBay, reducing the cooling requirements at certain times of the day (early hours of the morning, for example) may mean that the outside air can be used to cool the datacenter longer, before refrigeration units need to be switched on. This in turn would lower their PUE even below the estimated 1.4.", "Server power management can be accomplished using modern hardware out of the box, relying on CPU load to determine when to power manage or by utilizing software products such as 1Es NightWatchman Server Edition which can assume this responsibility, ensuring that the server is only ever power managed when it is not providing any business value.", "Server power management based on Useful Work say goodbye to waste and hello to a more efficient data center."], "Author": ["Andy Dominey"], "Date": "2010-06-16 00:00:00"}, {"Tags": ["cheap oil", "clean energy", "peak oil"], "URL": "http://blogs.1e.com/2010/06/16/dawning-of-a-new-energy-era/", "Area": ["The Green Room"], "Comments": "", "Content": ["With a bleak backdrop of Americas worst ever environmental disaster, President Obama last night offered a glimpse of his vision for a cleaner, greener world. Speaking from the Oval office, he said that the time to embrace a clean energy future is now, and that the days of cheap oil are at an end. Likening the BP oil spill to an epidemic, it was stirring stuff, and quite brave too perhaps.", "Already you can hear the protests from big oil and other opponents to his approach. Of course the oil companies will push back against any legislation that threatens their ancient empires, and thats human nature I guess. When youre on an easy ticket you dont want it to end.", "But what can I do?", "We are constantly bombarded with very negative statistics around global warming , energy use, the state of our food, oceans and loss of biodiversity. While all of this might be true, it tends to leave people with a sense of impending doom and helplessness. While we watch government and big business slug it out over our future, its the natural thing to sit back and trust in fate (or not), and worry.", "History has proved however, that we as individuals can make a huge difference, indeed we must all work at the local community level to make sure that change for the better happens sooner rather than later. My own home town has a growing Transition organization that aims to create a long term Energy Descent Plan that will see our community move away from oil dependency and towards a resilient, localized economy that is powered by clean energy and locally produced food. There are always skeptics of course, but isnt it worth a shot?", "Currently, the economies of the East are showing us the way forward. For those who dont believe that renewable energy such as wind power can work, take a look at China, which has become the biggest constructor (and installer) of wind farms in the world. They understand that as energy demand rises, we can no longer fulfill that demand from good old dependable oil and coal.", "An Opportunity?", "Take a look at the alternative  deeper more dangerous drilling in more remote locations such as the Arctic, bringing with it a likelihood of more accidents and environmental disasters. An oil price that will steadily rise as demand increases beyond the reach of production, bringing more economic woes.", "We need faith, imagination, hard work and collaboration. We also need to face up to the fact that we need to be done with oil and coal pretty soon, and to realize that the next generation of energy isnt going to come bubbling up out of the ground somewhere in Texas.."], "Author": ["Phil Wilcock"], "Date": "2010-06-16 00:00:00"}, {"Tags": ["data center", "data storage", "energy star", "green it"], "URL": "http://blogs.1e.com/2010/06/15/data-storage-next-in-line-for-energy-star-rating/", "Area": ["Data Center", "Green IT"], "Comments": "", "Content": [], "Author": ["Phil Wilcock"], "Date": "2010-06-15 00:00:00"}, {"Tags": ["green it", "shelfware"], "URL": "http://blogs.1e.com/2010/06/14/whats-on-your-shelf/", "Area": ["AppClarity", "Software Asset Management"], "Comments": "", "Content": ["After a while I started thinking that this must be a problem in most corporate environments too. Surely Shelfware, as is it known in the big wide world, is costing companies millions as we march on year by year rolling out endless waves of upgrades and new product in order to (hopefully) make our workforce more productive. Shelfware can be a big drain on resource and finance. It not only affects the return on investment for a company but overall it adds to your total cost of ownership.", "The more you look into this issue, the more you realize that there are great savings to be made with the right approach. What surprised me is how little is being done to tackle this problem that is only going to grow and grow as new licensing models evolve. So at the start of this new working week, ask yourself the question  Whats on your shelf?"], "Author": ["Phil Wilcock"], "Date": "2010-06-14 00:00:00"}, {"Tags": ["case study", "csc", "customer", "drowsy server", "green it", "nightwatchman server edition", "server power management", "useful work"], "URL": "http://blogs.1e.com/2010/06/10/part-3-csc-on-testing-nightwatchman-server-edition/", "Area": ["1E Customers", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["In the next blog well talk about our installation of NightWatchman Server Edition agent to the remainder of our servers."], "Author": ["customer spotlight bloggers"], "Date": "2010-06-10 00:00:00"}, {"Tags": ["data center", "energy star", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/06/08/energy-star-certification-for-data-centers-takes-off/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["\"We were surprised to find there weren't many operational variables that had a statistically significant impact on PUE,\" they said. \"The variability is much more dependent on energy management practices than it is on characteristics.\""], "Author": ["Phil Wilcock"], "Date": "2010-06-08 00:00:00"}, {"Tags": ["green it", "greening it", "low carbon society"], "URL": "http://blogs.1e.com/2010/06/07/free-greening-it-book-released-a-must-read/", "Area": ["Green IT"], "Comments": "", "Content": ["I've mentioned this project before, as it's an interesting gathering of green techies coming together to produce a collaborative piece based on current Green IT principles, thinking and concepts. The subtitle of the book  'How Greener IT can form a solid foundation for a Low Carbon Society' sums it up rather well. Each chapter is written by one of about a dozen contributors from all over the world, and covers a different aspect of Green IT. Here are some examples of the topics covered:", "The great thing about this approach is that each chapter is written by an expert in his or her field, so it's all very current and accurate, as opposed to being written by one person who knows 'a bit about each topic'. I find it easy to read (esp. with my short attention span) as you can dip in and out as topics grab your interest. Here's a snippet from chapter 4-Why Green IT Is Hard (one of my favorites)", "You can download the book for free, or hold it in your hands in paper form from Amazon ($18) or other vendors. I think a kindle version is planned but the link wasn't working when I last looked.", "Aside from the relevance of the content, I think this is a great example of collaborative working within the IT industry and I only wish that there was a lot more of this kind of thing around. Best of luck from 1E guys!"], "Author": ["Phil Wilcock"], "Date": "2010-06-07 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/06/06/are-you-ready-for-co2k/", "Area": ["Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["Leverage is a great thing. It gives you more power than you originally thought you had, and politicians are masters of leverage.", "On June 2nd, President Obama addressed a gathering at Carnegie Mellon University, and aside from the usual pep-talk standard stuff aroundeconomic recovery, progress and how great we are-ness, he made a great piece of political leverage. Here's the transcript:", "See what he's doing there? Against a background of one of the worst environmental disasters ever, what better time to leverage public and political opinion against the big oil companies and get as much green legislation thru as possible.", ""], "Author": ["Phil Wilcock"], "Date": "2010-06-06 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/06/03/eu-30-emissions-cuts-by-2020-not-so-fast/", "Area": ["Data Center", "Server Power Management"], "Comments": "", "Content": ["The thrust of the Times piece centers on a so called 'leak' from the EU Commission", "This is more like it. Call me a cynic but did you really expect the EU to sign up to such a large increase in the emissions cuts? No, me too. Anyway this all turned out to be a bit disappointing, but it lead me to think that bigger cuts have to come if we are to make a serious impact on the future of the planet. This will mean higher energy prices, and tighter supplies in the future as we hit possible energy shortages. The smart companies out there are already taking steps to reduce energy usage before cuts are imposed on them. If an energy quota system is introduced (and I think that this will have to come at some point), companies will be allocated a quota based on historical usage, so the quicker you reduce your energy consumption the better. I just wish that some journalists would check their facts so that my energy consumption can be reduced too!", ""], "Author": ["Phil Wilcock"], "Date": "2010-06-03 00:00:00"}, {"Tags": ["nightwatchman server edition", "power management", "server power management"], "URL": "http://blogs.1e.com/2010/06/03/upcoming-scug-meeting-11th-june/", "Area": ["1E Products", "SCCM"], "Comments": "", "Content": ["On 11th June, Scott Moss and the System Center User Group has graciously given me the opportunity to provide an overview of the upcoming 1E NightWatchman Server Edition v2.0 tool.", "The event schedule is as follows:", "Presenter", "Topic", "Time", "Scott Moss", "Introductions", "12:00  12:05", "Andy Dominey", "NightWatchman Server Edition 2.0  The Seek and Destroy tool for Server \t\t\tinefficiency and Virtual Machine Sprawl", "12:10  12:40", "Cameron Fuller", "How to create and use custom groups", "12:45  1:20", "Kevin Holman", "Management group checkup  a database perspective", "1:25 - 1:55", "Scott Moss", "SWAG Drawing Open for Questions", "1:55 - 2:10"], "Author": ["Andy Dominey"], "Date": "2010-06-03 00:00:00"}, {"Tags": ["microsoft operations manager", "opsmgr"], "URL": "http://blogs.1e.com/2010/06/03/opsmgr-basics-override-best-practice/", "Area": ["SCCM"], "Comments": [{"Comment": "Howdy, im a professional dancer. id like to see to make a showreel with regard to my promotions. I also need to use some animation. Can someone suggest me a good animation studio, but not really very expensive? Im here for 3 months for a tour.\nLove\n Kim.", "Date": "2011-05-11 08:28:00", "Author": "May 11, 2011 at 8:28 pm"}], "Content": ["This is the first post in a new series based around the basics of Microsoft Operations Manager (OpsMgr), providing entry level information on the core concepts, processes, methodologies and techniques to assist those who are perhaps looking to further their knowledge of OpsMgr or arenew to the product.", "I know this is a strange place to start, however there is method to my madness. As a consultant, I am engaged by customers to not only implement OpsMgr, but also undertake health checks and other maintenance tasks on existing implementations. On far too many occasions, I have found that whilst the OpsMgr administrator(s) have constructed a well tuned and functional environment, they often fail to follow some very simple best practice policies that can potentially save them considerable time in the future.", "One of the most common is a lack of policy around the Creation of Overrides. Rather than re-creating the wheel, you will find a link at the end of this post to an excellent Microsoft Technet article that covers Override Best Practice. There are 2 that I want to highlight here (see below),as these are often overlooked and are key to maintaining a healthy, manageable OpsMgr environment.", "This should be a given, and is in most organisations.I know some will argue that maintaining X number of Custom Management Packs clutters the console and increases complexity. Im not really sure how.A failureto follow this basic principal will ultimately lead to the following scenario:", "You need to delete a Management Pack from your environment, however looking at the dependencies, you can see that Overrides exist in multiple MPs, including the Default Management Pack. This will inevitably mean either a significant amount of lost time hunting down those rules and monitors, or othermeasures having to be taken.", "All of this can be avoided of course, by simply creating a Custom MP for *EVERY* MP you import. A point of clarification though, using Active Directory as an example. You do not need to create a custom MP for Discovery and Monitoring, however I would recommend a custom MP for each version. This gives you the ability to easily remove (for example) the Active Directory 2000 (Monitoring) MP when no longer required.", "This one is not as clear cut and I have seen examples of this in EVERY environment I have been in. For me, Microsoft either need to include the ability to choose a custom MP when disabling from the Overrides menu, or remove the feature all together. All to often this has caused confusion and headaches for the OpsMgr Admin.", "As always, if you have found this article helpful, or would like to provide feedback, please leave a comment."], "Author": ["Dan Kregor"], "Date": "2010-06-03 00:00:00"}, {"Tags": ["free tool", "opsmgr"], "URL": "http://blogs.1e.com/2010/06/01/1e-system-center-watcher-tool-for-opsmgr-now-available/", "Area": ["SCCM"], "Comments": "", "Content": ["I am pleased to announce the official release of 1E System Center Watcher (OMWatcher) for System Center Operations Manager 2007.", "The 1E OMWatcher tool for System Center Operations Manager 2007 fills an important, and often overlooked gap in every OpsMgr environment.", "Arising from the question", "1E OMWatcher is designed to monitor the 3 critical service on the Root Management Server (SDK, Config and HealthService). 1E OMWatcher will proactively mitigate unnecessary and potentially expensive downtime by ensuring the RMS is active (via a ping), and taking remedial action should one of the core RMS services stop. In addition, 1E OMWatcher will notify administrators (via email) were an issue arises.", "1E OMWatcher should be installed on a server other than the RMS (preferably on a secondary Management Server), and configured to run under an account that has local administrative rights on the RMS."], "Author": ["Dan Kregor"], "Date": "2010-06-01 00:00:00"}, {"Tags": ["configmgr", "v.next"], "URL": "http://blogs.1e.com/2010/05/29/system-center-configuration-manager-v-next-first-look-2/", "Area": ["SCCM"], "Comments": "", "Content": ["Recently at the Microsoft Management Summit in Las Vegas, the System Center Team unveiled details around the next version of System Center Configuration Manager, ConfigMgr v.Next.The theme for this version is User Centric Client Management and allows end users to get their applications when they need them regardless of their computing platform and enables the administration to think user first.", "Some other welcomed changes from an administrator point of view are a newly redesigned Admin Console, Role Based Access Control, and Remote Control improvements.The new console now has the same look and feel as the other System Center products, such as System Center Operations Manager and is no longer based on MMC technology.In addition, Role Based Administration will now be part of the product.There will be built-in roles that can be used out of the box for assigning permissions for various tasks such as software distribution and software updates management.Custom roles can also be defined for maximum flexibility.The best part about Role Based Administration is that the role user only sees what is relevant to the role and scope in the console and removes the unnecessary console clutter.Also, Ctrl-Alt-Del is coming back for Remote Control, a useful feature that was available in SMS but was removed in ConfigMgr 2007.", "ConfigMgr v.Next will allow administrators to minimize and consolidate the ConfigMgr infrastructure, as the goal for the new version is a relatively flat hierarchy.The top level site is now called the Central Administration Site and is the recommended location for all administration and reporting for the hierarchy.Distribution Points can now be throttled and scheduled.Distribution Points will now benefit more from Distribution Point Groups.When content is added to a Distribution Point Group, it will automatically be added to all the Distribution Points in the group.", "Primary Sites main function are to service clients and Client Agent settings can now be configured at the Collection level for more granular control.The way that data flows is also changing (no more inboxes), Global Data and Site Data will use SQL, whereas Content will still be file-based.What this means is that Secondary Site will now use SQL (SQL Express by default) for SQL Replication.Also, site servers and site roles will now require 64-bit.Distribution points are the exception, but 32-bit distribution points will operate at reduced functionality.In addition, SQL Reporting Services is the only reporting solution in v.Next.", "There will not be an in-place upgrade from ConfigMgr 2007; however, migration capability of ConfigMgr 2007 objects will be built directly into the v.Next Console.Some of the migration features include the ability to share distribution points during a migration, the ability to schedule migrations and define security scopes, and best of all, clients are going to retain execution history on upgrade.", "Other enhancements are getting added to Software Updates and Operating System Deployment.Software Updates will now have the ability to set up auto deployment rules (i.e. think Windows Defender).State-based update groups will allow update to be deployed individually or in groups.And the best part is updates will automatically go out when added to existing groups. Some of the enhancements coming to Operating System Deployment include the ability to perform offline servicing of images.Boot media will now be hierarchy wide and unattended boot media will be fully unattended.There will be pre-execution hooks to automatically select a task sequence.USMT 4.0 will have tighter integration with the user interface and have support for leveraging hard links.", "Lastly, Mobile Device Management is getting a major overhaul as System Center Mobile Device Manager functionality will be merging into v.Next.As mentioned above, mobile device applications will be delivered using the new Application Model, along with the ability to enable secure, compliant mobile devices.If we get really lucky, we might eventually get support for other mobile platforms.", "There are a ton of other little feature enhancements that are also coming and hopefully I will get a chance to dive into each product feature in more detail in the coming months.The release timeframes for v.Next as announced in the System Center Configuration Manager State of the Union are as follows: Beta 1  May, 2010; Beta 2  Q1 2011; RTM  H2 2011."], "Author": ["Mike Terrill"], "Date": "2010-05-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/05/27/part-2-csc-on-installing-nightwatchman-server-edition-selecting-servers/", "Area": ["1E Customers", "1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2010-05-27 00:00:00"}, {"Tags": ["data center", "federal data center initiative", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/05/25/whitepaper-empowering-energy-efficiency-in-federal-data-centers/", "Area": ["1E Products", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["Just to whet your appetite, some of the topics covered in this paper are:", "IT Asset Utilization", "Consolidation and Power Management", "NightWatchman Server Edition  Quick Wins", ""], "Author": ["Phil Wilcock"], "Date": "2010-05-25 00:00:00"}, {"Tags": ["action for children", "byte night"], "URL": "http://blogs.1e.com/2010/05/21/fancy-sleeping-out-on-the-streets-of-london/", "Area": ["1E Community", "Charity"], "Comments": "", "Content": ["No, didnt think so! There are however some young folks out there night after night who dont have a choice. Theres an enormous chasm of a gap in the care and support provided to kids once they leave the care system, which results in many ending up on the streets with all of the associated problems of such a hazardous life.", "About Action for Children and Byte Night", "Since the beginning, Byte Night has proved to be a huge success not only in terms of raising extremely valuable funds to support young people leaving the care system but also by raising awareness of Action for Children and its work in the IT industry. The benefit of the networking for the IT community associated with Byte Night is an added bonus for all those involved. In 1998 25 people slept out, raising around 25,000 last year 220 people slept out raising 283,000. Year on year, the number of sleepers and funds raised thanks to your support grows!", "Donating through this site is simple, fast and totally secure. It is also the most efficient way to sponsor us: Action for Children, the childrens charity will receive your money faster and, if you are a UK taxpayer, an extra 28% in tax will be added to your gift at no cost to you. (If youre not a UK taxpayer, you can still sponsor us so please dont let this stop you)", "BTW:Although I wont be in London on Byte Night, I will be showing solidarity with the cause by sleeping under a hedgein a field somewhere in Northern England  care to join me? We could tip cows and toast marshmallows!"], "Author": ["Phil Wilcock"], "Date": "2010-05-21 00:00:00"}, {"Tags": ["bill gates", "clouds", "geoengineering"], "URL": "http://blogs.1e.com/2010/05/20/mr-gates-and-his-whiter-than-white-clouds-you-may-need-a-mac-for-this-one/", "Area": ["The Green Room"], "Comments": "", "Content": ["Ive been busy on the farm for the last couple of weeks, trying to make the grass grow, mostly by staring at it, but more sensibly by applying cow manure and aerating the soil. As everyone knows in this age of incessant information bombardment, when you step away from your post for a while, the backlog of stuff that confronts you on your return can be quite amazing. I decided to jumo right in, bite the bullet and scan through all of my news feeds this morning, but very quickly started to feel life ebbing away, so I decided to take a short cut, close my eyes and click on a story at random  and what a story!", "", "Now I can understand how Mr Gates may get a little bored with his spare time. Now that hes conquered the world of computing, created one of the worlds largest corporations and stepped back to let Mr Balmer take over, whats left but to save the world? However, I would rather he focussed on something that quite frankly scares me a little less that interferring with the weather.", "So, simply put, the plan to lower global temeratures and mitigate the effects of all this CO2 that were spewing into the atmosphere goes as follows. We launch 1,900 ships to sail aroundwith really big funnels that pick up and spray minute particles of seawater up to 1,000 meters, which will make the clouds lighter and reflect that nasty sunlight away from mother earth. The British and American scientists involved dont want to wait for international rules on technology that deliberately alters the climate. They believe that the world urgently needs an alternative strategy to protect itself from global warming. Fair enough, but meddling with the weather? Stop it. Now, please. Why is it that we, in our arrogance think that if we throw enough money and/or technology at the planets problems we can master things. We just need to work with nature a bit more, stop wasting all our resources andfaceup to the fact that we really have been a bit wasteful for the last couple of hundred years. Solutions like this from Mr Gates and Silver Lining will only serve to make people believe that we can go on burning whatever we like in whatever quantities we likebecause science will just correct the effects.", "So Mr Gates, Iask that you stop trying to save the world. If your cloud whitening plan backfires,we cant reboot the planet!", ""], "Author": ["Phil Wilcock"], "Date": "2010-05-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2010/04/29/microsoft-configmanager-r3-and-1e-best-of-breed-solutions/", "Area": ["1E Products", "ConfigMgr", "SCCM"], "Comments": "", "Content": ["MMS2010 saw Microsoft's Brad Anderson reveal the long awaited details of the new power management capabilities offered in ConfigMgr R3 during his keynote address. This announcement also provided a seguein the keynote into Sumir Karayi's video explaining the 1E strategy around power management and related security patching at the enterprise level. Following this keynote, 1E delivered its \"Gold\" session to MMS attendees to further expand on all of this.Tuesday of MMS week also sawa press release issued by 1E outlining the importance of the Microsoft/1E strategy.", "Here's a key portion of that press release:", "So what's the bottom line? How does this impact the Systems Administrator? This comes home to roost in several ways.", "First is power management.", "R3 provides the Administrator with a power management solution which may be just fine for your needs. The addition of NightWatchman, however, provides significant capabilities above and beyond those contained in native R3.", "Secondly is the issue of security compliance and patching.", "", "Simply having the ConfigMgr Client installed does not mean you are patch compliant. Are you seeing 100% success with your patch deployments? Are you touching every machine in the estate? Likely not. Does this conversation sound familiar? Have you ever had it?", "Security team to Sys Admin team  Are we completely security compliant? Sys Admin team  We sure are!. All of our PCs with the ConfigMgr client installed definitely are, so long as they were powered up during our maintenance windows, and they are healthy, talking to ConfigMgr to run the updates, and they've been rebooted to apply the installed updates.", "Summarizing all of this, one can clearly see why the combination of Microsoft's Configuration Manager product together with 1E's NightWatchman-series solutions provide a true \"Best in Breed\" combination for realizing both energy efficiencies and all the savings that provides, plus a fast and robust security compliance solution for the enterprise Administrator."], "Author": ["Rod Trent"], "Date": "2010-04-29 00:00:00"}, {"Tags": ["data center", "nightwatchman server edition", "server power management"], "URL": "http://blogs.1e.com/2010/04/29/eu-code-of-conduct-for-data-center-efficiency/", "Area": ["1E News", "Data Center", "Green IT", "Server Power Management"], "Comments": "", "Content": ["Well it's not the most exciting blog title, but it's an important one so bear with me..", "Broadly speaking the code divides the data center into two distinct areas namely the IT load (servers basically!) and the Facilities load (everything else that uses power). In measuring the efficiency of a facility, the ratio of IT load to Failities load will be used to assess the 'facility efficiency', but so called 'asset efficiency' will also be used and this is where we come in. This metric looks at the way in which the IT assets (servers) use the power delivered to them.", "Over the coming months it will be interesting to see some results emerge from this code of conduct. Being able to measure your efforts to a common standard is a great help to our customers who are trying to lower energy use and costs. Watch out for some 1E case studies in this area.."], "Author": ["Phil Wilcock"], "Date": "2010-04-29 00:00:00"}, {"Tags": ["1e", "microsoft systems management", "mms2010", "myitforum"], "URL": "http://blogs.1e.com/2010/04/28/10-years-of-the-microsoft-systems-management-community/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1Es 2010 Blog Year in Review | 1E Blogs", "Author": "1Es 2010 Blog Year in Review | 1E Blogs"}], "Content": [""], "Author": ["Phil Wilcock"], "Date": "2010-04-28 00:00:00"}]