[{"Tags": [], "URL": "http://blogs.1e.com/2011/09/28/is-branchcache-right-for-remote-serverless-software-distribution/", "Area": ["1E Products", "ConfigMgr", "Nomad"], "Comments": [{"Comment": "Pingback: Is BranchCache right for remote, serverless software distribution? - 1E Blog", "Author": "Is BranchCache right for remote, serverless software distribution? - 1E Blog"}], "Content": ["BranchCache is a new feature available in Windows Server 2008 R2 and Windows 7 that reduces WAN bandwidth usage and improves application responsiveness when workstations in a remote location access content from the head office or data center by downloading and caching content on the local network as it is requested, making it immediately available to other clients that subsequently request the same content.", "This paper examines the BranchCache functionality specifically in the context of software distribution using System Center Configuration Manager 2007 to determine if it is an optimal solution for the deployment of software, patches and operating systems to remote, serverless branches."], "Author": ["Rod Trent"], "Date": "2011-09-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/28/significant-energy-savings-without-disrupting-the-work-of-frontline-staff/", "Area": ["1E News", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Significant energy savings without disrupting the work of frontline staff - 1E Blog", "Author": "Significant energy savings without disrupting the work of frontline staff - 1E Blog"}], "Content": ["The IT department has played a key role in Newhams efficiency agenda, from greening the data centre and reducing the number of physical servers to reducing both the footprint and energy consumption of the client-side devices.", "", "By implementing NightWatchman, a power management solution from 1E, on our 1,700 PCs we were able to control the amount of time a computer could stand idle, powering them down when they were not being used.", "Were now looking to deploy Nightwatchman Server Edition on our servers to measure efficiency and identify how many are not doing anything useful, with a view to decommissioning or repurposing them. It is widely believed that 15% of servers are not doing any useful work, so we expect to see more efficiency savings here."], "Author": ["Rod Trent"], "Date": "2011-09-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/25/knowing-how-much-energy-is-a-good-start/", "Area": ["1E Products", "Data Center", "IT Efficiency", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: Knowing how much energy is a good start - 1E Blog", "Author": "Knowing how much energy is a good start - 1E Blog"}], "Content": ["There is a new category of software emerging called Data Center Infrastructure Management (DCIM). Software and tools fall under this banner if they measure, report or manage the energy consumption of data centers. Our NightWatchman Server Edition product does all three for physical and virtual servers and then crucially reveals where energy is being wasted.", "The concept of useful work was built into NightWatchman Server Edition from the start. The question of how much energy? is a good one and reports on that are important, but for me the goal has always been to find out where and when that energy is put to good use. Once you get your hands on that information it becomes much easier to improve efficiency.", "Heres a good example of inefficiency. How often have you experienced that sudden need for a server? Usually its to try out something new and interesting or do a quick bit of testing, something like that. You dont fancy your chances of getting a new server approved and anyway that procurement process takes time. So you embark on a piece of detective work and interrogation that I see all the time. Whos got the latest inventory spreadsheet? Are you still using that server in the lab? This approach is time consuming and beset by inaccuracy and hoarders.", "Of course virtualization is advertised as the fix. Its quick and easy to provision a new server, and you probably dont even have to talk to anybody about it. But is that fixing it or creating a new problem? Ill leave that discussion for another day.", "What I propose is that energy monitoring and reporting by itself doesnt fix the inefficient I need a spare server cycle. But knowing what is powered and not doing anything useful absolutely does. So by attaching usefulness to energy consumption you really can find spare servers in a few minutes and avoid short cuts which lead to sprawl."], "Author": ["Andy Hawkins"], "Date": "2011-09-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/22/webinar-analyst-doug-washburn-on-cost-cutting-and-user-empowerment/", "Area": ["1E News", "Events", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Webinar: Analyst Doug Washburn on Cost Cutting and User Empowerment - 1E Blog", "Author": "Webinar: Analyst Doug Washburn on Cost Cutting and User Empowerment - 1E Blog"}], "Content": ["As cloud computing and the consumerization of IT erodes boundaries from the data center to the desktop, empowered employees can act on their technology needs without involving the IT department. We discuss the tremendous opportunity for organizations to become IT efficient and make going green more profitable.", "When:", "Register your place now:", "http://staging.1e.com/webinar/efficient-it/"], "Author": ["Rod Trent"], "Date": "2011-09-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/22/nomad-enterprise-only-solution-proven-to-scale-to-hundreds-of-thousands-of-endpoints/", "Area": ["1E Products", "Nomad"], "Comments": [{"Comment": "Pingback: Nomad Enterprise: Only solution proven to scale to hundreds of thousands of endpoints - 1E Blog", "Author": "Nomad Enterprise: Only solution proven to scale to hundreds of thousands of endpoints - 1E Blog"}], "Content": ["Nomad from 1E is used to extend the capabilities of our strategic desktop management solution. It now handles around 99 percent of all of our software deployments and patch updates to our 300,000+ desktop and laptop machines.", "Gary M Phillips, Global Head of IT Operations HSBC", ""], "Author": ["Rod Trent"], "Date": "2011-09-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/21/new-article-3-simple-steps-to-cutting-energy-use-costs-with-green-it/", "Area": ["Data Center", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: New Article: 3 Simple Steps to Cutting Energy Use & Costs with Green IT - 1E Blog", "Author": "New Article: 3 Simple Steps to Cutting Energy Use & Costs with Green IT - 1E Blog"}, {"Comment": "Pingback: Gartners Top 10 IT Challenges and how 1E fits | 1E Blogs", "Author": "Gartners Top 10 IT Challenges and how 1E fits | 1E Blogs"}], "Content": ["Regardless of size, most companies now have a sustainability strategy. Whether its due to good economic sense, a corporate desire to do the right thing, an evolving business model, or adhering to government mandates, the necessity for businesses to operate in a more sustainable manner has become the topic of the day.", "In the short term, most businesses look to simplify operations through the most obvious means such as adopting recycling policies, implementing energy-efficient lighting and limiting travel by allowing employees to work from home and teleconferencing. While these can have a direct and immediate impact, it is the greening of the technology within a company that can provide far more significant sustainability benefits.", ""], "Author": ["Rod Trent"], "Date": "2011-09-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/21/webinar-empower-your-users-and-cut-costs-with-efficient-it/", "Area": ["1E News", "Events", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Webinar: Empower your users and cut costs with Efficient IT - 1E Blog", "Author": "Webinar: Empower your users and cut costs with Efficient IT - 1E Blog"}], "Content": ["", "", "Click the image to register:"], "Author": ["Rod Trent"], "Date": "2011-09-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/21/how-much-time-is-poor-client-health-costing-you/", "Area": ["1E Products", "PC Power Management"], "Comments": [{"Comment": "Pingback: How much time is poor client health costing you? - 1E Blog", "Author": "How much time is poor client health costing you? - 1E Blog"}], "Content": ["myITforum.com is hosting a survey to identify organizations pain points when dealing with the health of the PC estate. This is a noteworthy poll and only takes a couple seconds of your time to participate  plus you can view the current results, which you will find interesting."], "Author": ["Rod Trent"], "Date": "2011-09-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/21/revolutionize-your-software-distribution/", "Area": ["1E Products", "Nomad"], "Comments": [{"Comment": "Pingback: Revolutionize your software distribution - 1E Blog", "Author": "Revolutionize your software distribution - 1E Blog"}], "Content": ["Using spare network bandwidth, Nomad Enterprise securely delivers operating system upgrades, software deployments and patches to thousands of PCs, servers and sites over your existing infrastructure without disruption. Nomad Enterprise resolves this by:", ""], "Author": ["Rod Trent"], "Date": "2011-09-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/21/does-virtualization-alone-make-your-datacenter-more-it-efficient/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman Server", "Server Power Management"], "Comments": "", "Content": ["If you virtualize 100 percent of your physical servers today then you will be running more operating system instances than you started with. The physical and environmental footprint has changed but you still need to monitor, patch, secure, backup and license the virtualized servers and now the host servers as well. Requirements such as high availability further increase infrastructure costs. Yet the publicity of energy and space savings has created a mindset that virtualized servers are cheap.", "Consolidation through virtualization therefore is only a partial answer to becoming more IT efficient.", "Whats the complete answer?", "Server Efficiency: Make significant savings in your data center"], "Author": ["Rod Trent"], "Date": "2011-09-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/21/maximizing-it-efficiency-regional-launch-munich-germany/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Maximizing IT Efficiency Regional Launch, Munich, Germany - 1E Blog", "Author": "Maximizing IT Efficiency Regional Launch, Munich, Germany - 1E Blog"}, {"Comment": "Pingback: Anonymous", "Author": "Anonymous"}], "Content": ["1E is very excited to be hosting its regional launch event in the Barcelona Room of the Westin Grand Hotel in Munich on September 29th from 2pm.", "Guest speakers include:", "Dinner and evening hospitality is also planned for those available to attend."], "Author": ["Rod Trent"], "Date": "2011-09-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/20/koomeys-law-and-moores-law-at-odds-not-so/", "Area": ["Data Center", "Server Efficiency"], "Comments": [{"Comment": "Pingback: Koomeys law and Moores law at odds? Not so. - 1E Blog", "Author": "Koomeys law and Moores law at odds? Not so. - 1E Blog"}, {"Comment": "Pingback: Koomey", "Author": "Koomey"}, {"Comment": "One important thing to add to your summary abovethe trends we identified in our article preceded Moores law and appear to be an inherent feature of computing that relies on electrons for switching.  So we saw comparable rates of change in efficiency in the vacuum tube and discrete transistor eras as we saw once microprocessors were introduced.  That was an unexpected result that surprised us a lot.", "Date": "2011-12-18 11:15:00", "Author": "Jonathan Koomey"}], "Content": ["So, theres a new law in town? Moores law is a thing of the past and its now Koomeys law that is making inroads into theoretical thinking. Not really. In reality, it appears that Moores law and Koomeys law may be parts of the same stream of thought, with Koomey being a side effect of the increase in processing power."], "Author": ["Rod Trent"], "Date": "2011-09-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/20/itbusinessedge-interview-1e-and-the-datacenter/", "Area": ["Data Center", "Green IT", "IT Efficiency", "Server Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Gartners Top 10 IT Challenges and how 1E fits | 1E Blogs", "Author": "Gartners Top 10 IT Challenges and how 1E fits | 1E Blogs"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-09-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/20/the-easiest-most-cost-efficient-way-to-deploy-windows-7/", "Area": ["1E Products", "Nomad", "Shopping"], "Comments": [{"Comment": "Pingback: The easiest, most cost efficient way to deploy Windows 7 - 1E Blog", "Author": "The easiest, most cost efficient way to deploy Windows 7 - 1E Blog"}], "Content": ["Windows 7 deployment strategies are numerous, and each one presents a solution to the unique adversities faced in every organization. But, despite potential deployment pitfalls and speed bumps, the deployment of Windows 7 in the organization brings huge value that outweighs waiting. It just makes good business sense to deploy the latest operating system. Those companies that have already deployed Windows 7 have experienced more stability and improved features that makes the business function better.", "But, did you know theres still a better way to deploy Windows 7? One that saves time and money?", "Nomad provides the ability to deploy the operating system upgrade across the network any time of the day by allowing IT to manage the bandwidth of the network. Nomad intelligently makes use of available bandwidth without interruption to critical services, ensuring that delivery of the Windows 7 upgrade is successful. Nomad even eliminates the pains of deploying Windows 7 across slow links.", "And, to ensure that the end-user is never interrupted from providing business value, Shopping allows the end-user to decide when the Windows 7 upgrade takes place. Who knows their schedule better than the end-user? Having the ability to upgrade their PC during downtime  or even while at home  provides huge value to both the end-user and the IT department. The IT department creates the deployment files, adds it to the Shopping catalog, and then makes it available as a purchased product, all the while enabling full monitoring capability and licensing tracking.", "If this sounds like something that can provide real value to your Windows 7 rollout, check out the following links."], "Author": ["Rod Trent"], "Date": "2011-09-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/20/reduce-operating-costs-and-accelerate-distribution-of-software-patches-and-os-upgrades/", "Area": ["1E Products", "Nomad"], "Comments": "", "Content": ["Read all about it and watch our latest video:", "http://staging.1e.com/software/nomad-enterprise/streamlined-systems-management/"], "Author": ["Rod Trent"], "Date": "2011-09-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/19/new-article-efficient-software-deployment-via-the-enterprise-app-store/", "Area": ["1E Products", "Shopping", "Software Asset Management"], "Comments": [{"Comment": "Pingback: New Article: Efficient Software Deployment Via the Enterprise App Store - 1E Blog", "Author": "New Article: Efficient Software Deployment Via the Enterprise App Store - 1E Blog"}], "Content": ["Did you know?", "Software accounts for up to 22% of every IT budget and is increasing, by nearly 5%, to just over $231bn worldwide (by end of 2010). The dilemma for many organizations is the ability to track and monitor its usage. With software vendor audits becoming commonplace, 61% of polled enterprises said that they had been audited in the past year. Organizations generally overspend on software to ensure compliance, leaving many applications left unused on the shelf (shelfware) and unused on users desktops (orphan licenses).", "Our own Richard Cudd has an article posted on EnterpriseFeatures.com that talks through how this happens and what solutions and methods are available to get this under control in your organization.", ""], "Author": ["Rod Trent"], "Date": "2011-09-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/19/pc-power-management-agent-versus-agentless-the-series/", "Area": ["1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: PC Power Management  Agent versus Agentless: The Series - 1E Blog", "Author": "PC Power Management  Agent versus Agentless: The Series - 1E Blog"}, {"Comment": "Pingback: PC Power Management ", "Author": "PC Power Management "}], "Content": ["This page is the placeholder for the entire series. Well continue to bust myths on this topic as we hear new ones crop up. If youve reviewed a PC Power Management solution before, Im positive youve heard some of these and will definitely find value in knowing the truth.", ""], "Author": ["Rod Trent"], "Date": "2011-09-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/19/nomad-enterprise-and-microsoft-configuration-manager-2012-still-better-together/", "Area": ["1E Products", "ConfigMgr", "Nomad"], "Comments": [{"Comment": "Pingback: Nomad Enterprise and Microsoft Configuration Manager 2012: still better together - 1E Blog", "Author": "Nomad Enterprise and Microsoft Configuration Manager 2012: still better together - 1E Blog"}], "Content": ["This whitepaper describes the cost savings that can be realized by using Nomad Enterprise v4.0 with Microsoft Configuration Manager 2012.", "Download the free whitepaper", "", ""], "Author": ["Rod Trent"], "Date": "2011-09-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/16/nomad-enterprise-streamlined-systems-management/", "Area": ["1E Products", "Nomad"], "Comments": [{"Comment": "Pingback: Nomad Enterprise: Streamlined systems management - 1E Blog", "Author": "Nomad Enterprise: Streamlined systems management - 1E Blog"}], "Content": [""], "Author": ["Rod Trent"], "Date": "2011-09-16 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/14/agent-versus-agentless-myth-busting-server-power-management/", "Area": ["1E Products", "IT Efficiency", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Agent versus Agentless Myth Busting: Server power management - 1E Blog", "Author": "Agent versus Agentless Myth Busting: Server power management - 1E Blog"}], "Content": ["Using an agent for a server power management solution is the only way to identify whether useful work is being carried out on a server. This is the only way to accurately determine if a server is being used, enabling you to easily discover and decommission the 15% of servers doing no useful work.", "There is also no solution for true useful work detection with an agentless approach as this data is not exposed remotely.", "Missed a post in this series? If youve ever heard a vendor tell you that agentless is better than agented, youll definitely want to catch up on this series."], "Author": ["Rod Trent"], "Date": "2011-09-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/13/agent-versus-agentless-myth-busting-protecting-user-data/", "Area": ["1E Products", "Green IT", "IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Agent versus Agentless Myth Busting: Protecting user data - 1E Blog", "Author": "Agent versus Agentless Myth Busting: Protecting user data - 1E Blog"}, {"Comment": "Pingback: PC Power Management  Agent versus Agentless: The Series | 1E Blogs", "Author": "PC Power Management  Agent versus Agentless: The Series | 1E Blogs"}], "Content": ["An agent running on the system is capable of local data collection, correlation and processing. Taking PC power management as an example, the agent can make better decisions based on activity that happens locally, for example whether the user is active before prompting to power off the system.", "An agent running on the machine can query the operating system to check when the user last used the machine and whether he is logged on locally or remotely in order to defer or force the low power state. With multiple users logged on, each users documents can be saved before logging off. In summary, user productivity is not disrupted.", "With agentless technology, there is reliance on remote methods to find interactive user sessions which have a dependency on specific remote accessible APIs that cannot return whether the sessions are really active i.e. user logged on and working.", "", "Missed a post in this series? Heres links to some key factors that may make you think twice before listening to an agentless vendor."], "Author": ["Rod Trent"], "Date": "2011-09-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/13/software-licensing-inefficiency-in-the-datacenter/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman Server"], "Comments": "", "Content": ["The overprovisioning of servers in data centers is rife and 15% are not actively used has led to inefficient use of hardware. On top of that theres software license waste through unused and partially used applications on organizations servers. Anecdotal evidence echoes analysts opinions that the total cost of licensing and running servers could be as much as 80-90% of total software spend.", "Businesses buy $billions worth of enterprise applications such as ERP, CRM, finance systems and many more. This includes an enormous outlay on the cost of the infrastructure software that enables virtualization. Many of these applications have different and complex licensing rules. It is important to understand actual usage and whether, for example, a premium license could be replaced by a standard one or even cancelled if its not used.", "There are many different models of licensing for example, per CPU, per RAM, per user. Sometimes this complexity is so complicated that organizations tend to overprovision as they cant understand what they need to do. So no one truly understands how to be truly efficient or feels comfortable that they have exactly the right number of licenses and getting true business value."], "Author": ["Rod Trent"], "Date": "2011-09-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/12/1e-nomad-the-most-intelligent-bandwidth-management-solution/", "Area": ["1E Products", "Green IT", "IT Efficiency", "Nomad"], "Comments": [{"Comment": "Pingback: 1E Nomad: The most intelligent bandwidth management solution - 1E Blog", "Author": "1E Nomad: The most intelligent bandwidth management solution - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-09-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/09/appclarity-analysis-tool-version-2-1-released/", "Area": ["1E News", "1E Products", "AppClarity", "IT Efficiency", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: AppClarity Analysis Tool version 2.1 released - 1E Blog", "Author": "AppClarity Analysis Tool version 2.1 released - 1E Blog"}], "Content": [], "Author": ["Geoff Collins"], "Date": "2011-09-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/09/appclarity-2-1-is-now-available-with-four-new-abilities/", "Area": ["1E News", "1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: AppClarity 2.1 is now available with four new abilities! - 1E Blog", "Author": "AppClarity 2.1 is now available with four new abilities! - 1E Blog"}, {"Comment": "Pingback: AppClarity Analysis Tool version 2.1 released | 1E Blogs", "Author": "AppClarity Analysis Tool version 2.1 released | 1E Blogs"}], "Content": [], "Author": ["Geoff Collins"], "Date": "2011-09-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/09/agent-versus-agentless-myth-busting-agentless-means-there-is-no-agent-at-all/", "Area": ["IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Agent versus Agentless Myth Busting: Agentless means there is no agent at all - 1E Blog", "Author": "Agent versus Agentless Myth Busting: Agentless means there is no agent at all - 1E Blog"}, {"Comment": "Pingback: PC Power Management  Agent versus Agentless: The Series | 1E Blogs", "Author": "PC Power Management  Agent versus Agentless: The Series | 1E Blogs"}, {"Comment": "Well, from an agentless product install manual I see you need to do this just to install it:\n1) Configure WMI security (several sub steps)\n2) Configure COMsecurity (several sub steps)\n3) Configure firewall (several sub steps)\n4) Configure network sharing model (several sub steps)\n5) Configure UAC (several sub steps)\n6) Configure registry permissions (several sub steps)\n7) Configure filesystem permissions (several sub steps)", "Date": "2011-11-23 09:44:00", "Author": "Juan Pablo Garcia"}], "Content": ["So what does agentless really mean? Agentless generally means that you will not have to install a software agent to perform any power monitoring. While this might be technically true for a moment, agentless is really a misnomer.", "Agentless implies that since there is no software to install, it is therefore easier to deploy, manage and maintain. In most cases, the supposed agentless solution simply uses the agents that come with another vendors product instead, such as: Windows WMI or SNMP Service. The Windows SNMP service is not fully configured or enabled by default in Windows XP and above; you have to manually configure it which is not easy to do. Configuring security for WMI namespaces and enabling DCOM remote access is not trivial either. Although you dont have to install an agent, you may have to spend an almost equal amount of time configuring the built in one.", "Agent-based technologies are like having a spy in the ranks  giving you a lot more information than you would get from just looking through a telescope (agentless). With an agent-based approach you get greater command and control capabilities, more granular information gathering and much less impact on the network. There are the additional benefits in real-time reporting (detecting which workstations are no longer in use or servers that are not being useful) which brings the sought for benefits of Power Management (by powering them down).", "Check out the Agentless versus Agentless myths you may have missed already"], "Author": ["Rod Trent"], "Date": "2011-09-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/08/whats-the-cost-of-virtualizing-the-datacenter/", "Area": ["Data Center", "Green IT", "IT Efficiency", "NightWatchman Server", "Server Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Whats the cost of virtualizing the datacenter? - 1E Blog", "Author": "Whats the cost of virtualizing the datacenter? - 1E Blog"}, {"Comment": "Pingback: What", "Author": "What"}, {"Comment": "document.location=", "Date": "2011-09-09 01:06:00", "Author": "September 9, 2011 at 1:06 am"}], "Content": ["The main reason why companies had so many individual servers was that performance and capability could be compromised unless applications ran on separate ones, it also made maintenance easier as well as the fact that servers were relatively cheap compared to monolithic mainframes.", "As companies have grown either organically or through mergers and acquisitions so have their server estates. This server sprawl has led to inefficiencies in the use of data center resources so many companies have aimed to mitigate it through virtualization.", "There is also the issue of cost. The standard specification of a server purchased to host virtual machines (VMs) is usually much higher than a standalone server. Hosting multiple virtualized servers requires more CPUs and significantly more memory both of which contribute to higher power requirements and heat output.", ""], "Author": ["Rod Trent"], "Date": "2011-09-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/08/greening-it-should-be-part-of-any-sustainability-plan/", "Area": ["Data Center", "Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Greening IT should be part of any Sustainability plan - 1E Blog", "Author": "Greening IT should be part of any Sustainability plan - 1E Blog"}], "Content": ["Nick proves his point through various components of the IT organization, such as the datacenter, PC estate, and even software licensing and reclamation.", "This is a great read. Jump to the link when you get a chance."], "Author": ["Rod Trent"], "Date": "2011-09-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/08/1es-nomad-easily-handles-the-largest-environments-and-the-most-massive-software-and-operating-system-rollouts/", "Area": ["1E Products", "IT Efficiency", "Nomad", "OS Deployment"], "Comments": [{"Comment": "Pingback: 1Es Nomad easily handles the largest environments and the most massive software and operating system rollouts - 1E Blog", "Author": "1Es Nomad easily handles the largest environments and the most massive software and operating system rollouts - 1E Blog"}, {"Comment": "Pingback: 1E", "Author": "1E"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-09-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/08/increasing-your-it-efficiency/", "Area": ["Data Center", "IT Efficiency"], "Comments": "", "Content": ["New tools designed for IT efficiency help identify what is useful and when. This knowledge makes it easy to establish an on-going process to reclaim unused resources and avoid unnecessary spend.", "Traditional tools designed for systems and operations management struggle to deliver reports on the useful work a server is doing. Often a report of how busy a CPU is over time is used to represent how much usage took place. Most servers are loaded with standard software that has to be on every corporate server  antivirus software, systems management, back up and event monitoring  so each server looks busy but they fail to reveal when or if that CPU usage provided business value.", "Although virtualization has clear benefits, including a reduction in energy consumption and floor space to get the most out of virtualization you should be prepared to invest in tools which monitor efficiency, specifically the amount of useful work your IT assets are doing."], "Author": ["Rod Trent"], "Date": "2011-09-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/08/agent-versus-agentless-myth-busting-agents-open-up-the-machines-to-security-vulnerabilities/", "Area": ["IT Efficiency", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Agent versus Agentless Myth Busting: Agents open up the machines to security vulnerabilities - 1E Blog", "Author": "Agent versus Agentless Myth Busting: Agents open up the machines to security vulnerabilities - 1E Blog"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Agentless means there is no agent at all | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Agentless means there is no agent at all | 1E Blogs"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Server power management | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Server power management | 1E Blogs"}, {"Comment": "Pingback: PC Power Management  Agent versus Agentless: The Series | 1E Blogs", "Author": "PC Power Management  Agent versus Agentless: The Series | 1E Blogs"}], "Content": ["This myth is particularly humorous when one of the biggest pluses to any power management solution is the ability to actually secure the computer estate.  A company that deploys a power management solution can restart PCs during the night, apply patches successfully, and then shut the PCs down again to conserve energy.", "Most agentless protocols have no additional security, relying on the security of the underlying remote connectivity protocols. However, requiring an account with administrative privileges across all machines is a much bigger security issue.", "In case you missed the previous Agent versus Agentless myth busting posts, have a read through Part 1 and Part 2."], "Author": ["Rod Trent"], "Date": "2011-09-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/07/strategies-to-streamline-and-reduce-waste-in-your-datacenter/", "Area": ["Data Center", "IT Efficiency", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: Strategies to streamline and reduce waste in your datacenter - 1E Blog", "Author": "Strategies to streamline and reduce waste in your datacenter - 1E Blog"}], "Content": ["Earlier this summer (July 2011) the US federal government announced plans to shut 40 percent of its data centers over the next four years. With more than 2000 data centers, the Obama Administration realized that data center consolidation was part of a broader strategy to become more IT efficient and make substantial savings (predictions run into billions of dollars a year).", "Many large organizations today find themselves in the same boat, albeit on a smaller scale, where they are choosing to make economies of scale by running fewer data centers and reducing their overheads.", "Over the past 20 years, the commoditization of computing in the datacenters has seen physical servers shrink in size. Initially, their combined bulk took up the space of a room, which then reduced to the size of a fridge and now to the size of a pizza box. Add to this, that for the past 40 years processing capacity has been doubling approximately every two years and this trend is expected to continue until at least 2020.", "These factors of power density and increased processing capacity have contributed to the higher power and cooling demands in data centers. In fact it may be cheaper, in some instances, to build a new datacenter to accommodate such energy demands than to retrofit an old one."], "Author": ["Rod Trent"], "Date": "2011-09-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/07/agent-versus-agentless-myth-busting-interference-with-the-operating-system-and-applications/", "Area": ["1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Agent versus Agentless Myth Busting: Interference with the operating system and applications - 1E Blog", "Author": "Agent versus Agentless Myth Busting: Interference with the operating system and applications - 1E Blog"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Agentless means there is no agent at all | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Agentless means there is no agent at all | 1E Blogs"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Agents open up the machines to security vulnerabilities | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Agents open up the machines to security vulnerabilities | 1E Blogs"}, {"Comment": "Pingback: PC Power Management  Agent versus Agentless: The Series | 1E Blogs", "Author": "PC Power Management  Agent versus Agentless: The Series | 1E Blogs"}], "Content": ["Today, however, we want to cover the next biggest piece of misinformation that vendors attempt to employ during negotiations. You generally hear these things from sales guys who dont realize they are talking to technical folks who know better. If its a technical guy from a vendor saying this stuff  you know, the one whos going to help implement and support their solution  well, maybe hes not so technical after all.", "So, the second biggest myth is that an agent causes interference with the operating system and applications. This is hogwash. Heres why:", "A low level agent running in the background listening to operating system events has less of an effect on a machine than executing a remote query. Posting data back to the server using HTTP is very cheap. Low resource consumption is claimed for agentless environments  which is not strictly true as the server is using technology (WMI, SNMP) on the machine to execute similar queries which causes resource utilization. An advantage of having an agent in this case is that queries can be targeted to the native operating system API and hence can result in less overall resources utilization."], "Author": ["Rod Trent"], "Date": "2011-09-07 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/06/dell-and-it-efficiency-two-great-posts-that-read-great-together/", "Area": ["1E News", "1E Products", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Dell and IT Efficiency: Two great posts that read great together - 1E Blog", "Author": "Dell and IT Efficiency: Two great posts that read great together - 1E Blog"}], "Content": ["Two separate posts, on two separate web sites today talk about Dells 2011 green successes.", "A quick breakdown suggests that:", "These successes are huge and really shows how committed Dell is to lead the way in improving efficiency and eliminating waste within the organization.", "If youve not seen it yet, heres a wonderful video case study from Dell. Angie Stahl does a great job describing how 1E is used throughout the Dell organization."], "Author": ["Rod Trent"], "Date": "2011-09-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/06/nomad-from-1e-provides-the-best-most-cost-effective-solution-for-a-global-windows-7-desktop-rollout-at-hsbc/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Nomad from 1E provides the best, most cost-effective, solution for a global Windows 7 desktop rollout at HSBC - 1E Blog", "Author": "Nomad from 1E provides the best, most cost-effective, solution for a global Windows 7 desktop rollout at HSBC - 1E Blog"}, {"Comment": "Pingback: Nomad from 1E provides the best, most cost-effective, solution for a global Windows 7 desktop roll", "Author": "Nomad from 1E provides the best, most cost-effective, solution for a global Windows 7 desktop roll"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-09-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/06/agent-versus-agentless-myth-busting-agented-software-usually-places-additional-load-on-the-network/", "Area": ["1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Agent versus Agentless Myth Busting: Agented software usually places additional load on the network - 1E Blog", "Author": "Agent versus Agentless Myth Busting: Agented software usually places additional load on the network - 1E Blog"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Interference with the operating system and applications | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Interference with the operating system and applications | 1E Blogs"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Agents open up the machines to security vulnerabilities | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Agents open up the machines to security vulnerabilities | 1E Blogs"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Agentless means there is no agent at all | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Agentless means there is no agent at all | 1E Blogs"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Protecting user data | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Protecting user data | 1E Blogs"}, {"Comment": "Pingback: Agent versus Agentless Myth Busting: Server power management | 1E Blogs", "Author": "Agent versus Agentless Myth Busting: Server power management | 1E Blogs"}, {"Comment": "Pingback: PC Power Management  Agent versus Agentless: The Series | 1E Blogs", "Author": "PC Power Management  Agent versus Agentless: The Series | 1E Blogs"}], "Content": ["One of the first pieces of misinformation that vendors attempt to employ during negotiations is that an agentless solution will produce far less network bandwidth and congestion. Heres why that isnt necessarily the case:", "Agents can employ intelligent data caching and spooling to send up less data than an agentless solution would. The agent can send up data when the status changes or differences only. Reports are batched up and sent up at random intervals, which means that the load on the network is minimized.", "Agentless servers create data requests centrally to remotes devices, which then reply with data. This bi-directional chatter will generally consume far more network bandwidth."], "Author": ["Rod Trent"], "Date": "2011-09-06 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/02/server-efficiency-make-significant-savings-in-your-data-center-2/", "Area": ["Data Center", "IT Efficiency", "Server Efficiency"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-09-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/01/learn-what-it-efficiency-really-is-in-an-upcoming-webinar-by-forrester-and-1e/", "Area": ["Events", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Learn what IT Efficiency really is in an upcoming Webinar by Forrester and 1E - 1E Blog", "Author": "Learn what IT Efficiency really is in an upcoming Webinar by Forrester and 1E - 1E Blog"}], "Content": ["To cut costs and improve satisfaction, IT leaders must become more efficient with their IT budgets, use of IT resources, and the selection of IT devices and applications. As cloud computing and the consumerization of IT erodes boundaries from the data center to the desktop, empowered employees can act on their technology needs without involving the IT department. There is also a tremendous opportunity for organizations to become IT efficient and to make going green more profitable."], "Author": ["Rod Trent"], "Date": "2011-09-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/09/01/on-the-ground-at-teched-2011-australia-edition-auteched/", "Area": ["Events"], "Comments": [{"Comment": "Pingback: On the ground at TechEd 2011- Australia edition #auteched - 1E Blog", "Author": "On the ground at TechEd 2011- Australia edition #auteched - 1E Blog"}], "Content": ["============================="], "Author": ["Rod Trent"], "Date": "2011-09-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/31/what-you-could-be-missing-out-on-by-not-choosing-nomad-for-you-configuration-manager-2007-implementation/", "Area": ["1E Products", "Nomad"], "Comments": [{"Comment": "Pingback: What you could be missing out on by not choosing Nomad for your Configuration Manager 2007 implementation - 1E Blog", "Author": "What you could be missing out on by not choosing Nomad for your Configuration Manager 2007 implementation - 1E Blog"}], "Content": ["To put it in even simpler terms, this graphic gives you a quick overview of what your infrastructure could look like with Nomad.  Bet youd love your ConfigMgr implementation to look like that!", "And, when you get a chance, watch and listen to customer who is using it:", "Incidentally, Nomad will fully support ConfigMgr 2012 when it is released."], "Author": ["Rod Trent"], "Date": "2011-08-31 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/30/1e-up-for-4-awards-in-the-windows-it-pro-best-it-products-and-services-of-2011/", "Area": ["1E News", "Awards"], "Comments": [{"Comment": "Pingback: 1E up for 4 awards in the Windows IT Pro Best IT Products and Services of 2011 - 1E Blog", "Author": "1E up for 4 awards in the Windows IT Pro Best IT Products and Services of 2011 - 1E Blog"}, {"Comment": "Testing something.", "Date": "2011-08-30 12:01:00", "Author": "Rod Trent"}], "Content": ["If you feel so inclined (and we hope you do!) drop out to the following link and get your vote in today:", "These awards are community choice awards, so your vote has a significant weight. The voting ends on September 7th."], "Author": ["Rod Trent"], "Date": "2011-08-30 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/30/gartner-adds-it-efficiency-to-the-sustainability-list-and-so-do-we/", "Area": ["IT Efficiency"], "Comments": [{"Comment": "Pingback: Gartner adds IT Efficiency to the Sustainability list, and so do we - 1E Blog", "Author": "Gartner adds IT Efficiency to the Sustainability list, and so do we - 1E Blog"}], "Content": ["eWeek has an article that talks about how Gartner has also come to this conclusion and is prescribing that businesses include IT Efficiency in the sustainability plan.", "Some significant quotes from the article:", "Gartner predicts the position of sustainability will rapidly move up the company priority list by 2015.", "Mingay believes that, in IT provision, energy-efficiency moves on their own cannot meet tomorrows challenges. The much bigger opportunity is applying IT to analyse, optimise, manage and otherwise improve the sustainability performance of the business itself."], "Author": ["Rod Trent"], "Date": "2011-08-30 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/30/businesses-urged-to-improve-green-reporting/", "Area": ["Data Center", "Green IT", "NightWatchman", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Businesses Urged To Improve Green Reporting - 1E Blog", "Author": "Businesses Urged To Improve Green Reporting - 1E Blog"}], "Content": ["eWeek Europe posted an article yesterday, that talks about how the Environmental Agency (EA) has cut its CO2 emissions by almost a fifth. The EA goes on to urge others to join in its success.", "How did the EA do it? Per the article:", "Well it seems that it began use cleaner vehicles that helped reduce its carbon dioxide emissions. It also installed water saving technology in many its buildings and this has resulted in 12,000 m3 less water being used than five years ago.", "Vehicle mileage was apparently reduced by helping staff make more sustainable travel choices. And office waste was reduced through a combination of improved recycling facilities and awareness raising with staff.", "Another green improvement was installing voltage optimisation kit across 40 Environment Agency sites, that helped it cut energy use on average by eight percent at those sites.", "It also said that automatic meter reading is being used at 500 sites which accounts for around 90 percent of total consumption. This, according to the EA, allows for better real time energy monitoring and management, reduces staff time in taking readings at remote sites, and results in accurate billing by its energy suppliers."], "Author": ["Rod Trent"], "Date": "2011-08-30 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/29/1e-to-showcase-it-efficiency-solutions-at-tech-ed-australia/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1E to Showcase IT Efficiency Solutions at Tech.Ed Australia - 1E Blog", "Author": "1E to Showcase IT Efficiency Solutions at Tech.Ed Australia - 1E Blog"}], "Content": ["TechEd Australia attendees can learn how the City of Melbourne worked with 1E to prevent 1.6m kg of C02 from entering the atmosphere.", "Gold Coast, Australia (PRWEB) August 29, 2011", "1E, the global leader in Efficient IT, will demonstrate the companys award-winning solutions on booth #53 at Tech.Ed Australia on the Gold Coast in Queensland from 30th August until 2nd September 2011. 1E will exhibit at the show with local partners including Corporate Network Integration, a Systems Management and desktop deployment specialist in Australia.", "Who: Microsoft ISV/Software Innovation Partner of the Year 2010, 1Ehas helped its 1,400 customers, including Dell, CSC, the City of Melbourne and KiwiBank save more than $550 million in energy costs alone, cutting CO2 emissions by 4.5 million tons.", "To give just one example of a local customer success story, as a result of deploying NightWatchman Enterprise from 1E on just 1,000 desktop PCs, City of Melbourne:", "What: 1E will be sharing IT efficiency best practices to demonstrate how to easily report on IT savings in line with recent carbon tax legislation impacting organizations nationwide on booth #53 at the conference.", "When: 1E will be exhibiting at the World of Solutions Expo, during Tech.Ed Australia from 30th August until 2nd September 2011.", "Party: 1E is also sponsoring the AU Tech.Heads Party, which takes place after the Tech.Ed Welcome party, on Tuesday 30th August from 9.30pm-00.00am local time. Attendance is free for up to 250 guests from the AU Tech.Heads community and your RSVP in advance is essential. Attendees are welcome to enter the pre-party competition  the winner will be selected at random on the night."], "Author": ["Rod Trent"], "Date": "2011-08-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/29/energy-efficiency-can-save-missouri-6-1-billion-and-create-8500-local-jobs/", "Area": ["1E News", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Energy Efficiency Can Save Missouri $6.1 Billion and Create 8,500 Local Jobs - 1E Blog", "Author": "Energy Efficiency Can Save Missouri $6.1 Billion and Create 8,500 Local Jobs - 1E Blog"}], "Content": ["In the news today, its being reported that a new Energy Efficiency study (by the American Council for an Energy-Efficient Economy (ACEEE)) has been released for the state of Missouri. In it, they state that Missourians can realize $6.1 billion in lower energy bills and create 8,500 new, local jobs by 2025 by following the prescriptive guidance in the study.", "This is a huge report (124 pages), but is becoming standard fare for U.S. states, government, and organizations who are looking to improve their overall energy savings. If Missouri were to be the baseline, there is a LOT to do in the U.S to get the country in compliance with mandates and policies.", "Fortunately, 1E gets it and were immediately available to help in bringing Energy Efficiency to organizations, to save jobs, improve jobs, and provide solutions that save energy, cost, and CO2 now.", "Globally over the past five years $8 trillion has been spent on IT, which is more than half the US GDP. Maintaining this huge amount of IT accounts for 70-80 percent of each years IT budget. CIOs want to reduce this figure to save money or to have more discretionary spend, but lack the tools to do so.", "1E is the pioneer and global leader in Efficient IT solutions. 1Es mission is to identify unused IT, help remove it and optimize everything else. 1E solutions help reduce servers, network bandwidth constraints, software license bills, energy consumption and many time consuming IT tasks."], "Author": ["Rod Trent"], "Date": "2011-08-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/26/1es-paul-thomsen-at-the-september-meeting-of-the-minnesota-system-center-user-group/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1Es Paul Thomsen at the September meeting of the Minnesota System Center User Group - 1E Blog", "Author": "1Es Paul Thomsen at the September meeting of the Minnesota System Center User Group - 1E Blog"}, {"Comment": "Pingback: 1E", "Author": "1E"}], "Content": ["Please plan to join if you can!", "", "MNSCUG scores another nationally known speaker!"], "Author": ["Rod Trent"], "Date": "2011-08-26 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/25/server-efficiency-make-significant-savings-in-your-data-center/", "Area": ["1E News", "1E Products", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: Server Efficiency: Make significant savings in your data center - 1E Blog", "Author": "Server Efficiency: Make significant savings in your data center - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-08-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/25/1es-upcoming-events-for-2011/", "Area": ["1E News", "Events"], "Comments": "", "Content": ["TechEd, Gold Coast, Australia", "Aug 30  Sept 2, 2011", "The IT Silicon Cup, Isle of Wight, UK", "Sept 15-16, 2011", "Maximizing IT Efficiency Regional Launch, Munich, Germany", "Sept 29, 2011", "IAITAM 2011 ACE, Aria Resort & Casino, Las Vegas", "Oct 12-14 , 2011", "Green IT Expo, Westminster, London, UK", "Nov 1, 2011", "Spiraling energy prices, incoming legislation, new reporting requirements, political pressure and growing consumer awareness are all becoming key factors in the move towards more sustainable business. 1E is delighted to be a key sponsor of Green IT Expo 2011 which provides a complete one-stop-shop for senior IT and business decision-makers to identify environmentally-friendly technologies, green innovations and socially responsible suppliers that can help them rise to these new challenges."], "Author": ["Rod Trent"], "Date": "2011-08-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/25/save-equivalent-electricity-in-a-year-for-every-household-in-norfolk-to-boil-a-kettle-150-times/", "Area": ["1E News", "1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Save equivalent electricity in a year for every household in Norfolk to boil a kettle 150 times - 1E Blog", "Author": "Save equivalent electricity in a year for every household in Norfolk to boil a kettle 150 times - 1E Blog"}], "Content": ["Joanne Goddard, group senior corporate responsibility manager at Aviva, said: We had two competing legitimate policies. From an energy perspective, there was a requirement to switch off all equipment when not in use. However, there was also an IT need to have computers on at least part of the night so that upgrades could be applied. The 1E solution allows both to be satisfied."], "Author": ["Rod Trent"], "Date": "2011-08-25 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/24/nightwatchman-ensures-carbon-reduction-at-aviva/", "Area": ["1E News", "1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: NightWatchman ensures carbon reduction at Aviva - 1E Blog", "Author": "NightWatchman ensures carbon reduction at Aviva - 1E Blog"}], "Content": ["Like many companies Aviva faced a dilemma between turning PCs off to save electricity and emissions and needing them on to apply patches, which generally has to be done after work hours to keep disruption to a minimum.", "We had two competing legitimate policies regarding switching off PCs, explained Goddard. From an energy perspective, there was, and indeed still is, a requirement to switch off all equipment when not in use. However there was also an IT need to have computers on at least part of the night so that upgrades could be applied.", "Aviva initially trialled NightWatchman on 856 PCs in its UK office. Data was collected over a period of one week and revealed a number of interesting stats. 60% of desktop PCs and 18% of laptops were being left on overnight. On weekends, 57% of desktops and 30% of monitors were being left on, but only 7% were actually being used.", "The number of laptops left on overnight was a particular surprise as we would have expected laptops by virtue of being portable to be removed from desks overnight and at weekends, Goddard explained.", "Once the trial had been deemed successful Aviva proceeded with a rollout across 30,000 PCs in the UK. While the exact cost savings will vary with electricity tariffs, the company has been able to forecast other savings from using the software. This includes projected savings of 7,706,610 kWh of electricity per year across 30,000 PCs and equivalent emissions reduction of 4,138 metric tonnes of CO2."], "Author": ["Rod Trent"], "Date": "2011-08-24 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/23/new-whitepaper-agents-or-agentless/", "Area": ["1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: New Whitepaper: Agents or Agentless? - 1E Blog", "Author": "New Whitepaper: Agents or Agentless? - 1E Blog"}], "Content": ["We just posted a new whitepaper today about the differences (and value and benefits) of a power management system that uses standalone agents versus no agents at all. Youll be really surprised at the results. It answers the age old questions about the approaches, advantages and challenges of deploying technologies that use agents versus agentless ones.", "I plan on going into this in greater detail here shortly, but for now, Ill leave you with the link to download the whitepaper."], "Author": ["Rod Trent"], "Date": "2011-08-23 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/22/news-you-can-use-1e-and-cisco-team-up-to-extend-it-energy-use-oversight/", "Area": ["1E News", "1E Partners"], "Comments": [{"Comment": "Pingback: News you can use: 1E and Cisco team up to extend IT energy use oversight - 1E Blog", "Author": "News you can use: 1E and Cisco team up to extend IT energy use oversight - 1E Blog"}], "Content": ["UK-based 1E has confirmed that it has teamed up with Cisco to produce a version of its NightWatchman application that integrates with Ciscos EnergyWise energy use monitoring system, providing a means of tracking energy consumption across a companys entire IT infrastructure, including servers, PCs, laptops, peripheral devices and even building energy management systems."], "Author": ["Rod Trent"], "Date": "2011-08-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/22/navigating-the-expo-floor-at-teched-australia-1st-swag-auteched/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: Navigating the Expo floor at TechEd Australia-1st SWAG #auteched - 1E Blog", "Author": "Navigating the Expo floor at TechEd Australia-1st SWAG #auteched - 1E Blog"}], "Content": ["Heres some collateral for you for the upcoming TechEd event in Australia. Lets count this as your first bit of conference SWAG.", "Click the image for the full view", "or, just download the floor layout in PDF format and store on your computer or mobile device for easy access:"], "Author": ["Rod Trent"], "Date": "2011-08-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/22/1e-sponsored-techhead-australia-party/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1E sponsored TechHead Australia Party #AuTechHeads #auteched - 1E Blog", "Author": "1E sponsored TechHead Australia Party #AuTechHeads #auteched - 1E Blog"}], "Content": ["1E is a proud sponsor of the event, so not only will you be able to hook up with us at our booth (#53), but youll be able to find us at the TechHead party, too.", "To attend, you must register and RSVP.", "And, heres the details:", ""], "Author": ["Rod Trent"], "Date": "2011-08-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/12/dont-virtualize-waste/", "Area": ["1E News", "Data Center", "Green IT", "IT Efficiency", "Server Power Management"], "Comments": [{"Comment": "Pingback: Dont Virtualize Waste - 1E Blog", "Author": "Dont Virtualize Waste - 1E Blog"}, {"Comment": "Pingback: Don", "Author": "Don"}], "Content": ["", "", ""], "Author": ["Rod Trent"], "Date": "2011-08-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/11/greenbang-new-1e-software-targets-it-upgrade-inefficiencies/", "Area": ["1E News", "1E Products", "Nomad", "Windows 7"], "Comments": [{"Comment": "Pingback: Greenbang: New 1E software targets IT upgrade inefficiencies - 1E Blog", "Author": "Greenbang: New 1E software targets IT upgrade inefficiencies - 1E Blog"}], "Content": ["", "HSBC is using 1Es Nomad to handle around 99 percent of all of our software deployments and patch updates to our fleet of desktop and laptop machines, said Gary M. Phillips, the banks global head of IT operations. Before adopting the software, he added, the only alternative was to deploy a software distribution point in every site."], "Author": ["Rod Trent"], "Date": "2011-08-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/10/does-the-cloud-have-a-silver-lining/", "Area": ["Data Center", "Green IT", "IT Efficiency"], "Comments": [{"Comment": "Pingback: Does The Cloud have a silver lining? - 1E Blog", "Author": "Does The Cloud have a silver lining? - 1E Blog"}], "Content": ["The industry is struggling with certain aspects of the cloud. One of those is how the carbon footprint can be measured. And, with government mandates everywhere to ensure new technology is implemented in an efficient and environmentally conscious manner, the details start to get cloudy.", "Its not magic; its mathematics, said Radu Gheorghievici-Pohl, an executive at IT efficiency firm 1E. With energy costs fluctuating, he says, companies must address whats in their control.", "You have to deal with energy in a more conscious way, he said. Nobody knows how prices will be developing in the next period.", "", "We appreciate having the opportunity to speak to this ever-growing issue. 1E, of course, is the leader in IT Efficiency solutions and our expertise in this area is unmatched. There are interesting times ahead as the cloud storms deeper into the technology landscape and infrastructure. And, as we already know, preparation and proper planning is the only way to move forward. 1E is always available to lend insight and aide borne from years of experience. The cloud may seem like a new topic to some, but 1E has been providing solutions for efficiency in technology since its inception."], "Author": ["Rod Trent"], "Date": "2011-08-10 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/09/reuters-feds-adopting-green-it-but-lag-on-tracking-progress/", "Area": ["Green IT", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: Reuters: Feds Adopting Green IT, but Lag on Tracking Progress - 1E Blog", "Author": "Reuters: Feds Adopting Green IT, but Lag on Tracking Progress - 1E Blog"}], "Content": ["In the news today, a piece about Green ITs status in government agencies is highlighted. On Reuters:", "Government agencies are beginning to make good on these orders, but most havent created baselines or targets to measure progress, according to a recent report (PDF) from the Government Accountability Office (GAO). This makes it impossible to tell whether the efforts are truly advancing President Obamas sustainability agenda.", "Read the entire article:", "http://www.reuters.com/article/2011/08/08/idUS61830248220110808", "Based on the GAO report, cited in the article, agencies have taken steps to implement requirements, but additional guidance on measuring performance is needed.", "Two executive orders, from 2007 and 2009 respectively, assign responsibility to federal agencies for increasing their environmental sustainability and contain green IT-related requirements. These requirements include acquiring electronic products that meet certain environmental standards, extending the useful life of electronic equipment, implementing power management on computers, and managing federal data centers in a more energy efficient manner.", "", "Heres the piece about todays story that makes me pause: if you have no baselines, monitoring, or reporting in place to start with  how can you actually determine if any progress is actually being made (beginning to make good on orders)? Part of any project needs to start with the ability to measure. And, the GAO has it right when they make their primary recommendation to develop baselines for the executive order goals as well as targets that can measure quantifiable benefits, such as energy or cost savings."], "Author": ["Rod Trent"], "Date": "2011-08-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/09/software-usage-monitoring-and-works-councils-it-can-be-done/", "Area": ["1E Products", "AppClarity", "Software Asset Management", "Software License Optimization"], "Comments": [{"Comment": "Pingback: The ITAM Review: Software Usage Monitoring and Works Councils  It Can Be Done! - 1E Blog", "Author": "The ITAM Review: Software Usage Monitoring and Works Councils  It Can Be Done! - 1E Blog"}, {"Comment": "Pingback: The ITAM Review: Software Usage Monitoring and Works", "Author": "The ITAM Review: Software Usage Monitoring and Works"}], "Content": ["Many systems management tools such as Microsoft System Center Configuration Manager 2007 have the ability to monitor application usage.", "When combined with tools such as AppClarity from 1E, this can be used to find and reclaim unused software. This technology enables organizations to make substantial savings in their software spend, but sometimes the politics can be more complex than the technology.", "Read the entire article:"], "Author": ["Rod Trent"], "Date": "2011-08-09 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/08/1e-shopping-howto-enabling-end-users-to-migrate-to-windows-7-on-their-schedule/", "Area": ["1E Products", "Shopping", "Windows 7"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2011-08-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/08/shopping-howto-creating-and-publishing-an-application/", "Area": ["1E Products", "Shopping"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2011-08-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/08/dell-talking-the-1e-partnership-and-how-they-have-adopted-the-full-suite-of-1e-solutions/", "Area": ["1E Customers", "1E News", "1E Products", "Shopping"], "Comments": [{"Comment": "Pingback: Dell on the 1E partnership and how they have adopted the full suite of 1E solutions - 1E Blog", "Author": "Dell on the 1E partnership and how they have adopted the full suite of 1E solutions - 1E Blog"}], "Content": [""], "Author": ["Rod Trent"], "Date": "2011-08-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/08/customer-spotlight-andrew-king-with-cdm/", "Area": ["1E News", "1E Products", "Shopping"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2011-08-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/08/1e-nightwatchmanextending-system-center-configuration-manager-2007-r3-for-advanced-power-management/", "Area": ["1E News", "ConfigMgr", "NightWatchman", "SCCM"], "Comments": "", "Content": [], "Author": ["Rod Trent"], "Date": "2011-08-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/08/1e-gets-a-big-web-site-refreshtell-us-what-you-think/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: 1E gets a big web site refreshtell us what you think - 1E Blog", "Author": "1E gets a big web site refreshtell us what you think - 1E Blog"}, {"Comment": "Pingback: 1E gets a big web site refresh", "Author": "1E gets a big web site refresh"}], "Content": ["Weve been working on ways to better reach our customers and help spread the news about the huge value of our products. One of those ways was to complete a refresh of our web site, allowing you to find things more quickly and giving us the ability to communicate more effectively.", "Take a quick tour of the newly minted web site and let us know what you think  good or bad. Any suggestions? Leave them in the comments area.", ""], "Author": ["Rod Trent"], "Date": "2011-08-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/08/1e-empowers-it-efficiency/", "Area": ["1E News", "IT Efficiency"], "Comments": "", "Content": ["The global leader in IT Efficiency solutions, 1E develops software and services that improve IT efficiency by identifying and reducing both costs and waste in hardware, software, energy and time."], "Author": ["Rod Trent"], "Date": "2011-08-08 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/05/customer-spotlight-ford-motor-company/", "Area": ["1E News", "1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Customer spotlight: Ford Motor Company - 1E Blog", "Author": "Customer spotlight: Ford Motor Company - 1E Blog"}], "Content": ["In the past as many as 60 percent of Fords PC users havent shut their PCs off at the end of the day, resulting in wasted energy. Going forward, well be able to manage PC power consumption more efficiently while minimizing disruptions during the working day.", "Keith Forte, Ford Motor Company"], "Author": ["Rod Trent"], "Date": "2011-08-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/05/1e-releases-shopping-4-0/", "Area": ["1E News", "1E Products", "Shopping", "Windows 7"], "Comments": [{"Comment": "Pingback: 1E releases Shopping 4.0 - 1E Blog", "Author": "1E releases Shopping 4.0 - 1E Blog"}, {"Comment": "The company added that with Shopping 4.0, the IT department stands to save a significant amount of time tracking and installing applications, while at the same time maintaining control of the number of deployments and being able to black out certain days or hours if needed.", "Date": "2011-08-06 01:49:00", "Author": "1E releases shopping"}, {"Comment": "IT efficiency software provider 1E has released version 4.0 of its ", "Date": "2011-08-06 01:51:00", "Author": "1E releases shopping"}], "Content": ["IT efficiency software provider 1E has released version 4.0 of its app store for the enterprise Shopping.", "With Shopping 4.0, users can schedule their own Windows 7 migration and select which applications to restore and install with their new Operating System, said 1E.", "The company added that with Shopping 4.0, the IT department stands to save a significant amount of time tracking and installing applications, while at the same time maintaining control of the number of deployments and being able to black out certain days or hours if needed.", "Read the entire annoncement on CBR:"], "Author": ["Rod Trent"], "Date": "2011-08-05 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/04/customer-spotlight-xl-winterthur-international/", "Area": ["1E News", "1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Customer spotlight: XL Winterthur International - 1E Blog", "Author": "Customer spotlight: XL Winterthur International - 1E Blog"}], "Content": ["Does your software just work? Or are you putting a lot of effort behind minimal returns?"], "Author": ["Rod Trent"], "Date": "2011-08-04 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/03/customer-spotlight-national-instruments/", "Area": ["1E Products", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Customer spotlight: National Instruments - 1E Blog", "Author": "Customer spotlight: National Instruments - 1E Blog"}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-08-03 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/02/jerry-rutkowski-vice-president-for-federal-programs-at-1e-on-federal-news-radio-about-it-efficiency/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Jerry Rutkowski, vice president for federal programs at 1E on Federal News Radio about IT Efficiency - 1E Blog", "Author": "Jerry Rutkowski, vice president for federal programs at 1E on Federal News Radio about IT Efficiency - 1E Blog"}], "Content": ["The new rule has evinced mixed reactions from industry.", "Listen in here:", "http://www.federalnewsradio.com/?nid=15&sid=2478520"], "Author": ["Rod Trent"], "Date": "2011-08-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/02/datacenters-power-use-less-than-was-expected/", "Area": ["1E News", "Data Center", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: Datacenters Power Use Less Than Was Expected - 1E Blog", "Author": "Datacenters Power Use Less Than Was Expected - 1E Blog"}, {"Comment": "Pingback: Datacenters", "Author": "Datacenters"}], "Content": ["Making its rounds across the mediasphere over the past couple days is a piece on how the originally predicted values of power use in the datacenter are contradictory to the actual output. Thats a good thing. As more and more companies look to centralize data storage, apps, and operations to the cloud, efficiency of the datacenter is the key factor. Why replace a power-hungry model with another power-hungry model?", "Key findings from the new study are as follows:", "Assuming that the midpoint between the Upper and Lower bound cases accurately reflects the history, electricity used by data centers worldwide increased by about 56% from 2005 to 2010 instead of doubling (as it did from 2000 to 2005), while in the US it increased by about 36% instead of doubling.", "Electricity used in global data centers in 2010 likely accounted for between 1.1% and 1.5% of total electricity use, respectively. For the US that number was between 1.7 and 2.2%.", "Electricity used in US data centers in 2010 was significantly lower than predicted by the EPAs 2007 report to Congress on data centers. That result reflected this studys reduced electricity growth rates compared to earlier estimates, which were driven mainly by a lower server installed base than was earlier predicted rather than the efficiency improvements anticipated in the report to Congress.", "While Google is a high profile user of computer servers, less than 1% of electricity used by data centers worldwide was attributable to that companys data center operations.", "In summary, the rapid rates of growth in data center electricity use that prevailed from 2000 to 2005 slowed significantly from 2005 to 2010, yielding total electricity use by data centers in 2010 of about 1.3% of all electricity use for the world, and 2% of all electricity use for the US.", "", "", "Andtake a look at the most recent Server energy and efficiency report"], "Author": ["Rod Trent"], "Date": "2011-08-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/02/always-on-pcs-wasting-30m-a-day/", "Area": ["1E News", "1E Products", "Green IT", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Always-on PCs wasting 30m a day - 1E Blog", "Author": "Always-on PCs wasting 30m a day - 1E Blog"}], "Content": ["The UKs small businesses waste up to 30.8m a day by not turning PCs off overnight, according to new research from energy giant E.ON.", "The utility firm commissioned a survey of almost 800 small and medium sized businesses, and found that 39 per cent do not regularly shut down their computers overnight, while 20 per cent only fully turn off their PCs at weekends.", "Read the rest:"], "Author": ["Rod Trent"], "Date": "2011-08-02 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/01/partner-spotlight-microsoft-on-1e/", "Area": ["1E Customers", "1E News", "1E Partners", "ConfigMgr", "NightWatchman", "PC Power Management"], "Comments": [{"Comment": "Pingback: Partner spotlight: Microsoft on 1E - 1E Blog", "Author": "Partner spotlight: Microsoft on 1E - 1E Blog"}], "Content": [""], "Author": ["Rod Trent"], "Date": "2011-08-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/08/01/clare-grogan-talks-about-how-to-become-an-adoption-champion-as-national-adoption-week-gets-closer/", "Area": ["1E Community", "1E News", "Charity"], "Comments": "", "Content": ["", "", "", ""], "Author": ["Rod Trent"], "Date": "2011-08-01 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/29/100-courtneys-to-celebrate-1es-courtney-austin-on-his-upcoming-wedding/", "Area": ["1E Community"], "Comments": "", "Content": ["We love having fun, particularly at Courtneys expense! Whats it like to show up to a celebration party and have only yourself to party with?", "Congratulations, Courtney!"], "Author": ["Rod Trent"], "Date": "2011-07-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/29/att-on-1es-nightwatchman/", "Area": ["1E Products", "NightWatchman"], "Comments": [{"Comment": "Pingback: AT&T on 1Es NightWatchman - 1E Blog", "Author": "AT&T on 1Es NightWatchman - 1E Blog"}, {"Comment": "Pingback: AT&T on 1E", "Author": "AT&T on 1E"}], "Content": ["Powering down corporate PCs during nonwork hours is expected to save AT&T more than 135 million kilowatt hours of electricity a year and eliminate 123,941 tons of carbon dioxide emissions  equivalent to the electricity required to power 14,892 homes.", "Rick Felts, Senior Vice President of Information Technology Operations, AT&T", ""], "Author": ["Rod Trent"], "Date": "2011-07-29 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/28/1e-coming-to-the-gold-coast-30th-august-2nd-september-2011-for-teched-2011-auteched-msteched/", "Area": ["1E News", "Events"], "Comments": [{"Comment": "Pingback: 1E coming to the Gold Coast 30th August  2nd September, 2011 for TechEd 2011 #AuTechEd #msteched - 1E Blog", "Author": "1E coming to the Gold Coast 30th August  2nd September, 2011 for TechEd 2011 #AuTechEd #msteched - 1E Blog"}, {"Comment": "Pingback: 1E coming to the Gold Coast 30th August ", "Author": "1E coming to the Gold Coast 30th August "}], "Content": [], "Author": ["Rod Trent"], "Date": "2011-07-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/28/upgrading-to-ie9-with-1es-nightwatchman-produces-significant-savings/", "Area": ["1E News", "NightWatchman"], "Comments": [{"Comment": "Pingback: Upgrading to IE9, with 1Es NightWatchman, produces significant savings - 1E Blog", "Author": "Upgrading to IE9, with 1Es NightWatchman, produces significant savings - 1E Blog"}, {"Comment": "Pingback: Upgrading to IE9, with 1E", "Author": "Upgrading to IE9, with 1E"}], "Content": ["Microsoft suggests in a blog post, that an IE9 upgrade will save costs. But, I dont think they go far enough in the post because there is a cost to actually deploying the upgrade. Microsoft has always provided deployment value for their customers by making deployment kits available for Internet Explorer. This makes it a tad bit easier. But, distributing the upgrade is still costly. The only way to minimize this inherent cost is to, potentially, deploy it at night or when the end-user requests it during business downtime. And, if you know 1E and the 1E products, you know the best way to complete the cost savings picture is using a couple key components of our efficiency solutions.", "", "", "Forrester interviewed six companies that were part of Microsofts IE9 Technology Adoption Program (TAP) to assess the impact of upgrading from Internet Explorer 8 to Internet Explorer 9. This data was used to model the economic impact a composite organization of 50,000 desktops may expect from deploying Internet Explorer 9. The results show there is a compelling financial reason to move to Internet Explorer 9."], "Author": ["Rod Trent"], "Date": "2011-07-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/28/video-1es-andy-hawkins-discusses-integration-with-cisco-energywise-at-cisco-live-2011-cl11/", "Area": ["1E News", "1E Partners"], "Comments": "", "Content": ["Watch it online"], "Author": ["Rod Trent"], "Date": "2011-07-28 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/27/how-to-unearth-efficiency-in-your-it-organization/", "Area": ["IT Efficiency"], "Comments": [{"Comment": "Pingback: How to unearth efficiency in your IT organization - 1E Blog", "Author": "How to unearth efficiency in your IT organization - 1E Blog"}], "Content": ["Here are the questions:", "To better understand how these questions can be used and to bring it all into focus, you can read through the article here:", "http://www.americanbanker.com/btn/24_4/unearthing-efficiency-1034935-1.html"], "Author": ["Rod Trent"], "Date": "2011-07-27 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/22/stay-in-touch-with-1e-on-your-amazon-kindle-or-kindle-software/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Stay in touch with 1E on your Amazon Kindle (or Kindle software) - 1E Blog", "Author": "Stay in touch with 1E on your Amazon Kindle (or Kindle software) - 1E Blog"}], "Content": ["If youre a Kindle owner, or run the Kindle app on a mobile device, you can jump out to Amazon.com today, subscribe to our Kindle feed, and start following us no matter you travel. No need to grab an RSS feed, or visit our web site (though we definitely love it when you do!). Were delivered wirelessly to your Kindle.", ""], "Author": ["Rod Trent"], "Date": "2011-07-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/22/pxe-lite-example-bare-metal-installation-with-pxe-lite/", "Area": ["1E News", "1E Products", "Windows 7"], "Comments": "", "Content": ["This video demonstrates the core functioning of PXE Lite by showing how bare-metal builds can be performed in the most efficient way possible without requiring any IT administrative involvement resulting in lowered deployment costs and reduced timeliness."], "Author": ["Rod Trent"], "Date": "2011-07-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/22/nomad-branch-example-advertisement-to-install-microsoft-windows-7/", "Area": ["1E News", "1E Products", "Nomad", "Windows 7"], "Comments": [{"Comment": "Pingback: Nomad Branch Example: Advertisement to install Microsoft Windows 7 - 1E Blog", "Author": "Nomad Branch Example: Advertisement to install Microsoft Windows 7 - 1E Blog"}], "Content": ["This video demonstrates the core functioning of Nomad Branch by showing how IT data transfers can be made in the most reliable and efficient way possible without requiring any IT administrative involvement resulting in increased deployment success rates and significantly reduced business impact."], "Author": ["Rod Trent"], "Date": "2011-07-22 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/21/shopping-version-4-released/", "Area": ["1E News"], "Comments": [{"Comment": "Pingback: Shopping version 4 released - 1E Blog", "Author": "Shopping version 4 released - 1E Blog"}], "Content": ["Along with the recent and already successful release of AppClarity, I believe we now have a very comprehensive solution set for managing software distribution and software waste.  With the strength of the combined solutions you not only get software waste management but license control too.", "In the product teams were all excited about how we will further integrate these solutions in the future."], "Author": ["Richard Cudd"], "Date": "2011-07-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/21/customer-spotlight-mark-cochrane-core-infrastructure-director-vnext-on-1es-nomad/", "Area": ["1E Customers", "1E News", "1E Products", "Nomad"], "Comments": "", "Content": [""], "Author": ["Rod Trent"], "Date": "2011-07-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/21/customer-spotlight-video-brian-mason-senior-engineer-fortune-500-finance-company-on-1es-nomad/", "Area": ["1E Customers", "1E News", "1E Products", "Nomad"], "Comments": "", "Content": ["Nomad Enterprise at a Fortune 500 company. Brian Mason talks about the challenges big organizations face with large networks and variable bandwidths and how Nomad simplifies the process of software distribution minimizing loss of network availability.", ""], "Author": ["Rod Trent"], "Date": "2011-07-21 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/20/1es-pov-of-cisco-live-2011-interview-with-andy-hawkins-cl11/", "Area": ["1E News", "1E Partners", "1E Products", "Data Center", "Events", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: 1Es POV of Cisco Live 2011, interview with Andy Hawkins #cl11 - 1E Blog", "Author": "1Es POV of Cisco Live 2011, interview with Andy Hawkins #cl11 - 1E Blog"}, {"Comment": "Pingback: 1E", "Author": "1E"}], "Content": ["", "Andy was gracious enough to answer some of my questions. One key and critically important aspect of Cisco Live (as youll read below) is our new partnership with Cisco and our integration with their EnergyWise solution. Heres the interview:", "", "The commonality between all these devices is the network, and thats where Cisco EnergyWise comes in. It provides a standardized way to monitor and manage the energy use of network connected devices. 1E software provides the intelligence required to maximize savings without causing disruption and delivers the reports which prove the benefits in financial and environmental terms."], "Author": ["Rod Trent"], "Date": "2011-07-20 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/19/1e-in-the-microsoft-environment-partner-showcase/", "Area": ["1E News", "1E Products", "Data Center", "Green IT", "NightWatchman", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: 1E in the Microsoft Environment Partner Showcase - 1E Blog", "Author": "1E in the Microsoft Environment Partner Showcase - 1E Blog"}], "Content": ["Check out the Microsoft Environment web site and say Hi to us while youre there.", "http://www.microsoft.com/environment/products-and-solutions/partner-showcase.aspx"], "Author": ["Rod Trent"], "Date": "2011-07-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/19/data-center-energy-management-has-no-accountability/", "Area": ["1E News", "1E Products", "Data Center", "IT Efficiency", "NightWatchman Server"], "Comments": [{"Comment": "Pingback: Data center energy management has no accountability - 1E Blog", "Author": "Data center energy management has no accountability - 1E Blog"}, {"Comment": "Pingback: Data center energy management ", "Author": "Data center energy management "}], "Content": ["Ambrose McNevin posted an article today on the DatacenterDynamics web site. In it, he says, Efficiency is at odds with operational mandate.", "He also indicates that the ISO 500001 standard itself does not measure or deliver higher levels of energy efficiency but it is designed to ensure every person within an organisation has some accountability.", "Read the full article:", "http://www.datacenterdynamics.com/focus/archive/2011/07/data-center-energy-management-has-no-accountability"], "Author": ["Rod Trent"], "Date": "2011-07-19 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/18/with-high-technology-business-is-often-going-to-be-ahead-of-government-says-1e-ceo-in-time-interview/", "Area": ["1E News", "1E Products", "Data Center", "IT Efficiency"], "Comments": [{"Comment": "Pingback: With high technology, business is often going to be ahead of government says 1E CEO in TIME interview - 1E Blog", "Author": "With high technology, business is often going to be ahead of government says 1E CEO in TIME interview - 1E Blog"}, {"Comment": "Pingback: Anonymous", "Author": "Anonymous"}], "Content": ["Obviously government standards that would require more energy-efficient IT would be a boon for 1E, but Karayi would prefer to let industry make its own standards. With high technology, business is often going to be ahead of government, says Karayi. You risk having inferior technologies frozen in place.", "Read the full article:"], "Author": ["Rod Trent"], "Date": "2011-07-18 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/15/1e-video-case-study-candace-labelle-program-director-csc-on-nightwatchman-server-edition/", "Area": ["1E News", "NightWatchman", "NightWatchman Server"], "Comments": "", "Content": ["NightWatchman Server Edition at CSC. Candace Labelle talks about how CSC are using NightWatchman Server Edition to provide reports on server energy usage and identify which servers are good candidates for decommissioning or virtualization."], "Author": ["Rod Trent"], "Date": "2011-07-15 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/14/the-green-it-report-1e-targets-the-german-market/", "Area": ["1E News", "Data Center", "Green IT", "NightWatchman", "NightWatchman Server", "PC Power Management", "Server Power Management"], "Comments": [{"Comment": "Pingback: The Green IT Report: 1E targets the German market - 1E Blog", "Author": "The Green IT Report: 1E targets the German market - 1E Blog"}], "Content": ["Despite some competitors in the German market, The Green IT Report give us an excellent shot:", "Its a good time to be in the German green IT market, but 1E is not going to have it all its own way. Most of its main power management rivals already have at least some dedicated German presence, be it in-house or through a partner. There is also a small local solution provider in the form of Enviprot (founded by an ex-Sybase European Marketing Manager) that sells at very low prices to the public sector, which must be a prime target sector for 1E.", "On the other hand, 1E is not just a one-trick pony. The company now has a range of software aimed at making ICT operations more energy efficient, so it has a stronger base to work from than most of its rivals.", "Read the full article:", "http://www.thegreenitreview.com/2011/07/1e-targets-german-market.html"], "Author": ["Rod Trent"], "Date": "2011-07-14 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/13/1e-at-cisco-live-day-2-cl11-energywise/", "Area": ["1E News", "1E Partners", "Data Center", "Events", "NightWatchman Server", "Server Power Management"], "Comments": [{"Comment": "Pingback: 1E at Cisco Live, Day 2 #cl11 #energywise - 1E Blog", "Author": "1E at Cisco Live, Day 2 #cl11 #energywise - 1E Blog"}], "Content": ["Heres a couple photos from Day 2.", ""], "Author": ["Rod Trent"], "Date": "2011-07-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/13/it-efficiency-could-help-offset-co2-from-canceling-germanys-nuclear-program/", "Area": ["1E News", "IT Efficiency"], "Comments": "", "Content": ["Read through the full article:", "http://www.sustainableplant.com/2011/07/it-efficiency-could-help-offset-co2-from-canceling-germany-s-nuclear-program/"], "Author": ["Rod Trent"], "Date": "2011-07-13 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/12/gigaom-cleantech-apocalypse-no-but-its-cyclical/", "Area": ["1E News", "Data Center", "Green IT"], "Comments": [{"Comment": "Pingback: Gigaom: Cleantech apocalypse? No, but its cyclical - 1E Blog", "Author": "Gigaom: Cleantech apocalypse? No, but its cyclical - 1E Blog"}, {"Comment": "Pingback: Gigaom: Cleantech apocalypse? No, but it", "Author": "Gigaom: Cleantech apocalypse? No, but it"}], "Content": ["However, I think Katie seems to indicate that Cleantech is the *only* way for a sustainable future, and thats not quite the case. Even during the downturn of the cycle organizations can do simple things like monitor and reduce power consumption. The financial benefits from these alone can be significant. So, while the worlds economy does play a factor in a full and complete acceptance of Cleantech, there are still things that can be done  to help save the economy, or at least run technology more efficiently in an effort to do a part.", "Katie makes a compelling case and the article is definitely worth the read:", "http://gigaom.com/cleantech/cleantech-apocalypse-no-but-its-cyclical/"], "Author": ["Rod Trent"], "Date": "2011-07-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/12/1e-joins-the-cisco-energywise-partner-ecosystem-cl11-energywise/", "Area": ["1E News", "1E Partners"], "Comments": [{"Comment": "Pingback: 1E joins the Cisco EnergyWise Partner Ecosystem #cl11 #energywise - 1E Blog", "Author": "1E joins the Cisco EnergyWise Partner Ecosystem #cl11 #energywise - 1E Blog"}], "Content": ["", ""], "Author": ["Rod Trent"], "Date": "2011-07-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/12/the-1e-booth-was-supercharged-on-monday-night-of-cisco-live-cl11-energywise/", "Area": ["1E News", "1E Partners", "1E Products", "Data Center", "Events", "Server Power Management"], "Comments": [{"Comment": "Pingback: The 1E booth was supercharged on Monday night of Cisco Live #cl11 #energywise - 1E Blog", "Author": "The 1E booth was supercharged on Monday night of Cisco Live #cl11 #energywise - 1E Blog"}], "Content": ["Heres a couple additional photos for a send off.", "", "Our fabulous booth just before the mad rush!", "", "", "The 1E polar bears are waiting for a good home. Take one home today! If you have kids, this is THE single piece of SWAG you need."], "Author": ["Rod Trent"], "Date": "2011-07-12 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/11/1e-at-cisco-livesetting-up-cl11-energywise/", "Area": ["1E News", "1E Partners", "1E Products", "Data Center", "Events"], "Comments": [{"Comment": "Pingback: 1E at Cisco LiveSetting up #cl11 #energywise - 1E Blog", "Author": "1E at Cisco LiveSetting up #cl11 #energywise - 1E Blog"}, {"Comment": "Pingback: 1E at Cisco Live", "Author": "1E at Cisco Live"}], "Content": ["Heres some quick photos from the first day. Were extremely excited to see all of you stop by our excellent booth (#2140).", "Click on each image to see it in all its glory."], "Author": ["Rod Trent"], "Date": "2011-07-11 00:00:00"}, {"Tags": [], "URL": "http://blogs.1e.com/2011/07/08/view-and-manage-server-resources-with-the-1e-ipadiphone-app/", "Area": ["1E News", "1E Products"], "Comments": [{"Comment": "Pingback: View and manage Server resources with the 1E iPad/iPhone app - 1E Blog", "Author": "View and manage Server resources with the 1E iPad/iPhone app - 1E Blog"}], "Content": ["Requirements: Compatible with iPhone, iPod touch and iPad. Requires iOS 3.1.3 or later.", "Get it on iTunes:", "http://itunes.apple.com/gb/app/serverview/id431584281?mt=8"], "Author": ["Rod Trent"], "Date": "2011-07-08 00:00:00"}]